anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
PowerSleepTestReport powerSleepTestReport;
ShieldReceiverProbeReport shieldReceiverProbeReport;
Nrf24SpectrumController nrf24SpectrumController;
Nrf24SignalFinder nrf24SignalFinder;
Nrf24PassiveSpectrumReport nrf24SpectrumReport;
BoardNrf24PassiveSpectrum boardNrf24Spectrum;
Cc1101SignalFinder cc1101SignalFinder;
Cc1101SpectrumController cc1101SpectrumController;
Cc1101PassiveSpectrumReport cc1101SpectrumReport;
BoardCc1101PassiveSpectrum boardCc1101Spectrum;
SpectrumViewport spectrumViewport;
std::array<std::uint8_t, SpectrumViewport::kMaxBins> spectrumIntensity{};
std::array<std::uint16_t, Layout::ScreenWidth> spectrumScanline{};
enum class FullGuidedRfStep : std::uint8_t {
    Idle,
    Nrf24Sweep,
    Cc1101Sweep,
    Complete,
    Failed,
    Cancelled,
};
const char* fullGuidedRfStepName(FullGuidedRfStep step) {
    switch (step) {
        case FullGuidedRfStep::Idle: return "idle";
        case FullGuidedRfStep::Nrf24Sweep: return "nrf24_sweep";
        case FullGuidedRfStep::Cc1101Sweep: return "cc1101_sweep";
        case FullGuidedRfStep::Complete: return "complete";
        case FullGuidedRfStep::Failed: return "failed";
        case FullGuidedRfStep::Cancelled: return "cancelled";
    }
    return "unknown";
}
struct FullGuidedRfState final {
    FullGuidedRfStep step = FullGuidedRfStep::Idle;
    bool resourceAcquired = false;
    bool resourceReleased = true;
    bool cleanupComplete = true;
    bool nrf24Complete = false;
    bool nrf24Passed = false;
    bool cc1101Complete = false;
    bool cc1101Passed = false;
    std::uint8_t cc1101Bins = 0;
};
FullGuidedRfState fullGuidedRfState;
Nrf24PassiveSpectrumReport fullGuidedNrf24Report;
Cc1101PassiveSpectrumReport fullGuidedCc1101Report;
std::uint64_t fullGuidedRfStartAfterUs = 0;
enum class FullGuidedArtifactStep : std::uint8_t {
    Idle,
    Recover,
    LibraryJson,
    LibraryCsv,
    CapturePcap,
    DisposableCommit,
    DisposableRemountExport,
    DisposableCleanup,
    ProductVerify,
    Complete,
    Failed,
    Cancelled,
};
const char* fullGuidedArtifactStepName(FullGuidedArtifactStep step) {
    switch (step) {
        case FullGuidedArtifactStep::Idle: return "idle";
        case FullGuidedArtifactStep::Recover: return "recover";
        case FullGuidedArtifactStep::LibraryJson: return "library_json";
        case FullGuidedArtifactStep::LibraryCsv: return "library_csv";
        case FullGuidedArtifactStep::CapturePcap: return "capture_pcap";
        case FullGuidedArtifactStep::DisposableCommit:
            return "disposable_commit";
        case FullGuidedArtifactStep::DisposableRemountExport:
            return "disposable_remount_export";
        case FullGuidedArtifactStep::DisposableCleanup:
            return "disposable_cleanup";
        case FullGuidedArtifactStep::ProductVerify: return "product_verify";
        case FullGuidedArtifactStep::Complete: return "complete";
        case FullGuidedArtifactStep::Failed: return "failed";
        case FullGuidedArtifactStep::Cancelled: return "cancelled";
    }
    return "unknown";
}
struct FullGuidedArtifactState final {
    FullGuidedArtifactStep step = FullGuidedArtifactStep::Idle;
    char expectedFingerprint[33] = {};
    bool recoveryComplete = false;
    bool recoveryPassed = false;
    bool libraryComplete = false;
    bool libraryPassed = false;
    bool captureComplete = false;
    bool captureApplicable = false;
    bool capturePassed = false;
    bool cleanupComplete = true;
    std::uint32_t generationBefore = 0;
    std::uint32_t generationAfter = 0;
    std::size_t observationsBefore = 0;
    std::size_t observationsAfter = 0;
    std::size_t jsonBytes = 0;
    std::size_t metadataBytes = 0;
    std::size_t csvBytes = 0;
    std::size_t csvRecords = 0;
    std::size_t csvIndex = 0;
    std::size_t pcapBytes = 0;
    std::size_t pcapFrames = 0;
    std::uint32_t pcapFnv1a = 2166136261U;
    std::uint32_t blockedWriteAttempts = 0;
    bool disposableCommitComplete = false;
    bool disposableCommitPassed = false;
    bool disposableRemountComplete = false;
    bool disposableRemountPassed = false;
    bool disposableExportComplete = false;
    bool disposableExportPassed = false;
    bool disposableCleanupComplete = false;
    bool disposableCleanupPassed = false;
    bool productVerifyComplete = false;
    bool productVerifyPassed = false;
    bool disposableResourceAcquired = false;
    bool disposableResourceReleased = true;
    bool disposableIdentityPassed = false;
    bool scratchPreexisting = false;
    bool scratchCreated = false;
    bool scratchRemoved = false;
    bool workflowPassed = true;
    char disposableObservedFingerprint[33] = {};
    char disposableScratchPath[leshy1::storage::kScratchPathMax] = {};
    std::uint32_t disposableGeneration = 0;
    std::size_t disposableObservations = 0;
    std::size_t disposableJsonBytes = 0;
    std::size_t disposableMetadataBytes = 0;
    std::size_t disposableCsvBytes = 0;
    std::size_t disposableCsvRecords = 0;
    std::uint64_t disposableStorageWriteBytes = 0;
    std::uint32_t disposableStorageWriteCalls = 0;
    std::uint32_t disposableFileSyncs = 0;
    std::uint32_t disposableDirectorySyncs = 0;
    std::uint16_t disposableFilesRemoved = 0;
    std::uint32_t productGenerationFinal = 0;
    std::size_t productObservationsFinal = 0;
};
struct FullGuidedPcapSink final {
    std::size_t bytes = 0;
    std::uint32_t fnv1a = 2166136261U;
};
bool writeFullGuidedPcapBytes(const std::uint8_t* data, std::size_t size,
                              void* context) {
    if ((data == nullptr && size != 0) || context == nullptr) return false;
    auto* sink = static_cast<FullGuidedPcapSink*>(context);
    for (std::size_t index = 0; index < size; ++index) {
        sink->fnv1a ^= data[index];
        sink->fnv1a *= 16777619U;
    }
    sink->bytes += size;
    return true;
}
FullGuidedArtifactState fullGuidedArtifactState;
std::uint64_t fullGuidedArtifactStartAfterUs = 0;
enum class RfSpectrumKind : std::uint8_t {
    Nrf24,
    Cc1101,
};
enum class RfSpectrumView : std::uint8_t {
    None,
    SourceMenu,
    Nrf24Menu,
    Nrf24Finder,
    SubGhzMenu,
    CcFinder,
    CcBandMenu,
    SubGhzCaptureBandMenu,
    SubGhzCaptureLive,
    Live,
};
const char* rfSpectrumViewName(RfSpectrumView view) {
    switch (view) {
        case RfSpectrumView::None: return "none";
        case RfSpectrumView::SourceMenu: return "source_menu";
        case RfSpectrumView::Nrf24Menu: return "nrf24_menu";
        case RfSpectrumView::Nrf24Finder: return "nrf24_finder";
        case RfSpectrumView::SubGhzMenu: return "subghz_menu";
        case RfSpectrumView::CcFinder: return "cc1101_finder";
        case RfSpectrumView::CcBandMenu: return "cc_band_menu";
        case RfSpectrumView::SubGhzCaptureBandMenu:
            return "subghz_capture_band_menu";
        case RfSpectrumView::SubGhzCaptureLive:
            return "subghz_capture_live";
        case RfSpectrumView::Live: return "live";
    }
    return "unknown";
}
RfSpectrumView rfSpectrumView = RfSpectrumView::None;
RfSpectrumKind rfSpectrumKind = RfSpectrumKind::Nrf24;
std::uint8_t rfSpectrumSelection = 0;
std::uint8_t nrf24ModeSelection = 0;
std::uint8_t subGhzModeSelection = 0;
enum class WifiProductView : std::uint8_t {
    None,
    Menu,
    Networks,
    NetworkDetail,
    Devices,
    DeviceDetail,
    Channels,
    Capture,
};

const char* wifiProductViewName(WifiProductView view) {
    switch (view) {
        case WifiProductView::Menu: return "menu";
        case WifiProductView::Networks: return "networks";
        case WifiProductView::NetworkDetail: return "network_detail";
        case WifiProductView::Devices: return "devices";
        case WifiProductView::DeviceDetail: return "device_detail";
        case WifiProductView::Channels: return "channels";
        case WifiProductView::Capture: return "capture";
        case WifiProductView::None:
        default: return "none";
    }
}
WifiProductView wifiProductView = WifiProductView::None;
std::uint8_t wifiProductSelection = 0;
WifiNetworkCatalog wifiNetworkCatalog;
WifiNetworkNavigationOrder wifiNetworkNavigationOrder;
std::size_t wifiNetworkSelection = 0;
Observation wifiNetworkDetail;
Observation wifiNetworkRenderedDetail;
WifiNetworkSignalStats wifiNetworkDetailSignal;

std::size_t wifiNetworkVisibleSize() {
    return wifiNetworkNavigationOrder.size(wifiNetworkCatalog);
}

