anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
const Observation* wifiNetworkAt(std::size_t index) {
    return wifiNetworkNavigationOrder.at(wifiNetworkCatalog, index);
}

const Observation* liveWifiNetworkDetail() {
    const std::size_t index =
        wifiNetworkCatalog.indexOfIdentity(wifiNetworkDetail);
    const Observation* live = wifiNetworkCatalog.at(index);
    return live == nullptr ? &wifiNetworkDetail : live;
}

const WifiNetworkSignalStats* liveWifiNetworkSignal() {
    const std::size_t index =
        wifiNetworkCatalog.indexOfIdentity(wifiNetworkDetail);
    const WifiNetworkSignalStats* live = wifiNetworkCatalog.signalAt(index);
    return live == nullptr ? &wifiNetworkDetailSignal : live;
}
WifiDeviceCatalog wifiDeviceCatalog;
WifiDeviceNavigationOrder wifiDeviceNavigationOrder;
WifiOuiDatabase wifiOuiDatabase(
    wifiOuiAssetStart,
    static_cast<std::size_t>(wifiOuiAssetEnd - wifiOuiAssetStart));
std::size_t wifiDeviceSelection = 0;
WifiDeviceRecord wifiDeviceDetail;
std::uint64_t nextWifiDeviceUiRefreshUs = 0;

std::size_t wifiDeviceVisibleSize() {
    return wifiDeviceNavigationOrder.size(wifiDeviceCatalog);
}

const WifiDeviceRecord* wifiDeviceAt(std::size_t index) {
    return wifiDeviceNavigationOrder.at(wifiDeviceCatalog, index);
}
enum class BleProductView : std::uint8_t {
    None,
    Devices,
    DeviceDetail,
};
const char* bleProductViewName(BleProductView view) {
    switch (view) {
        case BleProductView::Devices: return "devices";
        case BleProductView::DeviceDetail: return "device_detail";
        case BleProductView::None:
        default: return "none";
    }
}
BleProductView bleProductView = BleProductView::None;
BleDeviceCatalog bleDeviceCatalog;
BleDeviceNavigationOrder bleDeviceNavigationOrder;
BleCompanyDatabase bleCompanyDatabase(
    bleCompanyAssetStart,
    static_cast<std::size_t>(bleCompanyAssetEnd - bleCompanyAssetStart));
std::size_t bleDeviceSelection = 0;
Observation bleDeviceDetail;
Observation bleDeviceRenderedDetail;
BleDeviceSignalStats bleDeviceDetailSignal;

std::size_t bleDeviceVisibleSize() {
    return bleDeviceNavigationOrder.size(bleDeviceCatalog);
}

const Observation* bleDeviceAt(std::size_t index) {
    return bleDeviceNavigationOrder.at(bleDeviceCatalog, index);
}

const Observation* liveBleDeviceDetail() {
    const std::size_t index =
        bleDeviceCatalog.indexOfIdentity(bleDeviceDetail);
    const Observation* live = bleDeviceCatalog.at(index);
    return live == nullptr ? &bleDeviceDetail : live;
}

const BleDeviceSignalStats* liveBleDeviceSignal() {
    const std::size_t index =
        bleDeviceCatalog.indexOfIdentity(bleDeviceDetail);
    const BleDeviceSignalStats* live = bleDeviceCatalog.signalAt(index);
    return live == nullptr ? &bleDeviceDetailSignal : live;
}
std::array<std::uint16_t, 13> wifiChannelRenderedLoads{};
std::array<std::uint16_t, 13> wifiChannelRenderedAverages{};
std::uint8_t wifiChannelRenderedBest = 0xffU;
std::uint32_t wifiCaptureRenderedFrames = UINT32_MAX;
std::uint32_t wifiCaptureRenderedDrops = UINT32_MAX;
std::uint8_t wifiCaptureRenderedChannel = 0xffU;
leshy1::drivers::radio::Cc1101SpectrumBand rfCcBandSelection =
    leshy1::drivers::radio::Cc1101SpectrumBand::Band433;
std::uint64_t nextSpectrumUiRefreshUs = 0;
std::array<std::int16_t, Layout::ScreenWidth> nrf24FinderRenderedHeights{};
std::uint32_t nrf24FinderRenderedRevision = UINT32_MAX;
Nrf24SignalFinderState nrf24FinderRenderedState =
    Nrf24SignalFinderState::Idle;
std::uint8_t nrf24FinderRenderedChannel = 0xffU;
bool nrf24FinderRenderedFound = false;
std::array<std::int16_t, Layout::ScreenWidth> ccFinderRenderedHeights{};
std::uint32_t ccFinderRenderedRevision = UINT32_MAX;
Cc1101SignalFinderState ccFinderRenderedState =
    Cc1101SignalFinderState::Idle;
std::uint32_t ccFinderRenderedFrequencyKHz = UINT32_MAX;
bool ccFinderRenderedFound = false;
SubGhzRawCapture subGhzRawCapture;
std::uint64_t nextSubGhzCaptureUiRefreshUs = 0;
std::uint64_t spectrumWaterfallStartedUs = 0;
std::uint64_t spectrumWaterfallCompletedUs = 0;
std::uint32_t spectrumWaterfallRowsEmitted = 0;
std::uint64_t spectrumWaterfallPreviousRowUs = 0;
std::uint64_t spectrumWaterfallRowIntervalTotalUs = 0;
std::uint64_t spectrumWaterfallRowIntervalMaxUs = 0;
std::uint64_t spectrumWaterfallPushTotalUs = 0;
std::uint64_t spectrumWaterfallPushMaxUs = 0;
std::uint64_t spectrumWaterfallRenderTotalUs = 0;
std::uint64_t spectrumWaterfallRenderMaxUs = 0;
std::uint64_t spectrumWaterfallServiceMaxUs = 0;
std::uint64_t nrf24SpectrumChunkMaxUs = 0;
std::uint64_t spectrumLoopPreviousUs = 0;
std::uint64_t spectrumLoopIntervalTotalUs = 0;
std::uint64_t spectrumLoopIntervalMaxUs = 0;
std::uint64_t spectrumLoopCount = 0;
std::uint64_t spectrumTouchPollTotalUs = 0;
std::uint64_t spectrumTouchPollMaxUs = 0;
std::uint64_t spectrumTouchPollCount = 0;
std::uint32_t spectrumWaterfallSourceSweepBaseline = 0;
std::uint32_t spectrumWaterfallLastSourceSweep = 0;
std::uint32_t spectrumWaterfallMeasurementsConsumed = 0;
std::uint32_t spectrumWaterfallMeasurementsSkipped = 0;
std::uint64_t spectrumWaterfallFillElapsedUs() {
    return spectrumWaterfallCompletedUs >= spectrumWaterfallStartedUs
        ? spectrumWaterfallCompletedUs - spectrumWaterfallStartedUs : 0;
}

void resetSpectrumWaterfallTiming() {
    spectrumWaterfallStartedUs = 0;
    spectrumWaterfallCompletedUs = 0;
    spectrumWaterfallRowsEmitted = 0;
    spectrumWaterfallPreviousRowUs = 0;
    spectrumWaterfallRowIntervalTotalUs = 0;
    spectrumWaterfallRowIntervalMaxUs = 0;
    spectrumWaterfallPushTotalUs = 0;
    spectrumWaterfallPushMaxUs = 0;
    spectrumWaterfallRenderTotalUs = 0;
    spectrumWaterfallRenderMaxUs = 0;
    spectrumWaterfallServiceMaxUs = 0;
    spectrumLoopPreviousUs = 0;
    spectrumLoopIntervalTotalUs = 0;
    spectrumLoopIntervalMaxUs = 0;
    spectrumLoopCount = 0;
    spectrumTouchPollTotalUs = 0;
    spectrumTouchPollMaxUs = 0;
    spectrumTouchPollCount = 0;
    spectrumWaterfallSourceSweepBaseline = 0;
    spectrumWaterfallLastSourceSweep = 0;
    spectrumWaterfallMeasurementsConsumed = 0;
    spectrumWaterfallMeasurementsSkipped = 0;
}

