anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
// ESP-IDF normally disables the bootloader RTC WDT at secondary-init priority
// 999. Re-arm it immediately afterwards so a lockup between ROM entry and the
// Arduino loop task cannot escape the application-owned safety envelope.
ESP_SYSTEM_INIT_FN(leshy_early_boot_guard, SECONDARY, BIT(0), 1000) {
    const bool previousGuardArmed =
        earlyBootGuardRtcState == kEarlyBootGuardRtcMagic &&
        earlyBootGuardRtcStateInverse == ~kEarlyBootGuardRtcMagic;
    if (previousGuardArmed && earlyBootGuardWatchdogReset(esp_reset_reason())) {
        earlyBootGuardTripRtcState = 0;
        earlyBootGuardTripRtcStateInverse = ~kEarlyBootGuardTripRtcMagic;
        __atomic_thread_fence(__ATOMIC_RELEASE);
        earlyBootGuardTripRtcState = kEarlyBootGuardTripRtcMagic;
    } else {
        earlyBootGuardTripRtcState = 0;
        earlyBootGuardTripRtcStateInverse = 0;
    }

    // These active-high TX/buzzer paths must remain low even if startup stops
    // before the Arduino GPIO API is available.
    GPIO.out_w1tc = (1U << 2U) | (1U << 14U) | (1U << 15U);
    GPIO.out1_w1tc.val = (1U << (47U - 32U));

    wdt_hal_context_t guard = RWDT_HAL_CONTEXT_DEFAULT();
    wdt_hal_init(&guard, WDT_RWDT, 0, false);
    const std::uint32_t slowFrequency = rtc_clk_slow_freq_get_hz();
    const std::uint32_t timeoutTicks = static_cast<std::uint32_t>(
        static_cast<std::uint64_t>(kEarlyBootGuardTimeoutMs) *
        slowFrequency / 1000ULL);
    wdt_hal_write_protect_disable(&guard);
    wdt_hal_config_stage(
        &guard, WDT_STAGE0, timeoutTicks, WDT_STAGE_ACTION_RESET_SYSTEM);
    wdt_hal_config_stage(
        &guard, WDT_STAGE1, timeoutTicks, WDT_STAGE_ACTION_RESET_RTC);
    wdt_hal_set_flashboot_en(&guard, true);
    earlyBootGuardRtcState = 0;
    earlyBootGuardRtcStateInverse = ~kEarlyBootGuardRtcMagic;
    __atomic_thread_fence(__ATOMIC_RELEASE);
    earlyBootGuardRtcState = kEarlyBootGuardRtcMagic;
    wdt_hal_enable(&guard);
    wdt_hal_write_protect_enable(&guard);
    earlyBootGuardActive = true;

    if (earlyBootWatchdogTestRtcState == kEarlyBootWatchdogTestRtcMagic) {
        earlyBootWatchdogTestRtcState = 0;
        while (true) esp_rom_delay_us(100000);
    }
    return ESP_OK;
}

constexpr std::uint32_t kLittleFsResetRtcMagic = 0x4C465231U;
struct LittleFsResetRtcState final {
    std::uint32_t magic;
    std::uint32_t boundary;
    std::uint8_t token[32];
};
RTC_NOINIT_ATTR LittleFsResetRtcState littleFsResetRtcState;
TaskHandle_t productBootRecoveryWatchdogTask = nullptr;
bool productBootRecoveryTaskWatchdogAdded = false;
volatile std::uint32_t productBootRecoveryWatchdogArmed = 0;

static_assert(CONFIG_ESP_TASK_WDT_EN && CONFIG_ESP_TASK_WDT_INIT &&
                  CONFIG_ESP_TASK_WDT_PANIC,
              "boot recovery requires the panic-enabled Task WDT");
static_assert(
    leshy1::storage::kProductBootRecoveryHardwareWatchdogMs ==
        CONFIG_ESP_TASK_WDT_TIMEOUT_S * 1000U,
    "boot recovery hardware watchdog policy must match the SDK configuration");

struct ProductSurveyRuntimeState final {
    const char* status = "idle";
    bool selected = false;
    bool backendOpen = false;
    bool identityCleanupComplete = true;
    bool filesystemAttempted = false;
    bool scannerCleanupComplete = true;
    bool cleanupComplete = true;
    std::uint8_t identityAttempts = 0;
    std::uint8_t identityTransientRetries = 0;
    leshy1::storage::SdTransportRunStatus identityStatus =
        leshy1::storage::SdTransportRunStatus::InvalidPlan;
    char expectedFingerprint[33] = {};
    char observedFingerprint[33] = {};
    std::uint64_t cardCapacityBytes = 0;
    std::uint64_t cachedFreeBytes = 0;
    leshy1::storage::ProductStoreAccessStatus storeStatus =
        leshy1::storage::ProductStoreAccessStatus::MissingMedia;
    leshy1::apps::survey::ProductSurveyAdmissionStatus admissionStatus =
        leshy1::apps::survey::ProductSurveyAdmissionStatus::ExplicitStartRequired;
    BoardWifiPassiveScanResult scan{};
    BoardBlePassiveScanResult bleScan{};
    bool workerReady = false;
    bool sourceActive = false;
    bool sourceStartAttempted = false;
    bool sourceFailureInjected = false;
    bool runtimeSourceFailureInjected = false;
    std::uint8_t runtimeSourceFailureInjectedMask = 0;
    bool storeOpenAttempted = false;
    std::uint64_t storeBytesWritten = 0;
    bool cancelRequestedDuringScan = false;
    std::uint32_t scanCycles = 0;
    std::uint32_t wifiScanCycles = 0;
    std::uint32_t bleScanCycles = 0;
    std::uint64_t startActionUs = 0;
    std::uint64_t stopActionUs = 0;
    std::uint8_t selectedSourceMask = 0;
    std::uint8_t activeSourceMask = 0;
    std::uint8_t unavailableSourceMask = 0;
    const char* timelineStatus = "idle";
    const char* timelineArchiveStatus = "idle";
    const char* timelineFailureStatus = "none";
    const char* timelineFailureStage = "none";
    std::uint64_t timelineFailureEventUs = 0;
    std::uint64_t timelineFailureLatestUs = 0;
    bool timelineHealthy = true;
    std::uint32_t timelineArchivedWindows = 0;
};

ProductSurveyRuntimeState productSurveyRuntime;

enum class ProductSurveyWorkerControl : std::uint8_t {
    Idle,
    Starting,
    Running,
    Paused,
    PauseRequested,
    StopRequested,
    CancelRequested,
};

enum class ProductSurveyWorkerEventKind : std::uint8_t {
    Prepared,
    ScanStarted,
    Scan,
    SourceUnavailable,
    Paused,
    Stopped,
    Cancelled,
    Failed,
};

struct ProductSurveyWorkerReport final {
    const char* status = "idle";
    bool backendOpen = false;
    bool identityCleanupComplete = true;
    bool filesystemAttempted = false;
    bool scannerCleanupComplete = true;
    bool cleanupComplete = true;
    bool sourceActive = false;
    bool sourceStartAttempted = false;
    bool sourceFailureInjected = false;
    bool runtimeSourceFailureInjected = false;
    std::uint8_t runtimeSourceFailureInjectedMask = 0;
    bool storeOpenAttempted = false;
    std::uint64_t storeBytesWritten = 0;
    std::uint8_t identityAttempts = 0;
    std::uint8_t identityTransientRetries = 0;
    leshy1::storage::SdTransportRunStatus identityStatus =
        leshy1::storage::SdTransportRunStatus::InvalidPlan;
    char expectedFingerprint[33] = {};
    char observedFingerprint[33] = {};
    std::uint64_t cardCapacityBytes = 0;
    std::uint64_t cachedFreeBytes = 0;
    leshy1::storage::ProductStoreAccessStatus storeStatus =
        leshy1::storage::ProductStoreAccessStatus::MissingMedia;
    leshy1::apps::survey::ProductSurveyAdmissionStatus admissionStatus =
        leshy1::apps::survey::ProductSurveyAdmissionStatus::ExplicitStartRequired;
    std::uint8_t selectedSourceMask = 0;
    std::uint8_t activeSourceMask = 0;
    std::uint8_t unavailableSourceMask = 0;
};

struct ProductSurveyWorkerEvent final {
    ProductSurveyWorkerEventKind kind = ProductSurveyWorkerEventKind::Failed;
    ProductSurveyWorkerReport report{};
    RadioKind source = RadioKind::Wifi;
    BoardWifiPassiveScanResult scan{};
    BoardBlePassiveScanResult bleScan{};
    std::uint32_t scanCycles = 0;
    std::uint32_t sourceScanCycles = 0;
    std::uint64_t eventUs = 0;
    std::uint64_t scanStartedUs = 0;
    std::uint64_t scanEndedUs = 0;
    std::uint16_t scanDropped = 0;
    SourceWindowState failureState = SourceWindowState::Fault;
    SourceWindowReason failureReason = SourceWindowReason::DriverFault;
};

constexpr UBaseType_t kProductSurveyWorkerEventCapacity = 8;
constexpr UBaseType_t kProductSurveyObservationCapacity =
    leshy1::services::survey::SurveySession::kObservationCapacity;
constexpr std::uint32_t kProductSurveyScanIntervalMs = 1000;
constexpr std::uint64_t kProductSurveyPreparationDeadlineUs = 8000000ULL;
constexpr std::uint64_t kProductSurveyWorkerDeadlineUs = 8000000ULL;
constexpr std::uint64_t kWifiCaptureStoreDeadlineUs = 8000000ULL;
constexpr std::uint64_t kPulseCaptureStoreDeadlineUs = 8000000ULL;
constexpr std::uint32_t kProductSurveyPreparationDeadlineInjectionMs = 10000;
constexpr std::uint32_t kProductSurveyWorkerDeadlineInjectionMs = 10000;
constexpr std::uint32_t kWifiCaptureStoreDeadlineInjectionMs = 10000;
constexpr std::uint32_t kPulseCaptureStoreDeadlineInjectionMs = 10000;
static_assert(
    kProductSurveyWorkerDeadlineUs >
        BoardBlePassiveScanner::worstCaseScanDurationUs(
            leshy1::drivers::ble::defaultPassivePlan()),
    "worker deadline must exceed the bounded BLE retry path");
QueueHandle_t productSurveyWorkerEvents = nullptr;
QueueHandle_t productSurveyObservations = nullptr;
StaticSemaphore_t productSurveyScanStartGateStorage{};
SemaphoreHandle_t productSurveyScanStartGate = nullptr;
TaskHandle_t productSurveyWorkerTaskHandle = nullptr;
portMUX_TYPE productSurveyWorkerMux = portMUX_INITIALIZER_UNLOCKED;
ProductSurveyWorkerControl productSurveyWorkerControl =
    ProductSurveyWorkerControl::Idle;
std::uint32_t productSurveyWorkerOwnedResources = 0;
bool productSurveyWorkerReady = false;
bool productSurveyWorkerScanActive = false;
bool productSurveySourceUnavailableOnce = false;
std::uint8_t productSurveyRuntimeUnavailableOnceMask = 0;
bool productSurveyIncrementalRefreshPending = false;
WorkerDeadlineSupervisor workerDeadlineSupervisor;
bool productSurveyPreparationDeadlineInjectionOnce = false;
bool productSurveyWorkerDeadlineInjectionOnce = false;
bool wifiCaptureStoreDeadlineInjectionOnce = false;
bool wifiCaptureStoreDeadlineCancelRequested = false;
bool subGhzCaptureStoreDeadlineInjectionOnce = false;
bool subGhzCaptureStoreDeadlineCancelRequested = false;
bool infraredCaptureStoreDeadlineInjectionOnce = false;
bool infraredCaptureStoreDeadlineCancelRequested = false;

void renderInteractiveScreen(bool clearContent = true);
void broadcast(const char* line);
bool boundedSleepReady();
bool performBoundedLightSleep(std::uint64_t requestedUs);

