anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool clearProductFingerprint() {
    char existing[33] = {};
    if (!loadProductFingerprint(existing, sizeof(existing))) return true;
    Preferences preferences;
    if (!preferences.begin(kProductEnrollmentNamespace, false)) return false;
    const bool removed = preferences.remove(kProductEnrollmentKey);
    preferences.end();
    char verified[33] = {};
    return removed && !loadProductFingerprint(verified, sizeof(verified));
}

UiLanguage loadUiLanguage() {
    Preferences preferences;
    if (!preferences.begin(kUiPreferencesNamespace, true)) {
        return UiLanguage::English;
    }
    const std::uint8_t stored = preferences.getUChar(kUiLanguageKey, 0);
    preferences.end();
    return stored == static_cast<std::uint8_t>(UiLanguage::Russian)
               ? UiLanguage::Russian
               : UiLanguage::English;
}

bool saveUiLanguage(UiLanguage language) {
    Preferences preferences;
    if (!preferences.begin(kUiPreferencesNamespace, false)) return false;
    const std::size_t written = preferences.putUChar(
        kUiLanguageKey, static_cast<std::uint8_t>(language));
    preferences.end();
    return written == sizeof(std::uint8_t);
}

bool closeProductSurveyBackend() {
    productSurveyRuntime.storeBytesWritten = productSurveyStore.bytesWritten();
    productSurveyStore.end();
    const bool filesystemWasMounted = productSurveyFilesystem.mounted();
    if (filesystemWasMounted) productSurveyFilesystem.end();
    surveyStoreRouter.bind(ramSessionStore);
    productSurveyRuntime.backendOpen = false;
    const bool filesystemCleanup =
        !productSurveyRuntime.filesystemAttempted ||
        productSurveyFilesystem.cleanupComplete();
    productSurveyRuntime.cleanupComplete =
        productSurveyRuntime.identityCleanupComplete &&
        productSurveyRuntime.scannerCleanupComplete && filesystemCleanup &&
        !productSurveyFilesystem.mounted() &&
        surveyStoreRouter.boundTo(ramSessionStore);
    return productSurveyRuntime.cleanupComplete;
}

ProductSurveyWorkerControl productSurveyControl() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const ProductSurveyWorkerControl control = productSurveyWorkerControl;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return control;
}

void setProductSurveyControl(ProductSurveyWorkerControl control) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveyWorkerControl = control;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool transitionProductSurveyControl(ProductSurveyWorkerControl expected,
                                    ProductSurveyWorkerControl next) {
    bool changed = false;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    if (productSurveyWorkerControl == expected) {
        productSurveyWorkerControl = next;
        changed = true;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return changed;
}

bool productSurveyStopRequested() {
    const ProductSurveyWorkerControl control = productSurveyControl();
    return control == ProductSurveyWorkerControl::PauseRequested ||
           control == ProductSurveyWorkerControl::StopRequested ||
           control == ProductSurveyWorkerControl::CancelRequested;
}

bool productSurveyCancelRequested() {
    return productSurveyControl() ==
           ProductSurveyWorkerControl::CancelRequested;
}

bool productSurveyScanActive() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool active = productSurveyWorkerScanActive;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return active;
}

bool productSurveySourceUnavailableInjectionArmed() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = productSurveySourceUnavailableOnce;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

void setProductSurveySourceUnavailableInjection(bool armed) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveySourceUnavailableOnce = armed;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool consumeProductSurveySourceUnavailableInjection() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool injected = productSurveySourceUnavailableOnce;
    productSurveySourceUnavailableOnce = false;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return injected;
}

void setProductSurveyWorkerDeadlineInjection(bool armed) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveyWorkerDeadlineInjectionOnce = armed;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool productSurveyWorkerDeadlineInjectionArmed() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = productSurveyWorkerDeadlineInjectionOnce;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool consumeProductSurveyWorkerDeadlineInjection() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool injected = productSurveyWorkerDeadlineInjectionOnce;
    productSurveyWorkerDeadlineInjectionOnce = false;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return injected;
}

void setProductSurveyPreparationDeadlineInjection(bool armed) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveyPreparationDeadlineInjectionOnce = armed;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool productSurveyPreparationDeadlineInjectionArmed() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = productSurveyPreparationDeadlineInjectionOnce;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool consumeProductSurveyPreparationDeadlineInjection() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool injected = productSurveyPreparationDeadlineInjectionOnce;
    productSurveyPreparationDeadlineInjectionOnce = false;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return injected;
}

bool armProductSurveyPreparationDeadline(std::uint64_t nowUs) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = workerDeadlineSupervisor.arm(
        SupervisedWorker::ProductSurveyPreparation, nowUs,
        kProductSurveyPreparationDeadlineUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

