anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool heartbeatProductSurveyPreparation(std::uint64_t nowUs = 0) {
    if (nowUs == 0) {
        nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
        if (nowUs == 0) nowUs = 1;
    }
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool accepted = workerDeadlineSupervisor.heartbeat(
        SupervisedWorker::ProductSurveyPreparation, nowUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return accepted;
}

bool disarmProductSurveyPreparationDeadline() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool disarmed = workerDeadlineSupervisor.disarm(
        SupervisedWorker::ProductSurveyPreparation);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return disarmed;
}

bool armProductSurveyWorkerDeadline(std::uint64_t nowUs) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = workerDeadlineSupervisor.arm(
        SupervisedWorker::ProductSurvey, nowUs,
        kProductSurveyWorkerDeadlineUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool heartbeatProductSurveyWorker(std::uint64_t nowUs = 0) {
    if (nowUs == 0) {
        nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
        if (nowUs == 0) nowUs = 1;
    }
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool accepted = workerDeadlineSupervisor.heartbeat(
        SupervisedWorker::ProductSurvey, nowUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return accepted;
}

bool disarmProductSurveyWorkerDeadline() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool disarmed = workerDeadlineSupervisor.disarm(
        SupervisedWorker::ProductSurvey);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return disarmed;
}

void setWifiCaptureStoreDeadlineInjection(bool armed) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    wifiCaptureStoreDeadlineInjectionOnce = armed;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool wifiCaptureStoreDeadlineInjectionArmed() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = wifiCaptureStoreDeadlineInjectionOnce;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool consumeWifiCaptureStoreDeadlineInjection() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool injected = wifiCaptureStoreDeadlineInjectionOnce;
    wifiCaptureStoreDeadlineInjectionOnce = false;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return injected;
}

void resetWifiCaptureStoreDeadlineCancel() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    wifiCaptureStoreDeadlineCancelRequested = false;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

void requestWifiCaptureStoreDeadlineCancel() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    wifiCaptureStoreDeadlineCancelRequested = true;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool wifiCaptureStoreDeadlineCancelled() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool cancelled = wifiCaptureStoreDeadlineCancelRequested;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return cancelled;
}

bool armWifiCaptureStoreDeadline(std::uint64_t nowUs) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = workerDeadlineSupervisor.arm(
        SupervisedWorker::WifiCaptureStore, nowUs,
        kWifiCaptureStoreDeadlineUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool heartbeatWifiCaptureStore(std::uint64_t nowUs = 0) {
    if (nowUs == 0) {
        nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
        if (nowUs == 0) nowUs = 1;
    }
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool accepted = workerDeadlineSupervisor.heartbeat(
        SupervisedWorker::WifiCaptureStore, nowUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return accepted;
}

bool disarmWifiCaptureStoreDeadline() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool disarmed = workerDeadlineSupervisor.disarm(
        SupervisedWorker::WifiCaptureStore);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return disarmed;
}

bool pulseCaptureStoreWorker(SupervisedWorker worker) {
    return worker == SupervisedWorker::SubGhzCaptureStore ||
           worker == SupervisedWorker::InfraredCaptureStore;
}

void setPulseCaptureStoreDeadlineInjection(SupervisedWorker worker,
                                           bool armed) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    if (worker == SupervisedWorker::SubGhzCaptureStore) {
        subGhzCaptureStoreDeadlineInjectionOnce = armed;
    } else if (worker == SupervisedWorker::InfraredCaptureStore) {
        infraredCaptureStoreDeadlineInjectionOnce = armed;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool pulseCaptureStoreDeadlineInjectionArmed(SupervisedWorker worker) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed =
        worker == SupervisedWorker::SubGhzCaptureStore
            ? subGhzCaptureStoreDeadlineInjectionOnce
            : worker == SupervisedWorker::InfraredCaptureStore
                  ? infraredCaptureStoreDeadlineInjectionOnce
                  : false;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool consumePulseCaptureStoreDeadlineInjection(SupervisedWorker worker) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    bool injected = false;
    if (worker == SupervisedWorker::SubGhzCaptureStore) {
        injected = subGhzCaptureStoreDeadlineInjectionOnce;
        subGhzCaptureStoreDeadlineInjectionOnce = false;
    } else if (worker == SupervisedWorker::InfraredCaptureStore) {
        injected = infraredCaptureStoreDeadlineInjectionOnce;
        infraredCaptureStoreDeadlineInjectionOnce = false;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return injected;
}

void resetPulseCaptureStoreDeadlineCancel(SupervisedWorker worker) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    if (worker == SupervisedWorker::SubGhzCaptureStore) {
        subGhzCaptureStoreDeadlineCancelRequested = false;
    } else if (worker == SupervisedWorker::InfraredCaptureStore) {
        infraredCaptureStoreDeadlineCancelRequested = false;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

void requestPulseCaptureStoreDeadlineCancel(SupervisedWorker worker) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    if (worker == SupervisedWorker::SubGhzCaptureStore) {
        subGhzCaptureStoreDeadlineCancelRequested = true;
    } else if (worker == SupervisedWorker::InfraredCaptureStore) {
        infraredCaptureStoreDeadlineCancelRequested = true;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool pulseCaptureStoreDeadlineCancelled(SupervisedWorker worker) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool cancelled =
        worker == SupervisedWorker::SubGhzCaptureStore
            ? subGhzCaptureStoreDeadlineCancelRequested
            : worker == SupervisedWorker::InfraredCaptureStore
                  ? infraredCaptureStoreDeadlineCancelRequested
                  : false;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return cancelled;
}

bool armPulseCaptureStoreDeadline(SupervisedWorker worker,
                                  std::uint64_t nowUs) {
    if (!pulseCaptureStoreWorker(worker)) return false;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = workerDeadlineSupervisor.arm(
        worker, nowUs, kPulseCaptureStoreDeadlineUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool heartbeatPulseCaptureStore(SupervisedWorker worker,
                                std::uint64_t nowUs = 0) {
    if (!pulseCaptureStoreWorker(worker)) return false;
    if (nowUs == 0) {
        nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
        if (nowUs == 0) nowUs = 1;
    }
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool accepted = workerDeadlineSupervisor.heartbeat(worker, nowUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return accepted;
}

bool disarmPulseCaptureStoreDeadline(SupervisedWorker worker) {
    if (!pulseCaptureStoreWorker(worker)) return false;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool disarmed = workerDeadlineSupervisor.disarm(worker);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return disarmed;
}

