anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
BleRecordDisposition enqueueProductSurveyWorkerBleRecord(
    const BleAdvertisementRecord& record, std::uint64_t monotonicUs, void*) {
    Observation observation;
    if (!leshy1::drivers::ble::normalizePassiveRecord(
            record, monotonicUs, &observation)) {
        return BleRecordDisposition::Rejected;
    }
    if (productSurveyObservations == nullptr ||
        xQueueSend(productSurveyObservations, &observation, 0) != pdTRUE) {
        return BleRecordDisposition::Dropped;
    }
    return BleRecordDisposition::Accepted;
}

void sendProductSurveyWorkerEvent(
    ProductSurveyWorkerEventKind kind,
    const ProductSurveyWorkerReport& report,
    RadioKind source = RadioKind::Wifi,
    const BoardWifiPassiveScanResult& scan = {},
    const BoardBlePassiveScanResult& bleScan = {},
    std::uint32_t scanCycles = 0, std::uint32_t sourceScanCycles = 0,
    std::uint64_t eventUs = 0,
    std::uint64_t scanStartedUs = 0, std::uint64_t scanEndedUs = 0,
    std::uint16_t scanDropped = 0,
    SourceWindowState failureState = SourceWindowState::Fault,
    SourceWindowReason failureReason = SourceWindowReason::DriverFault) {
    if (productSurveyWorkerEvents == nullptr) return;
    if (eventUs == 0) {
        eventUs = static_cast<std::uint64_t>(esp_timer_get_time());
        if (eventUs == 0) eventUs = 1;
    }
    const ProductSurveyWorkerEvent event{
        kind, report, source, scan, bleScan, scanCycles, sourceScanCycles,
        eventUs, scanStartedUs, scanEndedUs, scanDropped,
        failureState, failureReason};
    xQueueSend(productSurveyWorkerEvents, &event, portMAX_DELAY);
}

void cleanupProductSurveyWorkerHardware(
    ProductSurveyWorkerReport* report) {
    if (report == nullptr) return;
    report->storeBytesWritten = productSurveyStore.bytesWritten();
    productSurveyStore.end();
    if (productSurveyFilesystem.mounted()) productSurveyFilesystem.end();
    surveyStoreRouter.bind(ramSessionStore);
    report->backendOpen = false;
    const bool filesystemCleanup =
        !report->filesystemAttempted || productSurveyFilesystem.cleanupComplete();
    report->cleanupComplete = report->identityCleanupComplete &&
        report->scannerCleanupComplete && filesystemCleanup &&
        !productSurveyFilesystem.mounted() &&
        surveyStoreRouter.boundTo(ramSessionStore);
}

ProductSurveyWorkerReport prepareProductSurveyWorker(
    BoardWifiPassiveScanner* wifiScanner,
    BoardBlePassiveScanner* bleScanner) {
    ProductSurveyWorkerReport report;
    report.status = "preparing";
    report.cleanupComplete = false;
    heartbeatProductSurveyPreparation();
    if (wifiScanner == nullptr || bleScanner == nullptr) {
        report.status = "worker_missing";
        return report;
    }

    portENTER_CRITICAL(&productSurveyWorkerMux);
    const std::uint32_t ownedResources = productSurveyWorkerOwnedResources;
    const std::uint8_t selectedSourceMask =
        productSurveyRuntime.selectedSourceMask;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    report.selectedSourceMask = selectedSourceMask;
    const auto required =
        leshy1::kernel::runtime::resourceMask(Resource::UiForeground) |
        leshy1::kernel::runtime::resourceMask(Resource::EspRf) |
        leshy1::kernel::runtime::resourceMask(Resource::Storage) |
        leshy1::kernel::runtime::resourceMask(Resource::RadioSpi);
    if ((ownedResources & required) != required) {
        report.status = "resources_missing";
        return report;
    }
    if (!loadProductFingerprint(report.expectedFingerprint,
                                sizeof(report.expectedFingerprint))) {
        report.status = "enrollment_missing";
        return report;
    }

    leshy1::storage::SdTransportRunResult identity;
    for (std::uint8_t attempt = 1;
         attempt <= leshy1::storage::kProductStartMaximumIdentityAttempts;
         ++attempt) {
        if (productSurveyCancelRequested()) {
            report.status = "cancelled";
            return report;
        }
        heartbeatProductSurveyPreparation();
        BoardSdSpiTransport identityTransport;
        const bool identityBegun = identityTransport.begin();
        identity = {};
        if (identityBegun) {
            leshy1::storage::SdTransportRunPolicy policy;
            policy.allowPhysical = true;
            policy.explicitlySelected = true;
            policy.identificationOnly = true;
            policy.ownedResources = ownedResources;
            identity = leshy1::storage::runSdIdentificationStateMachine(
                leshy1::storage::defaultSdIdentificationPlan(),
                identityTransport, policy);
            identityTransport.end();
        }
        heartbeatProductSurveyPreparation();
        report.identityAttempts = attempt;
        report.identityTransientRetries =
            static_cast<std::uint8_t>(attempt - 1U);
        report.identityStatus = identity.status;
        report.identityCleanupComplete = identityTransport.cleanupComplete();
        formatCidFingerprint(identity.identity,
                             report.observedFingerprint,
                             sizeof(report.observedFingerprint));
        if (report.identityCleanupComplete &&
            identity.status == leshy1::storage::SdTransportRunStatus::Valid) {
            break;
        }
        const leshy1::storage::ProductStartIdentityRetryEvidence retryEvidence{
            true,
            true,
            exactCidFingerprint(report.expectedFingerprint),
            (ownedResources & required) == required,
            identityTransport.physicalSpiStarted(),
            identity.status,
            std::strcmp(report.observedFingerprint,
                        "00000000000000000000000000000000") == 0,
            report.identityCleanupComplete,
            report.filesystemAttempted,
        };
        if (!leshy1::storage::shouldRetryProductStartIdentity(
                retryEvidence, attempt)) {
            break;
        }
        ulTaskNotifyTake(
            pdTRUE,
            pdMS_TO_TICKS(
                leshy1::storage::productStartIdentityRetryDelayMs(attempt)));
        heartbeatProductSurveyPreparation();
    }
    if (productSurveyCancelRequested()) {
        report.status = "cancelled";
        return report;
    }
    if (!report.identityCleanupComplete ||
        identity.status != leshy1::storage::SdTransportRunStatus::Valid) {
        report.status = "identity_failed";
        return report;
    }
    if (std::strcmp(report.expectedFingerprint,
                    report.observedFingerprint) != 0) {
        report.status = "fingerprint_mismatch";
        return report;
    }

