anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
CaptureMetadata productWifiFrameCaptureMetadata() {
    CaptureMetadata metadata = productCaptureMetadata(
        leshy1::services::survey::sourceMask(RadioKind::Wifi));
    const auto& plan = wifiFrameCapture.capture().plan();
    const auto& stats = wifiFrameCapture.stats();
    metadata.wifiShowHidden = false;
    metadata.wifiMaxMsPerChannel = plan.channelDwellMs;
    metadata.wifiChannel = plan.channel;
    metadata.framePayloadCaptured = true;
    metadata.framePayloadBytes = stats.payloadBytes;
    metadata.framePayloadRecords = static_cast<std::uint16_t>(
        wifiFrameCapture.capture().size());
    metadata.framePayloadSnapLength = plan.snapLength;
    metadata.framePayloadFormat = FramePayloadFormat::Ieee80211;
    return metadata;
}

CaptureMetadata productSubGhzRawCaptureMetadata() {
    CaptureMetadata metadata = productCaptureMetadata(0);
    const auto& plan = subGhzRawCapture.plan();
    const auto& stats = subGhzRawCapture.stats();
    metadata.selectedSourceMask = 0;
    metadata.subGhzRawCaptured = true;
    metadata.subGhzFrequencyKHz = plan.frequencyKHz;
    metadata.subGhzThresholdDbm = plan.thresholdDbm;
    metadata.subGhzModulation = plan.modulation;
    metadata.subGhzStartLevel = stats.startLevel;
    metadata.subGhzTruncated = stats.truncated;
    metadata.subGhzPulseRecords = static_cast<std::uint16_t>(
        subGhzRawCapture.pulseCount());
    metadata.subGhzPulseBytes = static_cast<std::uint32_t>(
        subGhzRawCapture.pulseCount() * 2U);
    return metadata;
}

CaptureMetadata productInfraredRawCaptureMetadata() {
    CaptureMetadata metadata = productCaptureMetadata(0);
    const auto& stats = infraredCapture.stats();
    metadata.selectedSourceMask = 0;
    metadata.infraredRawCaptured = true;
    metadata.infraredStartLevel = stats.startLevel;
    metadata.infraredTruncated = stats.truncated;
    metadata.infraredPulseRecords = static_cast<std::uint16_t>(
        infraredCapture.pulseCount());
    metadata.infraredPulseBytes = static_cast<std::uint32_t>(
        infraredCapture.pulseCount() * 2U);
    metadata.infraredDecode = infraredCapture.decode();
    return metadata;
}

void runCaptureStoreWorker(void*) {
    CaptureStoreEvent event;
    event.status = "store_failed";
    bool identityCleanupComplete = true;
    bool filesystemAttempted = false;
    bool deadlineArmed = false;
    bool supervisionHealthy = true;
    leshy1::storage::SdTransportRunResult identity;
    char expectedFingerprint[33] = {};
    char observedFingerprint[33] = {};
    const auto supervisedCheckpoint = [&]() {
        if (wifiCaptureStoreDeadlineCancelled()) {
            event.status = "safety_worker_deadline";
            supervisionHealthy = false;
            return false;
        }
        if (!heartbeatWifiCaptureStore()) {
            event.status = "worker_supervisor_unavailable";
            supervisionHealthy = false;
            return false;
        }
        return true;
    };
    do {
        resetWifiCaptureStoreDeadlineCancel();
        std::uint64_t startedUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        if (startedUs == 0) startedUs = 1;
        deadlineArmed = armWifiCaptureStoreDeadline(startedUs);
        if (!deadlineArmed) {
            event.status = "worker_supervisor_unavailable";
            break;
        }
        if (consumeWifiCaptureStoreDeadlineInjection()) {
            vTaskDelay(pdMS_TO_TICKS(
                kWifiCaptureStoreDeadlineInjectionMs));
        }
        if (!supervisedCheckpoint()) break;
        const auto required =
            leshy1::kernel::runtime::resourceMask(Resource::UiForeground) |
            leshy1::kernel::runtime::resourceMask(Resource::Storage) |
            leshy1::kernel::runtime::resourceMask(Resource::RadioSpi);
        const auto owned = resourceBroker.ownedBy(AppRuntime::kForegroundOwner);
        if ((owned & required) != required) {
            event.status = "resources_missing";
            break;
        }
        if (!loadProductFingerprint(expectedFingerprint,
                                    sizeof(expectedFingerprint))) {
            event.status = "enrollment_missing";
            break;
        }
        if (!supervisedCheckpoint()) break;
        for (std::uint8_t attempt = 1;
             attempt <= leshy1::storage::kProductStartMaximumIdentityAttempts;
             ++attempt) {
            BoardSdSpiTransport transport;
            const bool begun = transport.begin();
            identity = {};
            if (begun) {
                leshy1::storage::SdTransportRunPolicy policy;
                policy.allowPhysical = true;
                policy.explicitlySelected = true;
                policy.identificationOnly = true;
                policy.ownedResources = owned;
                identity = leshy1::storage::runSdIdentificationStateMachine(
                    leshy1::storage::defaultSdIdentificationPlan(), transport,
                    policy);
                transport.end();
            }
            identityCleanupComplete = transport.cleanupComplete();
            formatCidFingerprint(identity.identity, observedFingerprint,
                                 sizeof(observedFingerprint));
            if (!supervisedCheckpoint()) break;
            if (identityCleanupComplete &&
                identity.status ==
                    leshy1::storage::SdTransportRunStatus::Valid) {
                break;
            }
            const leshy1::storage::ProductStartIdentityRetryEvidence evidence{
                true, true, exactCidFingerprint(expectedFingerprint),
                (owned & required) == required,
                transport.physicalSpiStarted(), identity.status,
                std::strcmp(observedFingerprint,
                            "00000000000000000000000000000000") == 0,
                identityCleanupComplete, filesystemAttempted,
            };
            if (!leshy1::storage::shouldRetryProductStartIdentity(
                    evidence, attempt)) {
                break;
            }
            vTaskDelay(pdMS_TO_TICKS(
                leshy1::storage::productStartIdentityRetryDelayMs(attempt)));
            if (!supervisedCheckpoint()) break;
        }
        if (!supervisionHealthy) break;
        if (!identityCleanupComplete ||
            identity.status != leshy1::storage::SdTransportRunStatus::Valid) {
            event.status = "identity_failed";
            break;
        }
        if (std::strcmp(expectedFingerprint, observedFingerprint) != 0) {
            event.status = "fingerprint_mismatch";
            break;
        }
        filesystemAttempted = true;
        event.heapFreeBeforeMount = static_cast<std::uint32_t>(
            heap_caps_get_free_size(MALLOC_CAP_8BIT));
        event.heapLargestBeforeMount = static_cast<std::uint32_t>(
            heap_caps_get_largest_free_block(MALLOC_CAP_8BIT));
        const bool filesystemMounted = productSurveyFilesystem.begin();
        event.filesystemMountError = productSurveyFilesystem.mountError();
        if (!filesystemMounted) {
            event.status = "mount_failed";
            break;
        }
        if (!supervisedCheckpoint()) break;
        const std::uint64_t cardCapacity =
            productSurveyFilesystem.cardCapacityBytes();
        const std::uint64_t cachedFree =
            productSurveyFilesystem.cachedFreeBytes();
        const bool rootExists = productSurveyFilesystem.exists(
            leshy1::storage::kProductSessionStoreRoot);
        leshy1::storage::MediaIdentity media;
        media.present = cardCapacity != 0 &&
            cardCapacity == identity.identity.capacityBytes;
        media.kind = leshy1::storage::MediaKind::Sd;
        media.fingerprint = observedFingerprint;
        media.capacityBytes = cardCapacity;
        media.freeBytes = cachedFree;
        leshy1::storage::ProductStoreRequest request;
        request.operation =
            leshy1::storage::ProductStoreOperation::CommitSession;
        request.explicitlySelected = true;
        request.expectedFingerprint = expectedFingerprint;
        request.rootPath = leshy1::storage::kProductSessionStoreRoot;
        request.rootExists = rootExists;
        request.driverWriteEnabled = true;
        request.requiredBytes = kProductSurveyCommitBytes;
        request.reserveBytes = kProductSurveyReserveBytes;
        request.ownedResources = owned;
        request.power = powerSafetyPolicy.writeDisposition();
        const leshy1::storage::ProductStorePermit permit =
            leshy1::storage::authorizeProductStore(media, request);
        if (!permit.allowed()) {
            event.status =
                leshy1::storage::productStoreAccessStatusName(permit.status);
            break;
        }
        if (!productSurveyStore.selectDrive(
                productSurveyFilesystem.driveNumber()) ||
            !productSurveyStore.openExistingWritable(permit)) {
            event.status = "store_open_failed";
            break;
        }
        if (!supervisedCheckpoint()) break;

