anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
        const auto& stats = wifiFrameCapture.stats();
        char sessionId[SurveySession::kSessionIdCapacity + 1] = {};
        std::snprintf(sessionId, sizeof(sessionId), "wifi-cap-%08llx",
                      static_cast<unsigned long long>(
                          stats.startedUs & 0xFFFFFFFFULL));
        surveySession.reset();
        if (stats.state != WifiFrameCaptureState::Complete ||
            wifiFrameCapture.capture().size() == 0 ||
            surveySession.start(sessionId, stats.startedUs) !=
                SessionStatus::Started ||
            surveySession.configureCaptureMetadata(
                productWifiFrameCaptureMetadata()) !=
                CaptureMetadataStatus::Configured ||
            surveySession.stop(stats.endedUs) != SessionStatus::Stopped) {
            event.status = "artifact_invalid";
            break;
        }
        const leshy1::storage::SessionStoreCommitResult commit =
            leshy1::storage::commitNextWifiFrameCapture(
                productSurveyStore, sessionStoreWorkspace, surveySession,
                wifiFrameCapture.capture());
        if (!supervisedCheckpoint()) break;
        event.storeStatus = commit.status;
        if (!commit.complete()) {
            event.status = leshy1::storage::sessionStoreStatusName(commit.status);
            break;
        }
        const leshy1::storage::SessionStoreRecoveryResult recovered =
            leshy1::storage::recoverSession(
                productSurveyStore, sessionStoreWorkspace,
                &sessionStoreWorkspace.validationSession);
        if (!supervisedCheckpoint()) break;
        if (!recovered.valid() || recovered.generation != commit.generation) {
            event.status = "reopen_failed";
            event.storeStatus = recovered.status;
            break;
        }
        event.valid = true;
        event.generation = recovered.generation;
        event.status = "saved";
    } while (false);

    if (deadlineArmed && !wifiCaptureStoreDeadlineCancelled()) {
        heartbeatWifiCaptureStore();
    }
    productSurveyStore.end();
    if (productSurveyFilesystem.mounted()) productSurveyFilesystem.end();
    const bool filesystemCleanup = !filesystemAttempted ||
        productSurveyFilesystem.cleanupComplete();
    event.cleanupComplete = identityCleanupComplete && filesystemCleanup &&
        !productSurveyFilesystem.mounted();
    if (!event.cleanupComplete) {
        event.valid = false;
        event.status = "cleanup_failed";
    }
    if (wifiCaptureStoreDeadlineCancelled()) {
        event.valid = false;
        event.status = "safety_worker_deadline";
    }
    if (deadlineArmed) disarmWifiCaptureStoreDeadline();
    resetWifiCaptureStoreDeadlineCancel();
    if (captureStoreEvents != nullptr) {
        xQueueOverwrite(captureStoreEvents, &event);
    }
    vTaskDelete(nullptr);
}

bool requestWifiFrameCapturePersist() {
    if (capturePersistState != CapturePersistState::Confirm ||
        wifiFrameCapture.stats().state != WifiFrameCaptureState::Complete ||
        wifiFrameCapture.capture().size() == 0) {
        return false;
    }
    if (powerSafetyPolicy.writeDisposition() ==
        PowerWriteDisposition::ProhibitedLowVoltage) {
        capturePersistState = CapturePersistState::Failed;
        capturePersistStatus = "power_unsafe";
        lastRuntimeEvent = "capture_store_power_unsafe";
        return true;
    }
    if (captureStoreEvents == nullptr || captureStoreTaskHandle != nullptr) {
        capturePersistState = CapturePersistState::Failed;
        capturePersistStatus = "worker_unavailable";
        lastRuntimeEvent = "capture_store_worker_unavailable";
        return true;
    }
    const auto storageResources =
        leshy1::kernel::runtime::resourceMask(Resource::Storage) |
        leshy1::kernel::runtime::resourceMask(Resource::RadioSpi);
    if (!resourceBroker.acquire(AppRuntime::kForegroundOwner,
                                storageResources)) {
        capturePersistState = CapturePersistState::Failed;
        capturePersistStatus = "resources_busy";
        lastRuntimeEvent = "capture_store_resources_busy";
        return true;
    }
    capturePersistState = CapturePersistState::Saving;
    capturePersistStatus = "saving";
    const bool started = xTaskCreatePinnedToCore(
        runCaptureStoreWorker, "leshy-cap-store", 8192, nullptr, 1,
        &captureStoreTaskHandle, 0) == pdPASS;
    if (!started) {
        resourceBroker.release(AppRuntime::kForegroundOwner, storageResources);
        captureStoreTaskHandle = nullptr;
        capturePersistState = CapturePersistState::Failed;
        capturePersistStatus = "worker_unavailable";
        lastRuntimeEvent = "capture_store_worker_unavailable";
    } else {
        lastRuntimeEvent = "capture_store_saving";
    }
    return true;
}

void serviceWifiFrameCapturePersist() {
    if (captureStoreEvents == nullptr) return;
    CaptureStoreEvent event;
    if (xQueueReceive(captureStoreEvents, &event, 0) != pdTRUE) return;
    captureStoreTaskHandle = nullptr;
    const auto storageResources =
        leshy1::kernel::runtime::resourceMask(Resource::Storage) |
        leshy1::kernel::runtime::resourceMask(Resource::RadioSpi);
    if (!(uiController.page() == 2 &&
          wifiProductView == WifiProductView::Capture)) {
        resourceBroker.release(AppRuntime::kForegroundOwner,
                               storageResources);
    }
    const bool admitted = event.valid && event.cleanupComplete &&
        libraryController.replaceWithOwnedCopy(
            sessionStoreWorkspace.validationSession, librarySession,
            event.generation, SessionIntegrity::Valid, true, false);
    capturePersistState = admitted ? CapturePersistState::Saved
                                   : CapturePersistState::Failed;
    capturePersistStatus = admitted ? "saved" : event.status;
    capturePersistGeneration = admitted ? event.generation : 0;
    capturePersistHeapFreeBeforeMount = event.heapFreeBeforeMount;
    capturePersistHeapLargestBeforeMount = event.heapLargestBeforeMount;
    capturePersistFilesystemMountError = event.filesystemMountError;
    lastRuntimeEvent = admitted ? "capture_store_saved"
                                : "capture_store_failed";
    if (uiController.page() == 4 ||
        (uiController.page() == 2 &&
         wifiProductView == WifiProductView::Capture)) {
        renderInteractiveScreen();
    }
}

void runPulseCaptureStoreWorker(bool infrared, QueueHandle_t events) {
    CaptureStoreEvent event;
    event.status = "store_failed";
    bool identityCleanupComplete = true;
    bool filesystemAttempted = false;
    bool deadlineArmed = false;
    bool supervisionHealthy = true;
    const SupervisedWorker worker = infrared
        ? SupervisedWorker::InfraredCaptureStore
        : SupervisedWorker::SubGhzCaptureStore;
    leshy1::storage::SdTransportRunResult identity;
    char expectedFingerprint[33] = {};
    char observedFingerprint[33] = {};
    const auto supervisedCheckpoint = [&]() {
        if (pulseCaptureStoreDeadlineCancelled(worker)) {
            event.status = "safety_worker_deadline";
            supervisionHealthy = false;
            return false;
        }
        if (!heartbeatPulseCaptureStore(worker)) {
            event.status = "worker_supervisor_unavailable";
            supervisionHealthy = false;
            return false;
        }
        return true;
    };
    do {
        resetPulseCaptureStoreDeadlineCancel(worker);
        std::uint64_t startedUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        if (startedUs == 0) startedUs = 1;
        deadlineArmed = armPulseCaptureStoreDeadline(worker, startedUs);
        if (!deadlineArmed) {
            event.status = "worker_supervisor_unavailable";
            break;
        }
        if (consumePulseCaptureStoreDeadlineInjection(worker)) {
            vTaskDelay(pdMS_TO_TICKS(
                kPulseCaptureStoreDeadlineInjectionMs));
        }
        if (!supervisedCheckpoint()) break;
        const auto required =
            leshy1::kernel::runtime::resourceMask(Resource::UiForeground) |
            leshy1::kernel::runtime::resourceMask(Resource::Storage) |
            leshy1::kernel::runtime::resourceMask(Resource::RadioSpi);
        const auto owned = resourceBroker.ownedBy(
            AppRuntime::kForegroundOwner);
        if ((owned & required) != required) {
            event.status = "resources_missing";
            break;
        }
        if (!loadProductFingerprint(expectedFingerprint,
                                    sizeof(expectedFingerprint))) {
            event.status = "enrollment_missing";
            break;
        }
        if (!supervisedCheckpoint()) break;
        for (std::uint8_t attempt = 1;
             attempt <= leshy1::storage::kProductStartMaximumIdentityAttempts;
             ++attempt) {
            BoardSdSpiTransport transport;
            const bool begun = transport.begin();
            identity = {};
            if (begun) {
                leshy1::storage::SdTransportRunPolicy policy;
                policy.allowPhysical = true;
                policy.explicitlySelected = true;
                policy.identificationOnly = true;
                policy.ownedResources = owned;
                identity = leshy1::storage::runSdIdentificationStateMachine(
                    leshy1::storage::defaultSdIdentificationPlan(), transport,
                    policy);
                transport.end();
            }
            identityCleanupComplete = transport.cleanupComplete();
            formatCidFingerprint(identity.identity, observedFingerprint,
                                 sizeof(observedFingerprint));
            if (!supervisedCheckpoint()) break;
            if (identityCleanupComplete &&
                identity.status ==
                    leshy1::storage::SdTransportRunStatus::Valid) {
                break;
            }
            const leshy1::storage::ProductStartIdentityRetryEvidence evidence{
                true, true, exactCidFingerprint(expectedFingerprint),
                (owned & required) == required,
                transport.physicalSpiStarted(), identity.status,
                std::strcmp(observedFingerprint,
                            "00000000000000000000000000000000") == 0,
                identityCleanupComplete, filesystemAttempted,
            };
            if (!leshy1::storage::shouldRetryProductStartIdentity(
                    evidence, attempt)) {
                break;
            }
            vTaskDelay(pdMS_TO_TICKS(
                leshy1::storage::productStartIdentityRetryDelayMs(attempt)));
            if (!supervisedCheckpoint()) break;
        }
        if (!supervisionHealthy) break;
        if (!identityCleanupComplete ||
            identity.status !=
                leshy1::storage::SdTransportRunStatus::Valid) {
            event.status = "identity_failed";
            break;
        }
        if (std::strcmp(expectedFingerprint, observedFingerprint) != 0) {
            event.status = "fingerprint_mismatch";
            break;
        }
        filesystemAttempted = true;
        event.heapFreeBeforeMount = static_cast<std::uint32_t>(
            heap_caps_get_free_size(MALLOC_CAP_8BIT));
        event.heapLargestBeforeMount = static_cast<std::uint32_t>(
            heap_caps_get_largest_free_block(MALLOC_CAP_8BIT));
        const bool filesystemMounted = productSurveyFilesystem.begin();
        event.filesystemMountError = productSurveyFilesystem.mountError();
        if (!filesystemMounted) {
            event.status = "mount_failed";
            break;
        }
        if (!supervisedCheckpoint()) break;
        const std::uint64_t cardCapacity =
            productSurveyFilesystem.cardCapacityBytes();
        const std::uint64_t cachedFree =
            productSurveyFilesystem.cachedFreeBytes();
        const bool rootExists = productSurveyFilesystem.exists(
            leshy1::storage::kProductSessionStoreRoot);
        leshy1::storage::MediaIdentity media;
        media.present = cardCapacity != 0 &&
            cardCapacity == identity.identity.capacityBytes;
        media.kind = leshy1::storage::MediaKind::Sd;
        media.fingerprint = observedFingerprint;
        media.capacityBytes = cardCapacity;
        media.freeBytes = cachedFree;
        leshy1::storage::ProductStoreRequest request;
        request.operation =
            leshy1::storage::ProductStoreOperation::CommitSession;
        request.explicitlySelected = true;
        request.expectedFingerprint = expectedFingerprint;
        request.rootPath = leshy1::storage::kProductSessionStoreRoot;
        request.rootExists = rootExists;
        request.driverWriteEnabled = true;
        request.requiredBytes = kProductSurveyCommitBytes;
        request.reserveBytes = kProductSurveyReserveBytes;
        request.ownedResources = owned;
        request.power = powerSafetyPolicy.writeDisposition();
        const leshy1::storage::ProductStorePermit permit =
            leshy1::storage::authorizeProductStore(media, request);
        if (!permit.allowed()) {
            event.status =
                leshy1::storage::productStoreAccessStatusName(permit.status);
            break;
        }
        if (!productSurveyStore.selectDrive(
                productSurveyFilesystem.driveNumber()) ||
            !productSurveyStore.openExistingWritable(permit)) {
            event.status = "store_open_failed";
            break;
        }
        if (!supervisedCheckpoint()) break;

        char sessionId[SurveySession::kSessionIdCapacity + 1] = {};
        surveySession.reset();
        leshy1::storage::SessionStoreCommitResult commit;
        std::size_t expectedPulses = 0;
        if (infrared) {
            const auto& stats = infraredCapture.stats();
            std::snprintf(sessionId, sizeof(sessionId), "ir-raw-%08llx",
                          static_cast<unsigned long long>(
                              stats.signalStartedUs & 0xFFFFFFFFULL));
            expectedPulses = infraredCapture.pulseCount();
            if (stats.state != InfraredCaptureState::Complete ||
                expectedPulses == 0 ||
                surveySession.start(sessionId, stats.startedUs) !=
                    SessionStatus::Started ||
                surveySession.configureCaptureMetadata(
                    productInfraredRawCaptureMetadata()) !=
                    CaptureMetadataStatus::Configured ||
                surveySession.stop(stats.endedUs) != SessionStatus::Stopped) {
                event.status = "artifact_invalid";
                break;
            }
            commit = leshy1::storage::commitNextInfraredRawCapture(
                productSurveyStore, sessionStoreWorkspace, surveySession,
                infraredCapture);
        } else {
            const auto& stats = subGhzRawCapture.stats();
            std::snprintf(sessionId, sizeof(sessionId), "sub-raw-%08llx",
                          static_cast<unsigned long long>(
                              stats.signalStartedUs & 0xFFFFFFFFULL));
            expectedPulses = subGhzRawCapture.pulseCount();
            if (stats.state != SubGhzRawCaptureState::Complete ||
                expectedPulses == 0 ||
                surveySession.start(sessionId, stats.startedUs) !=
                    SessionStatus::Started ||
                surveySession.configureCaptureMetadata(
                    productSubGhzRawCaptureMetadata()) !=
                    CaptureMetadataStatus::Configured ||
                surveySession.stop(stats.endedUs) != SessionStatus::Stopped) {
                event.status = "artifact_invalid";
                break;
            }
            commit = leshy1::storage::commitNextSubGhzRawCapture(
                productSurveyStore, sessionStoreWorkspace, surveySession,
                subGhzRawCapture);
        }
        if (!supervisedCheckpoint()) break;
        event.storeStatus = commit.status;
        if (!commit.complete()) {
            event.status =
                leshy1::storage::sessionStoreStatusName(commit.status);
            break;
        }
        const leshy1::storage::SessionStoreRecoveryResult recovered =
            leshy1::storage::recoverSession(
                productSurveyStore, sessionStoreWorkspace,
                &sessionStoreWorkspace.validationSession);
        if (!supervisedCheckpoint()) break;
        if (!recovered.valid() || recovered.generation != commit.generation) {
            event.status = "reopen_failed";
            event.storeStatus = recovered.status;
            break;
        }
        bool pulseReopened = false;
        if (infrared) {
            leshy1::storage::PersistedInfraredRawCaptureView reopened;
            pulseReopened = leshy1::storage::openPersistedInfraredRawCapture(
                sessionStoreWorkspace.validationSession,
                sessionStoreWorkspace.segment.data(),
                sessionStoreWorkspace.segmentSize, &reopened) ==
                    leshy1::storage::SessionCodecStatus::Valid &&
                reopened.pulseCount() == expectedPulses;
        } else {
            leshy1::storage::PersistedSubGhzRawCaptureView reopened;
            pulseReopened = leshy1::storage::openPersistedSubGhzRawCapture(
                sessionStoreWorkspace.validationSession,
                sessionStoreWorkspace.segment.data(),
                sessionStoreWorkspace.segmentSize, &reopened) ==
                    leshy1::storage::SessionCodecStatus::Valid &&
                reopened.pulseCount() == expectedPulses;
        }
        if (!pulseReopened) {
            event.status = "pulse_reopen_failed";
            break;
        }
        if (!supervisedCheckpoint()) break;
        event.valid = true;
        event.generation = recovered.generation;
        event.status = "saved";
    } while (false);

    if (deadlineArmed && !pulseCaptureStoreDeadlineCancelled(worker)) {
        heartbeatPulseCaptureStore(worker);
    }
    productSurveyStore.end();
    if (productSurveyFilesystem.mounted()) productSurveyFilesystem.end();
    const bool filesystemCleanup = !filesystemAttempted ||
        productSurveyFilesystem.cleanupComplete();
    event.cleanupComplete = identityCleanupComplete && filesystemCleanup &&
        !productSurveyFilesystem.mounted();
    if (!event.cleanupComplete) {
        event.valid = false;
        event.status = "cleanup_failed";
    }
    if (pulseCaptureStoreDeadlineCancelled(worker)) {
        event.valid = false;
        event.status = "safety_worker_deadline";
    }
    if (deadlineArmed) disarmPulseCaptureStoreDeadline(worker);
    resetPulseCaptureStoreDeadlineCancel(worker);
    if (events != nullptr) {
        xQueueOverwrite(events, &event);
    }
    vTaskDelete(nullptr);
}

void runSubGhzCaptureStoreWorker(void*) {
    runPulseCaptureStoreWorker(false, subGhzCaptureStoreEvents);
}

