anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool disarmProductBootRecoveryWatchdog() {
    __atomic_store_n(&productBootRecoveryWatchdogArmed, 0,
                     __ATOMIC_RELEASE);
    TaskHandle_t task = productBootRecoveryWatchdogTask;
    productBootRecoveryWatchdogTask = nullptr;
    if (task != nullptr) vTaskDelete(task);
    if (!productBootRecoveryTaskWatchdogAdded) return true;
    productBootRecoveryTaskWatchdogAdded = false;
    return esp_task_wdt_delete(nullptr) == ESP_OK;
}

bool safetyWatchdogResetReason(std::uint32_t reason) {
    return reason == static_cast<std::uint32_t>(ESP_RST_PANIC) ||
           reason == static_cast<std::uint32_t>(ESP_RST_INT_WDT) ||
           reason == static_cast<std::uint32_t>(ESP_RST_TASK_WDT) ||
           reason == static_cast<std::uint32_t>(ESP_RST_WDT);
}

SafetyRetainedRecord snapshotSafetyRetainedRecord() {
    SafetyRetainedRecord record{};
    record.magic = safetyRetainedRtc.magic;
    record.schema = safetyRetainedRtc.schema;
    record.appIdentity = safetyRetainedRtc.appIdentity;
    record.appIdentityInverse = safetyRetainedRtc.appIdentityInverse;
    record.reason = safetyRetainedRtc.reason;
    record.reasonInverse = safetyRetainedRtc.reasonInverse;
    record.tripCount = safetyRetainedRtc.tripCount;
    record.tripCountInverse = safetyRetainedRtc.tripCountInverse;
    record.quiesceCount = safetyRetainedRtc.quiesceCount;
    record.quiesceCountInverse = safetyRetainedRtc.quiesceCountInverse;
    record.latchConfirmed = safetyRetainedRtc.latchConfirmed;
    record.latchConfirmedInverse = safetyRetainedRtc.latchConfirmedInverse;
    return record;
}

void clearSafetyRetainedRecord() {
    safetyRetainedRtc.magic = 0;
    safetyRetainedRtc.schema = 0;
    safetyRetainedRtc.appIdentity = 0;
    safetyRetainedRtc.appIdentityInverse = 0;
    safetyRetainedRtc.reason = 0;
    safetyRetainedRtc.reasonInverse = 0;
    safetyRetainedRtc.tripCount = 0;
    safetyRetainedRtc.tripCountInverse = 0;
    safetyRetainedRtc.quiesceCount = 0;
    safetyRetainedRtc.quiesceCountInverse = 0;
    safetyRetainedRtc.latchConfirmed = 0;
    safetyRetainedRtc.latchConfirmedInverse = 0;
}

void persistSafetyStop(SafetyReason reason, std::uint32_t tripCount,
                       std::uint32_t quiesceCount) {
    const SafetyRetainedRecord record =
        leshy1::kernel::safety::makeSafetyRetainedRecord(
            runningAppIdentity, reason, tripCount, quiesceCount);
    safetyRetainedRtc.magic = 0;
    safetyRetainedRtc.schema = record.schema;
    safetyRetainedRtc.appIdentity = record.appIdentity;
    safetyRetainedRtc.appIdentityInverse = record.appIdentityInverse;
    safetyRetainedRtc.reason = record.reason;
    safetyRetainedRtc.reasonInverse = record.reasonInverse;
    safetyRetainedRtc.tripCount = record.tripCount;
    safetyRetainedRtc.tripCountInverse = record.tripCountInverse;
    safetyRetainedRtc.quiesceCount = record.quiesceCount;
    safetyRetainedRtc.quiesceCountInverse = record.quiesceCountInverse;
    safetyRetainedRtc.latchConfirmed = record.latchConfirmed;
    safetyRetainedRtc.latchConfirmedInverse = record.latchConfirmedInverse;
    safetyRetainedRtc.magic = record.magic;
}

void confirmRetainedSafetyLatch(const SafetyRetainedRecord& record) {
    if (record.latchConfirmed == 1U) return;
    // The ISR already published the target inverse (~1). One aligned store
    // confirms the latch without creating a reset window in which the otherwise
    // valid watchdog record would be rejected.
    safetyRetainedRtc.latchConfirmed = 1U;
    __atomic_thread_fence(__ATOMIC_RELEASE);
}

void latchSafetyStopInTask(SafetyReason reason) {
    BoardSafeOutputs::emergencyQuiesce();
    BoardSdSpiTransport::holdRadioTransmitPathsInactive();
    const std::uint32_t tripCount = safetySupervisor.tripCount() + 1U;
    const std::uint32_t quiesceCount = safetySupervisor.quiesceCount() + 1U;
    persistSafetyStop(reason, tripCount, quiesceCount);
    safetySupervisor.latch(reason, tripCount, quiesceCount);
    runtimeSafetyWatchdogReady = false;
    __atomic_store_n(&runtimeSafetyWatchdogArmed, 0, __ATOMIC_RELEASE);
}

void serviceWorkerDeadlineSupervisor() {
    if (safetySupervisor.latched()) return;
    const std::uint64_t nowUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    bool expired = false;
    WorkerDeadlineSnapshot worker;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    expired = workerDeadlineSupervisor.evaluate(nowUs);
    worker = workerDeadlineSupervisor.snapshot();
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    if (!expired) return;

    if (worker.lastExpiredWorker == SupervisedWorker::WifiCaptureStore) {
        requestWifiCaptureStoreDeadlineCancel();
        capturePersistState = CapturePersistState::Failed;
        capturePersistStatus = "safety_worker_deadline";
        capturePersistGeneration = 0;
    } else if (worker.lastExpiredWorker ==
               SupervisedWorker::SubGhzCaptureStore) {
        requestPulseCaptureStoreDeadlineCancel(
            SupervisedWorker::SubGhzCaptureStore);
        subGhzCapturePersistState = CapturePersistState::Failed;
        subGhzCapturePersistStatus = "safety_worker_deadline";
        subGhzCapturePersistGeneration = 0;
    } else if (worker.lastExpiredWorker ==
               SupervisedWorker::InfraredCaptureStore) {
        requestPulseCaptureStoreDeadlineCancel(
            SupervisedWorker::InfraredCaptureStore);
        infraredCapturePersistState = CapturePersistState::Failed;
        infraredCapturePersistStatus = "safety_worker_deadline";
        infraredCapturePersistGeneration = 0;
    } else {
        requestProductSurveyWorkerStop(true);
        if (productSurveyScanStartGate != nullptr) {
            xSemaphoreGive(productSurveyScanStartGate);
        }
        productSurveyRuntime.status = "safety_worker_deadline";
        productSurveyRuntime.sourceActive = false;
    }
    if (appRuntime.running()) appRuntime.stop();
    lastRuntimeEvent = "safety_worker_deadline";
    latchSafetyStopInTask(SafetyReason::WorkerDeadline);
    renderInteractiveScreen(true);
}

