anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void clearSafetyStopFromConsole(Stream& reply) {
    if (!safetySupervisor.latched()) {
        reply.println(
            "{\"schema\":\"leshy.safety.v1\",\"kind\":\"error\","
            "\"reason\":\"not_latched\"}");
        return;
    }
    if (!safetySupervisor.clearPending()) safetySupervisor.requestClear();
    reply.println(
        "{\"schema\":\"leshy.safety.v1\",\"kind\":\"clear_confirmed\","
        "\"restart_required\":true}");
    reply.flush();
    clearSafetyStopAndRestart();
}

bool readInputRaw(std::uint8_t* value) {
    if (value == nullptr) return false;
    const std::uint8_t received = Wire.requestFrom(BoardProfile::kPcf8574Address,
                                                   static_cast<std::uint8_t>(1), true);
    if (received != 1 || Wire.available() == 0) return false;
    *value = static_cast<std::uint8_t>(Wire.read());
    return true;
}

bool probeInputAtBoot(std::uint8_t* value, std::uint8_t* attempts) {
    if (value == nullptr || attempts == nullptr) return false;
    *attempts = 0;
    for (std::uint8_t attempt = 1; attempt <= kInputProbeMaxAttempts; ++attempt) {
        *attempts = attempt;
        if (readInputRaw(value)) return true;
        if (attempt < kInputProbeMaxAttempts) delay(kInputProbeRetryDelayMs);
    }
    return false;
}

bool probeI2cAddressAck(std::uint8_t address) {
    Wire.beginTransmission(address);
    // Address-only transaction: it observes ACK/NACK and writes no register or
    // payload byte to the unknown power-manager implementation.
    return Wire.endTransmission(true) == 0;
}

void pollPhysicalInput(void*) {
    TickType_t lastWake = xTaskGetTickCount();
    for (;;) {
        std::uint8_t current = 0xFF;
        const bool valid = readInputRaw(&current);
        const std::uint32_t now = millis();
        PhysicalInputEvent event;
        portENTER_CRITICAL(&physicalInputMux);
        event.action = physicalButtonInput.sample(valid, current, now);
        event.raw = physicalButtonInput.stableRaw();
        event.atMs = now;
        event.atUs = static_cast<std::uint64_t>(esp_timer_get_time());
        portEXIT_CRITICAL(&physicalInputMux);
        if (event.action != UiAction::Unknown) {
            if (xQueueSend(physicalInputEvents, &event, 0) != pdTRUE) {
                portENTER_CRITICAL(&physicalInputMux);
                ++physicalInputQueueDrops;
                portEXIT_CRITICAL(&physicalInputMux);
            } else {
                const std::uint32_t depth = static_cast<std::uint32_t>(
                    uxQueueMessagesWaiting(physicalInputEvents));
                portENTER_CRITICAL(&physicalInputMux);
                if (depth > physicalInputQueueHighWater) {
                    physicalInputQueueHighWater = depth;
                }
                portEXIT_CRITICAL(&physicalInputMux);
            }
        }
        vTaskDelayUntil(&lastWake,
                        pdMS_TO_TICKS(Pcf8574ButtonInput::kPollPeriodMs));
    }
}

const char* tr(UiTextId id) {
    return leshy1::ui::uiText(languageController.active(), id);
}

enum class ActiveDisplayFont : std::uint8_t {
    None,
    Body,
    Meta,
};

ActiveDisplayFont activeDisplayFont = ActiveDisplayFont::None;

void selectUiFont(UiTextRole role) {
    const ActiveDisplayFont requested = role == UiTextRole::Body
        ? ActiveDisplayFont::Body : ActiveDisplayFont::Meta;
    if (activeDisplayFont == requested) return;
    if (role == UiTextRole::Body) {
        display.setFreeFont(&RobotoCondensedBody);
    } else {
        display.setFreeFont(&RobotoCondensedMeta);
    }
    activeDisplayFont = requested;
}

std::int16_t uiFontAscent(UiTextRole role) {
    return role == UiTextRole::Body ? kRobotoCondensedBodyAscent
                                    : kRobotoCondensedMetaAscent;
}

void setUiCursor(UiTextRole role, std::int16_t x, std::int16_t top) {
    selectUiFont(role);
    display.setCursor(x, top + uiFontAscent(role));
}

enum class NavigationKey : std::uint8_t {
    None,
    Left,
    UpDown,
    RightAndSelect,
};

struct NavigationCell final {
    NavigationKey key = NavigationKey::None;
    UiTextId label = UiTextId::Count;
};

struct NavigationFooter final {
    NavigationCell left{};
    NavigationCell middle{};
    NavigationCell right{};
};

NavigationFooter navigationFooterForCurrentState() {
    const NavigationCell back = {NavigationKey::Left, UiTextId::NavBack};
    const NavigationCell choose = {NavigationKey::UpDown, UiTextId::NavSelect};
    const NavigationCell enter = {NavigationKey::RightAndSelect,
                                  UiTextId::NavEnter};
    if (safetySupervisor.latched()) {
        return safetySupervisor.clearPending()
            ? NavigationFooter{
                  {NavigationKey::Left, UiTextId::NavCancel}, {},
                  {NavigationKey::RightAndSelect, UiTextId::NavConfirm}}
            : NavigationFooter{
                  {}, {},
                  {NavigationKey::RightAndSelect, UiTextId::NavUnlock}};
    }
    if (uiController.isRoot()) return {{}, choose, enter};
    if (uiController.page() == 1) return {back, {}, {}};

    if (uiController.page() == 2) {
        if (bleProductView == BleProductView::DeviceDetail) {
            return {{NavigationKey::Left, UiTextId::NavList}, {}, {}};
        }
        if (bleProductView == BleProductView::Devices) {
            return {back, choose, enter};
        }
        if (wifiProductView == WifiProductView::Menu) {
            return {back, choose, enter};
        }
        if (wifiProductView == WifiProductView::NetworkDetail) {
            return {{NavigationKey::Left, UiTextId::NavList}, {}, {}};
        }
        if (wifiProductView == WifiProductView::DeviceDetail) {
            return {{NavigationKey::Left, UiTextId::NavList}, {}, {}};
        }
        if (wifiProductView == WifiProductView::Devices) {
            return {back, choose, enter};
        }
        if (wifiProductView == WifiProductView::Channels) {
            return {back, {}, {}};
        }
        if (wifiProductView == WifiProductView::Capture) {
            const auto state = wifiFrameCapture.stats().state;
            if (state == WifiFrameCaptureState::Idle) {
                return {back, {},
                        {NavigationKey::RightAndSelect, UiTextId::NavStart}};
            }
            if (state == WifiFrameCaptureState::Running) {
                return {{NavigationKey::Left, UiTextId::NavCancel}, {},
                        {NavigationKey::RightAndSelect, UiTextId::NavStop}};
            }
            if (state == WifiFrameCaptureState::Complete &&
                capturePersistState == CapturePersistState::Result) {
                return {back, {},
                        {NavigationKey::RightAndSelect, UiTextId::NavSave}};
            }
            if (state == WifiFrameCaptureState::Complete &&
                capturePersistState == CapturePersistState::Confirm) {
                return {{NavigationKey::Left, UiTextId::NavBack}, {},
                        {NavigationKey::RightAndSelect, UiTextId::NavSave}};
            }
            if (capturePersistState == CapturePersistState::Saving) {
                return {};
            }
            return {back, {}, {}};
        }
        if (rfSpectrumView == RfSpectrumView::SourceMenu) {
            return {back, choose, enter};
        }
        if (rfSpectrumView == RfSpectrumView::Nrf24Menu) {
            return {back, choose, enter};
        }
        if (rfSpectrumView == RfSpectrumView::Nrf24Finder) {
            return {back, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavAgain}};
        }
        if (rfSpectrumView == RfSpectrumView::CcFinder) {
            return {back, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavAgain}};
        }
        if (rfSpectrumView == RfSpectrumView::SubGhzMenu ||
            rfSpectrumView == RfSpectrumView::SubGhzCaptureBandMenu) {
            return {back, choose, enter};
        }
        if (rfSpectrumView == RfSpectrumView::SubGhzCaptureLive) {
            const auto state = subGhzRawCapture.stats().state;
            if (state == SubGhzRawCaptureState::Waiting ||
                state == SubGhzRawCaptureState::Capturing) {
                return {{NavigationKey::Left, UiTextId::NavCancel}, {}, {}};
            }
            if (state == SubGhzRawCaptureState::Complete) {
                return subGhzCapturePersistState ==
                               CapturePersistState::Result
                    ? NavigationFooter{
                          back, {}, {NavigationKey::RightAndSelect,
                                     UiTextId::NavSave}}
                    : subGhzCapturePersistState ==
                              CapturePersistState::Saving
                          ? NavigationFooter{}
                          : NavigationFooter{
                                back, {},
                                {NavigationKey::RightAndSelect,
                                 UiTextId::NavStart}};
            }
            return {back, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavStart}};
        }
        if (rfSpectrumView == RfSpectrumView::CcBandMenu) {
            return {back, choose, enter};
        }
        if (rfSpectrumView == RfSpectrumView::Live) {
            const bool cc = rfSpectrumKind == RfSpectrumKind::Cc1101;
            const bool fault = cc
                ? cc1101SpectrumController.state() ==
                      Cc1101SpectrumViewState::Fault
                : nrf24SpectrumController.state() ==
                      Nrf24SpectrumViewState::Fault;
            const bool paused = cc
                ? cc1101SpectrumController.state() ==
                      Cc1101SpectrumViewState::Paused
                : nrf24SpectrumController.state() ==
                      Nrf24SpectrumViewState::Paused;
            if (fault) {
                return {back, {}, {}};
            }
            return {back,
                    {NavigationKey::UpDown, UiTextId::NavView},
                    {NavigationKey::RightAndSelect,
                     cc ? (paused ? UiTextId::NavResume
                                  : UiTextId::NavPause)
                        : UiTextId::NavMode}};
        }
        if (productSurveySourceUnavailableVisible()) {
            return {{NavigationKey::Left, UiTextId::NavHome}, {}, {}};
        }
        if (surveyWorkflow.state() == SurveyWorkflowState::Setup) {
            if (surveySourceController.view() == SurveySetupView::Sources) {
                return {back, choose,
                        {NavigationKey::RightAndSelect,
                         UiTextId::NavToggle}};
            }
            if (surveySourceController.scope() != SurveySourceScope::All) {
                return {back, {},
                        {NavigationKey::RightAndSelect,
                         UiTextId::NavStart}};
            }
            return {back, choose,
                    {NavigationKey::RightAndSelect,
                     surveySourceController.selection() < 2
                         ? UiTextId::NavEnter : UiTextId::NavStart}};
        }
        if (surveyWorkflow.state() == SurveyWorkflowState::Running &&
            surveyController.view() == SurveyView::Filter) {
            return {{NavigationKey::Left, UiTextId::NavList}, choose,
                    {NavigationKey::RightAndSelect, UiTextId::NavApply}};
        }
        if (surveyWorkflow.state() == SurveyWorkflowState::Running &&
            surveyController.view() == SurveyView::Detail) {
            return {{NavigationKey::Left, UiTextId::NavList}, {},
                    {NavigationKey::RightAndSelect,
                     surveyWorkflow.simulated() ? UiTextId::NavStop
                                                : UiTextId::NavSave}};
        }
        if (surveyWorkflow.state() == SurveyWorkflowState::Running) {
            return {{NavigationKey::Left, UiTextId::NavCancel}, choose,
                    {NavigationKey::RightAndSelect,
                     surveyController.filterFocused()
                         ? UiTextId::NavFilter : UiTextId::NavDetails}};
        }
        return {{NavigationKey::Left, UiTextId::NavHome}, {}, {}};
    }

    if (uiController.page() == 3) {
        if (libraryController.view() == LibraryView::ExportReady) {
            return {{NavigationKey::Left, UiTextId::NavDetails}, {}, {}};
        }
        if (libraryController.view() == LibraryView::SessionDetail) {
            return {{NavigationKey::Left, UiTextId::NavList}, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavExport}};
        }
        return {back, choose,
                {NavigationKey::RightAndSelect, UiTextId::NavDetails}};
    }

    if (uiController.page() == 4) {
        if (captureView == CaptureView::SourceMenu) {
            return {back, choose, enter};
        }
        if (captureView == CaptureView::Infrared) {
            const auto state = infraredCapture.stats().state;
            if (state == InfraredCaptureState::Idle) {
                return {back, {},
                        {NavigationKey::RightAndSelect, UiTextId::NavStart}};
            }
            if (state == InfraredCaptureState::Waiting ||
                state == InfraredCaptureState::Capturing) {
                return {{NavigationKey::Left, UiTextId::NavCancel}, {}, {}};
            }
            if (state == InfraredCaptureState::Complete &&
                infraredCapturePersistState == CapturePersistState::Result) {
                return {back, {},
                        {NavigationKey::RightAndSelect, UiTextId::NavSave}};
            }
            if (infraredCapturePersistState == CapturePersistState::Saving) {
                return {{}, {}, {}};
            }
            if (state == InfraredCaptureState::Complete) {
                return {back, {},
                        {NavigationKey::RightAndSelect, UiTextId::NavStart}};
            }
            return {back, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavStart}};
        }
        const auto state = wifiFrameCapture.stats().state;
        if (state == WifiFrameCaptureState::Idle) {
            return {back, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavStart}};
        }
        if (state == WifiFrameCaptureState::Running) {
            return {{NavigationKey::Left, UiTextId::NavCancel}, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavStop}};
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Result) {
            return {back, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavSave}};
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Confirm) {
            return {{NavigationKey::Left, UiTextId::NavBack}, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavSave}};
        }
        return {back, {}, {}};
    }

    if (uiController.page() == 5) {
        return {back, choose,
                {NavigationKey::RightAndSelect, UiTextId::NavApply}};
    }

