anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderWifiNetworkDetailData() {
    const Observation& network = *liveWifiNetworkDetail();
    const WifiNetworkSignalStats& signal = *liveWifiNetworkSignal();
    wifiNetworkDetail = network;
    wifiNetworkDetailSignal = signal;
    display.fillRect(0, Layout::ContentTop, Layout::ScreenWidth,
                     Layout::FooterDividerY - Layout::ContentTop,
                     Palette::Canvas);

    char primary[26] = {};
    if (network.labelLength == 0U) {
        std::snprintf(primary, sizeof(primary), "%s", tr(UiTextId::Hidden));
    } else {
        const std::size_t visible = network.labelLength < sizeof(primary)
            ? network.labelLength : sizeof(primary) - 1U;
        std::memcpy(primary, network.label.data(), visible);
        primary[visible] = '\0';
        if (visible < network.labelLength && visible > 1U) {
            primary[visible - 1U] = '~';
        }
    }
    display.setTextColor(Palette::Focus, Palette::Canvas);
    setUiCursor(UiTextRole::Body, 14, 34);
    display.print(primary);

    char line[96] = {};
    std::snprintf(
        line, sizeof(line), tr(UiTextId::WifiNetworkBssidFormat),
        static_cast<unsigned>(network.identity[0]),
        static_cast<unsigned>(network.identity[1]),
        static_cast<unsigned>(network.identity[2]),
        static_cast<unsigned>(network.identity[3]),
        static_cast<unsigned>(network.identity[4]),
        static_cast<unsigned>(network.identity[5]));
    display.setTextColor(Palette::TextSecondary, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 57);
    display.print(line);

    char vendor[24] = {};
    const bool vendorKnown = wifiOuiDatabase.lookup(
        network.identity.data(), vendor, sizeof(vendor));
    if (vendorKnown) {
        std::snprintf(line, sizeof(line),
                      tr(UiTextId::WifiNetworkVendorFormat), vendor);
    } else {
        std::snprintf(line, sizeof(line), "%s",
                      tr(UiTextId::WifiNetworkVendorUnknown));
    }
    display.setTextColor(vendorKnown ? Palette::TextSecondary
                                     : Palette::TextMuted,
                         Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 76);
    display.print(line);

    display.setTextColor(network.labelLength == 0U ? Palette::Warning
                                                   : Palette::TextMuted,
                         Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 95);
    display.print(tr(network.labelLength == 0U
                         ? UiTextId::WifiNetworkListeningForName
                         : UiTextId::BlePassiveOnly));

    const auto& facts = network.wifiNetwork;
    const char* authentication = facts.present
        ? leshy1::drivers::wifi::wifiAuthenticationName(
              facts.authentication)
        : "UNKNOWN";
    std::snprintf(line, sizeof(line),
                  tr(UiTextId::WifiNetworkSecurityFormat), authentication);
    display.setTextColor(Palette::TextSecondary, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 114);
    display.print(line);

    std::snprintf(
        line, sizeof(line), tr(UiTextId::WifiNetworkCipherFormat),
        leshy1::drivers::wifi::wifiCipherName(facts.pairwiseCipher),
        leshy1::drivers::wifi::wifiCipherName(facts.groupCipher));
    setUiCursor(UiTextRole::Meta, 14, 133);
    display.print(line);

    char width[20] = {};
    std::snprintf(
        width, sizeof(width), "%s%s",
        leshy1::drivers::wifi::wifiChannelWidthName(facts.channelWidth),
        facts.secondaryChannelDirection == 1U
            ? "+" : (facts.secondaryChannelDirection == 2U ? "-" : ""));
    std::snprintf(
        line, sizeof(line), tr(UiTextId::WifiNetworkRadioFormat),
        static_cast<unsigned>(network.channel),
        static_cast<unsigned long>(network.frequencyKhz / 1000U),
        width);
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 152);
    display.print(line);

    char phy[28] = {};
    if (!leshy1::drivers::wifi::formatWifiPhyMask(
            facts.phyMask, phy, sizeof(phy))) {
        std::snprintf(phy, sizeof(phy), "UNKNOWN");
    }
    const char* ftm = facts.ftmResponder && facts.ftmInitiator
        ? "R+I" : (facts.ftmResponder ? "R" :
                     (facts.ftmInitiator ? "I" : "--"));
    char antenna[4] = "--";
    if (facts.receiveAntenna <= 1U) {
        std::snprintf(antenna, sizeof(antenna), "%u",
                      static_cast<unsigned>(facts.receiveAntenna));
    }
    std::snprintf(line, sizeof(line),
                  tr(UiTextId::WifiNetworkPhyFeaturesFormat), phy,
                  facts.wps ? "+" : "--", ftm, antenna);
    display.setTextColor(Palette::TextSecondary, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 171);
    display.print(line);

    const bool countryKnown = facts.countryCode[0] >= 'A' &&
        facts.countryCode[0] <= 'Z' && facts.countryCode[1] >= 'A' &&
        facts.countryCode[1] <= 'Z' && facts.countryChannelCount != 0U;
    if (countryKnown) {
        char country[3] = {facts.countryCode[0], facts.countryCode[1], '\0'};
        const unsigned lastChannel = static_cast<unsigned>(
            facts.countryStartChannel + facts.countryChannelCount - 1U);
        std::snprintf(line, sizeof(line),
                      tr(UiTextId::WifiNetworkCountryCompactFormat), country,
                      static_cast<unsigned>(facts.countryStartChannel),
                      lastChannel,
                      static_cast<int>(facts.countryMaximumTxPowerDbm));
        display.setTextColor(Palette::TextMuted, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 190);
        display.print(line);
    }
    if (facts.bssColorKnown || facts.vhtCenterChannel1 != 0U ||
        facts.vhtCenterChannel2 != 0U) {
        std::snprintf(line, sizeof(line),
                      tr(UiTextId::WifiNetworkHeCompactFormat),
                      static_cast<unsigned>(facts.bssColor),
                      static_cast<unsigned>(facts.vhtCenterChannel1),
                      static_cast<unsigned>(facts.vhtCenterChannel2));
        display.setTextColor(Palette::TextMuted, Palette::Canvas);
        const std::int16_t advancedX = Layout::ScreenWidth - Layout::Edge -
                                       display.textWidth(line);
        setUiCursor(UiTextRole::Meta, advancedX, 207);
        display.print(line);
    }
    renderWifiNetworkRadar(network, signal);
    wifiNetworkRenderedDetail = network;
}

void renderWifiNetworkDetail(bool clearContent) {
    renderHeader(tr(UiTextId::WifiNetworkDetailTitle), clearContent);
    renderWifiNetworkDetailData();
}

