anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    formatBleAddress(device, line, sizeof(line));
    display.setTextColor(Palette::TextSecondary, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 76);
    display.print(line);

    const auto& facts = device.bleAdvertisement;
    std::snprintf(line, sizeof(line), tr(UiTextId::BleAddressModeFormat),
                  tr(bleAddressTypeText(facts.addressType)),
                  tr(bleAdvertisementModeText(facts)));
    display.setTextColor(Palette::TextMuted, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 95);
    display.print(line);

    const bool vendorKnown = bleDeviceVendor(device, vendor, sizeof(vendor));
    if (vendorKnown) {
        std::snprintf(line, sizeof(line), tr(UiTextId::BleVendorFormat), vendor);
    } else if (facts.companyKnown) {
        std::snprintf(line, sizeof(line), tr(UiTextId::BleCompanyFormat),
                      static_cast<unsigned>(facts.companyId));
    } else {
        std::snprintf(line, sizeof(line), "%s",
                      tr(UiTextId::BleVendorUnknown));
    }
    display.setTextColor(vendorKnown ? Palette::TextSecondary
                                     : Palette::TextMuted,
                         Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 114);
    display.print(line);

    char serviceText[24] = {};
    const char* service =
        compactBleService(device, serviceText, sizeof(serviceText));
    if (service[0] != '\0') {
        std::snprintf(line, sizeof(line), tr(UiTextId::BleServiceFormat),
                      service);
    } else {
        std::snprintf(line, sizeof(line), "%s",
                      tr(UiTextId::BleServiceUnknown));
    }
    display.setTextColor(service[0] == '\0' ? Palette::TextMuted
                                             : Palette::Positive,
                         Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 133);
    display.print(line);

    line[0] = '\0';
    if (facts.txPowerKnown && facts.appearanceKnown) {
        std::snprintf(line, sizeof(line),
                      tr(UiTextId::BleTxAppearanceFormat),
                      static_cast<int>(facts.txPowerDbm),
                      static_cast<unsigned>(facts.appearance));
    } else if (facts.txPowerKnown) {
        std::snprintf(line, sizeof(line), tr(UiTextId::BleTxFormat),
                      static_cast<int>(facts.txPowerDbm));
    } else if (facts.appearanceKnown) {
        std::snprintf(line, sizeof(line), tr(UiTextId::BleAppearanceFormat),
                      static_cast<unsigned>(facts.appearance));
    } else {
        std::snprintf(line, sizeof(line), "%s", tr(UiTextId::BlePassiveOnly));
    }
    display.setTextColor(Palette::TextMuted, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 152);
    display.print(line);
    renderBleDeviceRadar(device, signal);
    bleDeviceRenderedDetail = device;
}

void renderBleDeviceDetail(bool clearContent) {
    renderHeader(tr(UiTextId::BleDeviceDetailTitle), clearContent);
    renderBleDeviceDetailData();
}

std::size_t wifiDeviceFirstVisible(std::size_t selection) {
    return selection < kVisibleWifiNetworkRows
        ? 0 : selection - kVisibleWifiNetworkRows + 1U;
}

UiTextId wifiDeviceGenerationText(WifiDeviceGeneration generation) {
    switch (generation) {
        case WifiDeviceGeneration::Legacy:
            return UiTextId::WifiDeviceWifiLegacy;
        case WifiDeviceGeneration::Wifi4:
            return UiTextId::WifiDeviceWifi4;
        case WifiDeviceGeneration::Wifi5:
            return UiTextId::WifiDeviceWifi5;
        case WifiDeviceGeneration::Wifi6:
            return UiTextId::WifiDeviceWifi6;
        case WifiDeviceGeneration::Unknown:
        default:
            return UiTextId::WifiDeviceUnknown;
    }
}

const char* wifiDeviceMaker(const WifiDeviceRecord& device) {
    if (device.wpsManufacturerLength != 0U) {
        return device.wpsManufacturer.data();
    }
    return device.ouiVendorLength != 0U ? device.ouiVendor.data() : nullptr;
}

const char* wifiDevicePrimaryLabel(const WifiDeviceRecord& device) {
    if (device.wpsDeviceNameLength != 0U) {
        return device.wpsDeviceName.data();
    }
    if (device.wpsModelLength != 0U) return device.wpsModel.data();
    const char* maker = wifiDeviceMaker(device);
    return maker == nullptr ? "" : maker;
}

void formatWifiAddress(const std::array<std::uint8_t, 6>& address,
                       char* output, std::size_t capacity);

void compactWifiDeviceLabel(const WifiDeviceRecord& device, char* output,
                            std::size_t capacity) {
    if (output == nullptr || capacity == 0U) return;
    const char* source = wifiDevicePrimaryLabel(device);
    if (source[0] == '\0') {
        formatWifiAddress(device.address, output, capacity);
        return;
    }
    const std::size_t sourceLength = std::strlen(source);
    const std::size_t visible = sourceLength < capacity
        ? sourceLength : capacity - 1U;
    std::memcpy(output, source, visible);
    output[visible] = '\0';
    if (visible < sourceLength && visible > 1U) output[visible - 1U] = '~';
}

UiTextId wifiDeviceStateText(WifiDeviceState state) {
    switch (state) {
        case WifiDeviceState::Searching: return UiTextId::WifiDeviceSearching;
        case WifiDeviceState::Connecting: return UiTextId::WifiDeviceConnecting;
        case WifiDeviceState::Connected: return UiTextId::WifiDeviceConnected;
    }
    return UiTextId::WifiDeviceSearching;
}

void formatWifiAddress(const std::array<std::uint8_t, 6>& address,
                       char* output, std::size_t capacity) {
    if (output == nullptr || capacity == 0U) return;
    std::snprintf(output, capacity, tr(UiTextId::WifiDeviceAddressFormat),
                  static_cast<unsigned>(address[0]),
                  static_cast<unsigned>(address[1]),
                  static_cast<unsigned>(address[2]),
                  static_cast<unsigned>(address[3]),
                  static_cast<unsigned>(address[4]),
                  static_cast<unsigned>(address[5]));
}

