anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool wifiProductTaskReady(std::uint8_t index) {
    // Functions are admitted one at a time. The menu stays truthful while the
    // remaining radio workflows are being implemented and measured.
    return index <= 3U;
}

void renderWifiProductRow(std::uint8_t index) {
    if (index >= kWifiProductTaskCount) return;
    const bool ready = wifiProductTaskReady(index);
    renderMenuRow(Components::homeRow(index), tr(wifiProductLabel(index)),
                  tr(ready ? wifiProductNote(index) : UiTextId::WifiMenuNext),
                  wifiProductSelection == index, ready,
                  ready ? Tone::Positive : Tone::Muted);
}

void renderWifiProductMenu(bool clearContent) {
    renderHeader(tr(UiTextId::WifiMenuTitle), clearContent);
    for (std::uint8_t index = 0; index < kWifiProductTaskCount; ++index) {
        renderWifiProductRow(index);
    }
}

void renderRfSpectrumSourceRow(std::uint8_t index) {
    if (index >= 2) return;
    const bool selected = rfSpectrumSelection == index;
    const bool available = BoardProfile::kRfShieldDeclared &&
        !BoardProfile::kGpsDeclared && !BoardProfile::kPn532Declared;
    renderMenuRow(Components::choiceRow(index),
                  tr(index == 0 ? UiTextId::SpectrumNrf24
                                : UiTextId::SpectrumCc1101),
                  tr(available ? UiTextId::SpectrumRxReady
                               : UiTextId::SpectrumUnavailable),
                  selected, available,
                  available ? Tone::Positive : Tone::Muted);
}

void renderRfSpectrumSourceMenu(bool clearContent) {
    renderHeader(tr(UiTextId::SpectrumSources), clearContent);
    renderRfSpectrumSourceRow(0);
    renderRfSpectrumSourceRow(1);
}

void renderNrf24ModeRow(std::uint8_t index, bool selected) {
    if (index >= 2U) return;
    renderMenuRow(
        Components::choiceRow(index),
        tr(index == 0U ? UiTextId::Nrf24Overview : UiTextId::Nrf24Finder),
        tr(index == 0U ? UiTextId::Nrf24OverviewNote
                       : UiTextId::Nrf24FinderNote),
        selected, true, Tone::Positive);
}

void renderNrf24ModeMenu(bool clearContent) {
    renderHeader(tr(UiTextId::Nrf24Modes), clearContent);
    renderNrf24ModeRow(0, nrf24ModeSelection == 0U);
    renderNrf24ModeRow(1, nrf24ModeSelection == 1U);
}

void renderSubGhzModeRow(std::uint8_t index, bool selected) {
    if (index >= 3U) return;
    const UiTextId label = index == 0U
        ? UiTextId::SubGhzSpectrum
        : (index == 1U ? UiTextId::CcFinder : UiTextId::SubGhzRaw);
    const UiTextId note = index == 0U
        ? UiTextId::SubGhzSpectrumNote
        : (index == 1U ? UiTextId::CcFinderNote : UiTextId::SubGhzRawNote);
    renderMenuRow(Components::choiceRow(index), tr(label), tr(note),
                  selected, true, Tone::Positive);
}

void renderSubGhzModeMenu(bool clearContent) {
    renderHeader(tr(UiTextId::SubGhzModes), clearContent);
    for (std::uint8_t index = 0; index < 3U; ++index) {
        renderSubGhzModeRow(index, subGhzModeSelection == index);
    }
}

leshy1::drivers::radio::Cc1101SpectrumBand ccBandFromIndex(
    std::uint8_t index) {
    const std::uint8_t count = static_cast<std::uint8_t>(
        leshy1::drivers::radio::Cc1101SpectrumBand::Count);
    return static_cast<leshy1::drivers::radio::Cc1101SpectrumBand>(
        index < count ? index : 0);
}

std::uint8_t ccBandSelectionIndex() {
    return static_cast<std::uint8_t>(rfCcBandSelection);
}

void renderRfCcBandRow(std::uint8_t index) {
    if (index >= static_cast<std::uint8_t>(
            leshy1::drivers::radio::Cc1101SpectrumBand::Count)) return;
    const auto band = ccBandFromIndex(index);
    const auto plan = leshy1::drivers::radio::cc1101PassiveSpectrumPlan(band);
    char label[40] = {};
    char note[48] = {};
    std::snprintf(label, sizeof(label),
                  tr(UiTextId::CcSpectrumBandChoiceFormat),
                  leshy1::drivers::radio::cc1101SpectrumBandName(band));
    std::snprintf(note, sizeof(note),
                  tr(UiTextId::CcSpectrumBandRangeFormat),
                  static_cast<unsigned long>(plan.firstKHz / 1000U),
                  static_cast<unsigned long>(plan.firstKHz % 1000U),
                  static_cast<unsigned long>(plan.lastKHz / 1000U),
                  static_cast<unsigned long>(plan.lastKHz % 1000U));
    renderMenuRow(Components::homeRow(index), label, note,
                  rfCcBandSelection == band, true, Tone::Positive);
}

void renderRfCcBandMenu(bool clearContent) {
    renderHeader(tr(UiTextId::CcSpectrumBands), clearContent);
    for (std::uint8_t index = 0; index < 4; ++index) {
        renderRfCcBandRow(index);
    }
}

std::uint32_t subGhzCaptureFrequencyKHz(
    leshy1::drivers::radio::Cc1101SpectrumBand band) {
    switch (band) {
        case leshy1::drivers::radio::Cc1101SpectrumBand::Band315:
            return 315000;
        case leshy1::drivers::radio::Cc1101SpectrumBand::Band433:
            return 433920;
        case leshy1::drivers::radio::Cc1101SpectrumBand::Band868:
            return 868350;
        case leshy1::drivers::radio::Cc1101SpectrumBand::Band915:
            return 915000;
        case leshy1::drivers::radio::Cc1101SpectrumBand::Count:
            break;
    }
    return 433920;
}

void renderSubGhzCaptureBandMenu(bool clearContent) {
    renderHeader(tr(UiTextId::SubGhzRawBands), clearContent);
    for (std::uint8_t index = 0; index < 4; ++index) {
        renderRfCcBandRow(index);
    }
}

void renderSubGhzRawCapturePage(bool clearContent) {
    const auto& stats = subGhzRawCapture.stats();
    const UiTextId title = stats.state == SubGhzRawCaptureState::Waiting
        ? UiTextId::SubGhzRawWaiting
        : stats.state == SubGhzRawCaptureState::Capturing
              ? UiTextId::SubGhzRawCapturing
              : stats.state == SubGhzRawCaptureState::Complete
                    ? UiTextId::SubGhzRawComplete
                    : stats.state == SubGhzRawCaptureState::TimedOut
                          ? UiTextId::SubGhzRawTimedOut
                          : stats.state ==
                                    SubGhzRawCaptureState::SignalTooLong
                                ? UiTextId::SubGhzRawTooLong
                          : UiTextId::SubGhzRawFailed;
    renderHeader(tr(title), clearContent);
    char line[96] = {};
    const auto& plan = subGhzRawCapture.plan();
    std::snprintf(line, sizeof(line), tr(UiTextId::SubGhzRawFrequencyFormat),
                  static_cast<unsigned long>(plan.frequencyKHz / 1000U),
                  static_cast<unsigned long>(plan.frequencyKHz % 1000U));
    if (stats.state == SubGhzRawCaptureState::Waiting) {
        renderMetric(0, line, Tone::Positive);
        renderMetric(1, tr(UiTextId::SubGhzPressButton));
        renderMetric(2, tr(UiTextId::SubGhzWaitUser));
        return;
    }
    if (stats.state == SubGhzRawCaptureState::Capturing) {
        renderMetric(0, tr(UiTextId::SubGhzSignalDetected), Tone::Positive);
        renderMetric(1, tr(UiTextId::SubGhzKeepPressed));
        renderMetric(2, line);
        return;
    }
    if (stats.state == SubGhzRawCaptureState::Complete) {
        renderMetric(0, tr(UiTextId::SubGhzSignalRecorded), Tone::Positive);
        renderMetric(1, line);
        const UiTextId storageMessage =
            subGhzCapturePersistState == CapturePersistState::Saving
                ? UiTextId::CaptureSavingUser
                : subGhzCapturePersistState == CapturePersistState::Saved
                      ? UiTextId::CaptureSavedUser
                      : subGhzCapturePersistState == CapturePersistState::Failed
                            ? UiTextId::CaptureSaveFailedUser
                            : UiTextId::CaptureReadyToSave;
        renderMetric(2, tr(storageMessage),
                     subGhzCapturePersistState == CapturePersistState::Failed
                         ? Tone::Danger : Tone::Positive);
        return;
    }
    if (stats.state == SubGhzRawCaptureState::TimedOut) {
        renderMetric(0, line);
        renderMetric(1, tr(UiTextId::SubGhzTryCloser), Tone::Warning);
        renderMetric(2, tr(UiTextId::CaptureTryAgainUser));
        return;
    }
    if (stats.state == SubGhzRawCaptureState::SignalTooLong) {
        renderMetric(0, tr(UiTextId::SubGhzSignalDetected), Tone::Warning);
        renderMetric(1, tr(UiTextId::SubGhzReleaseButton), Tone::Danger);
        return;
    }
    renderMetric(0, tr(UiTextId::SubGhzReceiverFailed), Tone::Danger);
    renderMetric(1, tr(UiTextId::CaptureTryAgainUser));
}

constexpr std::int16_t kSpectrumOverlayY = Layout::HeaderHeight;
constexpr std::int16_t kSpectrumOverlayHeight = 28;
constexpr std::int16_t kSpectrumAxisHeight = 15;
constexpr std::int16_t kSpectrumAxisY =
    Layout::FooterDividerY - kSpectrumAxisHeight;
constexpr std::int16_t kSpectrumGraphY =
    kSpectrumOverlayY + kSpectrumOverlayHeight;
constexpr std::int16_t kSpectrumGraphHeight =
    kSpectrumAxisY - kSpectrumGraphY;
static_assert(kSpectrumGraphHeight == SpectrumViewport::kHistoryRows,
              "each waterfall sample must occupy exactly one TFT row");
static_assert(Layout::ScreenWidth == SpectrumViewport::kDisplayColumns,
              "the expanded spectrum scanline must span the TFT width");
constexpr std::uint16_t kSpectrumNoSignal =
    leshy1::ui::visual::rgb565(0, 0, 0);
constexpr std::uint16_t kWifiChannelDivider =
    leshy1::ui::visual::rgb565(24, 44, 40);
constexpr std::uint16_t kWifiPrimaryChannelDivider =
    leshy1::ui::visual::rgb565(104, 84, 16);
constexpr std::uint8_t kSpectrumQuietThreshold = 8;

std::int16_t wifiChannelCenterX(std::uint8_t channel) {
    const std::uint16_t frequencyMhz = static_cast<std::uint16_t>(
        2412U + static_cast<std::uint16_t>(channel - 1U) * 5U);
    return static_cast<std::int16_t>(
        (static_cast<std::uint32_t>(frequencyMhz - 2402U) *
             (Layout::ScreenWidth - 1) + 41U) /
        82U);
}

std::uint16_t spectrumTone(std::uint8_t intensity) {
    if (intensity < kSpectrumQuietThreshold) return kSpectrumNoSignal;
    if (intensity < 64U) {
        return leshy1::ui::visual::rgb565(
            0, static_cast<std::uint8_t>(intensity * 2U), 196);
    }
    if (intensity < 128U) {
        return leshy1::ui::visual::rgb565(
            0, static_cast<std::uint8_t>(128U + intensity),
            static_cast<std::uint8_t>(255U - (intensity - 64U) * 3U));
    }
    if (intensity < 192U) {
        return leshy1::ui::visual::rgb565(
            static_cast<std::uint8_t>((intensity - 128U) * 4U), 255, 0);
    }
    return leshy1::ui::visual::rgb565(
        255, static_cast<std::uint8_t>(255U - (intensity - 192U) * 4U), 0);
}

std::uint16_t wifiChannelGridTone(std::int16_t x,
                                  std::uint8_t intensity) {
    const std::uint16_t signal = spectrumTone(intensity);
    if (intensity >= kSpectrumQuietThreshold) return signal;
    for (std::uint8_t channel = 1; channel <= 13; ++channel) {
        if (x != wifiChannelCenterX(channel)) continue;
        return channel == 1 || channel == 6 || channel == 11
            ? kWifiPrimaryChannelDivider : kWifiChannelDivider;
    }
    return signal;
}

const char* spectrumDisplayModeText() {
    return tr(spectrumViewport.mode() == SpectrumDisplayMode::Spectrum
                  ? UiTextId::SpectrumDisplaySpectrum
                  : UiTextId::SpectrumDisplayWaterfall);
}

std::size_t activeSpectrumBins() {
    return rfSpectrumKind == RfSpectrumKind::Cc1101
        ? Cc1101SpectrumController::kBinCount
        : Nrf24SpectrumController::kChannelCount;
}

std::uint8_t activeSpectrumIntensity(std::size_t bin) {
    return rfSpectrumKind == RfSpectrumKind::Cc1101
        ? cc1101SpectrumController.intensity(bin)
        : nrf24SpectrumController.displayIntensity(bin);
}

bool pushActiveSpectrumHistory() {
    const std::size_t bins = activeSpectrumBins();
    for (std::size_t bin = 0; bin < bins; ++bin) {
        spectrumIntensity[bin] = activeSpectrumIntensity(bin);
    }
    return spectrumViewport.push(spectrumIntensity.data(), bins);
}

