anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    if (uiController.page() == 6 &&
        selfTestController.view() == SelfTestView::ModeMenu &&
        renderedUi.selfTestView ==
            static_cast<std::uint8_t>(SelfTestView::ModeMenu)) {
        const std::uint8_t current = selfTestController.selection();
        if (renderedUi.selfTestSelection == current) return false;
        renderSelfTestModeRow(renderedUi.selfTestSelection);
        renderSelfTestModeRow(current);
        return true;
    }
    return false;
}

void renderInteractiveScreen(bool clearContent) {
    std::uint64_t startedUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0) startedUs = 1;
    display.startWrite();
    const bool incremental = !safetySupervisor.latched() && !clearContent &&
                             renderSelectionDelta();
    if (!incremental) {
        clearContent = true;
        if (safetySupervisor.latched()) {
            renderSafetyStop(clearContent);
        } else if (uiController.isRoot()) {
            renderHome(clearContent);
        } else if (uiController.page() == 1) {
            renderOverview(clearContent);
        } else if (uiController.page() == 2) {
            renderInventoryPage(clearContent);
        } else if (uiController.page() == 3) {
            renderLibraryPage(clearContent);
        } else if (uiController.page() == 4) {
            renderCapturePage(clearContent);
        } else if (uiController.page() == 5) {
            renderLanguagePage(clearContent);
        } else if (uiController.page() == 6) {
            renderSelfTestPage(clearContent);
        } else if (uiController.page() == kDevicePage) {
            renderDevicePage(clearContent);
        } else if (uiController.page() == kPowerPage) {
            renderPowerPage(clearContent);
        } else {
            renderAboutPage(clearContent);
        }
        const Rect divider = Components::footerDivider();
        display.drawFastHLine(divider.x, divider.y, divider.width,
                              Palette::Divider);
        renderNavigationFooter();
        // As in 0.x MenuScreen::repaint, focus movement leaves chrome untouched.
    }
    display.endWrite();
    renderedUi = captureUiRenderSnapshot();
    const std::uint64_t finishedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    lastUiRenderWasIncremental = incremental;
    lastUiRenderUs = finishedUs >= startedUs ? finishedUs - startedUs : 0;
}

bool startNrf24Receiver(bool finder) {
    nrf24SpectrumController.reset();
    nrf24SignalFinder.reset();
    spectrumViewport.reset(Nrf24SpectrumController::kChannelCount);
    nrf24SpectrumReport = {};
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0) startedUs = 1;
    const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
        AppRuntime::kForegroundOwner;
    const Nrf24PassiveSpectrumPlan plan =
        leshy1::drivers::radio::defaultNrf24PassiveSpectrumPlan();
    const bool hardwareReady = boardNrf24Spectrum.begin(
        owned, plan, &nrf24SpectrumReport);
    const bool started = hardwareReady && nrf24SpectrumController.start(
        nrf24SpectrumReport.detectedModules, startedUs) &&
        (!finder || nrf24SignalFinder.start(
            nrf24SpectrumReport.detectedModules, startedUs));
    if (!started) {
        boardNrf24Spectrum.end();
        nrf24SpectrumController.fail();
        if (finder) nrf24SignalFinder.fail();
    }
    rfSpectrumKind = RfSpectrumKind::Nrf24;
    rfSpectrumView = finder ? RfSpectrumView::Nrf24Finder
                            : RfSpectrumView::Live;
    nextSpectrumUiRefreshUs = startedUs;
    resetSpectrumWaterfallTiming();
    if (!finder) armSpectrumWaterfallForCurrentReceiver();
    nrf24SpectrumChunkMaxUs = 0;
    nrf24FinderRenderedHeights.fill(0);
    nrf24FinderRenderedRevision = UINT32_MAX;
    nrf24FinderRenderedState = Nrf24SignalFinderState::Idle;
    nrf24FinderRenderedChannel = 0xffU;
    nrf24FinderRenderedFound = false;
    lastRuntimeEvent = started
        ? (finder ? "nrf24_finder_calibrating" : "nrf24_spectrum_running")
        : (finder ? "nrf24_finder_start_failed"
                  : "nrf24_spectrum_start_failed");
    return true;
}

bool startNrf24Spectrum() { return startNrf24Receiver(false); }

bool startNrf24Finder() { return startNrf24Receiver(true); }

bool stopNrf24Spectrum(bool returnToSourceMenu) {
    const bool cleanup = boardNrf24Spectrum.end();
    if (nrf24SpectrumController.state() != Nrf24SpectrumViewState::Idle) {
        nrf24SpectrumController.stop();
    }
    if (nrf24SignalFinder.state() != Nrf24SignalFinderState::Idle) {
        nrf24SignalFinder.stop();
    }
    const bool direct = std::strcmp(appRuntime.activeApp(), "spectrum24") == 0;
    rfSpectrumView = returnToSourceMenu
        ? RfSpectrumView::SourceMenu
        : (direct ? RfSpectrumView::Nrf24Menu : RfSpectrumView::None);
    nextSpectrumUiRefreshUs = 0;
    lastRuntimeEvent = cleanup ? "nrf24_spectrum_stopped"
                               : "nrf24_spectrum_cleanup_failed";
    return true;
}

void serviceNrf24Spectrum() {
    const bool finder = rfSpectrumView == RfSpectrumView::Nrf24Finder;
    if ((!finder && rfSpectrumView != RfSpectrumView::Live) ||
        rfSpectrumKind != RfSpectrumKind::Nrf24 ||
        nrf24SpectrumController.state() !=
            Nrf24SpectrumViewState::Running) {
        return;
    }
    const std::uint32_t finderRevision = nrf24SignalFinder.revision();
    Nrf24PassiveSweep sweep;
    const bool valid = boardNrf24Spectrum.sampleChunk(&sweep) &&
                       nrf24SpectrumController.ingest(sweep) &&
                       (!finder || nrf24SignalFinder.ingest(sweep));
    if (!valid) {
        boardNrf24Spectrum.end();
        nrf24SpectrumController.fail();
        if (finder) nrf24SignalFinder.fail();
        lastRuntimeEvent = finder ? "nrf24_finder_runtime_fault"
                                  : "nrf24_spectrum_runtime_fault";
        renderInteractiveScreen(true);
        return;
    }
    const std::uint64_t chunkUs = sweep.endedUs - sweep.startedUs;
    if (chunkUs > nrf24SpectrumChunkMaxUs) {
        nrf24SpectrumChunkMaxUs = chunkUs;
    }
    if (finder) {
        if (nrf24SignalFinder.revision() != finderRevision &&
            !uiController.isRoot() && uiController.page() == 2) {
            display.startWrite();
            renderNrf24FinderResult(false);
            renderNrf24FinderGraph(false);
            display.endWrite();
            lastRuntimeEvent = nrf24SignalFinder.found()
                ? "nrf24_finder_signal_found"
                : (nrf24SignalFinder.calibrated()
                       ? "nrf24_finder_waiting"
                       : "nrf24_finder_calibrating");
        }
        return;
    }
    const std::uint64_t refreshUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (!uiController.isRoot() && uiController.page() == 2 &&
        spectrumViewport.mode() == SpectrumDisplayMode::Spectrum &&
        refreshUs >= nextSpectrumUiRefreshUs) {
        display.startWrite();
        renderSpectrumBars();
        display.endWrite();
        nextSpectrumUiRefreshUs = refreshUs + 100000ULL;
    }
}

bool startCc1101Spectrum(
    leshy1::drivers::radio::Cc1101SpectrumBand band) {
    cc1101SpectrumController.reset();
    spectrumViewport.reset(Cc1101SpectrumController::kBinCount);
    cc1101SpectrumReport = {};
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0) startedUs = 1;
    const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
        AppRuntime::kForegroundOwner;
    const bool hardwareReady = boardCc1101Spectrum.begin(
        owned, &cc1101SpectrumReport);
    const bool started = hardwareReady &&
        cc1101SpectrumController.start(band, startedUs);
    if (!started) {
        boardCc1101Spectrum.end();
        cc1101SpectrumController.fail();
    }
    rfSpectrumKind = RfSpectrumKind::Cc1101;
    rfSpectrumView = RfSpectrumView::Live;
    nextSpectrumUiRefreshUs = startedUs;
    resetSpectrumWaterfallTiming();
    armSpectrumWaterfallForCurrentReceiver();
    lastRuntimeEvent = started ? "cc1101_spectrum_running"
                               : "cc1101_spectrum_start_failed";
    return true;
}

bool startCc1101Finder() {
    cc1101SignalFinder.reset();
    cc1101SpectrumReport = {};
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0U) startedUs = 1U;
    const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
        AppRuntime::kForegroundOwner;
    const bool hardwareReady = boardCc1101Spectrum.begin(
        owned, &cc1101SpectrumReport);
    const bool started = hardwareReady &&
        cc1101SignalFinder.start(startedUs);
    if (!started) {
        boardCc1101Spectrum.end();
        cc1101SignalFinder.fail();
    }
    rfSpectrumKind = RfSpectrumKind::Cc1101;
    rfSpectrumView = RfSpectrumView::CcFinder;
    ccFinderRenderedHeights.fill(0);
    ccFinderRenderedRevision = UINT32_MAX;
    ccFinderRenderedState = Cc1101SignalFinderState::Idle;
    ccFinderRenderedFrequencyKHz = UINT32_MAX;
    ccFinderRenderedFound = false;
    lastRuntimeEvent = started ? "cc1101_finder_calibrating"
                               : "cc1101_finder_start_failed";
    return true;
}

bool stopCc1101Finder() {
    const bool cleanup = boardCc1101Spectrum.end();
    if (cc1101SignalFinder.state() != Cc1101SignalFinderState::Idle) {
        cc1101SignalFinder.stop();
    }
    rfSpectrumView = RfSpectrumView::SubGhzMenu;
    nextSpectrumUiRefreshUs = 0;
    lastRuntimeEvent = cleanup ? "cc1101_finder_stopped"
                               : "cc1101_finder_cleanup_failed";
    return true;
}

bool stopCc1101Spectrum(bool returnToSourceMenu) {
    const bool cleanup = boardCc1101Spectrum.end();
    if (cc1101SpectrumController.state() !=
        Cc1101SpectrumViewState::Idle) {
        cc1101SpectrumController.stop();
    }
    if (cc1101SignalFinder.state() != Cc1101SignalFinderState::Idle) {
        cc1101SignalFinder.stop();
    }
    rfSpectrumView = returnToSourceMenu ? RfSpectrumView::CcBandMenu
                                        : RfSpectrumView::None;
    nextSpectrumUiRefreshUs = 0;
    lastRuntimeEvent = cleanup ? "cc1101_spectrum_stopped"
                               : "cc1101_spectrum_cleanup_failed";
    return true;
}

bool stopCurrentSpectrum(bool returnToSourceMenu) {
    return rfSpectrumKind == RfSpectrumKind::Cc1101
        ? stopCc1101Spectrum(returnToSourceMenu)
        : stopNrf24Spectrum(returnToSourceMenu);
}

void serviceCc1101Spectrum() {
    if (rfSpectrumView != RfSpectrumView::Live ||
        rfSpectrumKind != RfSpectrumKind::Cc1101 ||
        cc1101SpectrumController.state() !=
            Cc1101SpectrumViewState::Running) {
        return;
    }
    Cc1101PassiveSample sample;
    const bool valid = boardCc1101Spectrum.sample(
        cc1101SpectrumController.plan(),
        cc1101SpectrumController.nextBin(), &sample) &&
        cc1101SpectrumController.ingest(sample);
    if (!valid) {
        boardCc1101Spectrum.end();
        cc1101SpectrumController.fail();
        lastRuntimeEvent = "cc1101_spectrum_runtime_fault";
        renderInteractiveScreen(true);
        return;
    }
    const std::uint64_t refreshUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (cc1101SpectrumController.nextBin() == 0 &&
        !uiController.isRoot() && uiController.page() == 2 &&
        spectrumViewport.mode() == SpectrumDisplayMode::Spectrum &&
        refreshUs >= nextSpectrumUiRefreshUs) {
        display.startWrite();
        renderSpectrumBars();
        display.endWrite();
        nextSpectrumUiRefreshUs = refreshUs + 100000ULL;
    }
}

void serviceCc1101Finder() {
    if (rfSpectrumView != RfSpectrumView::CcFinder ||
        rfSpectrumKind != RfSpectrumKind::Cc1101 ||
        (cc1101SignalFinder.state() !=
             Cc1101SignalFinderState::Calibrating &&
         cc1101SignalFinder.state() !=
             Cc1101SignalFinderState::Searching)) {
        return;
    }
    const std::uint32_t revision = cc1101SignalFinder.revision();
    const std::uint32_t frequency =
        cc1101SignalFinder.nextFrequencyKHz();
    std::int16_t rssiDbm = -128;
    std::uint64_t startedUs = 0;
    std::uint64_t endedUs = 0;
    const bool valid = boardCc1101Spectrum.sampleFrequency(
        frequency, &rssiDbm, &startedUs, &endedUs) &&
        cc1101SignalFinder.ingest(
            frequency, rssiDbm, startedUs, endedUs);
    if (!valid) {
        boardCc1101Spectrum.end();
        cc1101SignalFinder.fail();
        lastRuntimeEvent = "cc1101_finder_runtime_fault";
        renderInteractiveScreen(true);
        return;
    }
    if (cc1101SignalFinder.revision() != revision &&
        !uiController.isRoot() && uiController.page() == 2) {
        display.startWrite();
        renderCcFinderResult(false);
        renderCcFinderGraph(false);
        display.endWrite();
        lastRuntimeEvent = cc1101SignalFinder.found()
            ? "cc1101_finder_signal_found"
            : (cc1101SignalFinder.calibrated()
                   ? "cc1101_finder_waiting"
                   : "cc1101_finder_calibrating");
    }
}

bool startSubGhzRawCapture(
    leshy1::drivers::radio::Cc1101SpectrumBand band) {
    subGhzRawCapture.reset();
    subGhzCapturePersistState = CapturePersistState::Result;
    subGhzCapturePersistStatus = "volatile";
    subGhzCapturePersistGeneration = 0;
    subGhzCapturePersistHeapFreeBeforeMount = 0;
    subGhzCapturePersistHeapLargestBeforeMount = 0;
    subGhzCapturePersistFilesystemMountError = 0;
    cc1101SpectrumReport = {};
    SubGhzRawCapturePlan plan;
    plan.frequencyKHz = subGhzCaptureFrequencyKHz(band);
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0U) startedUs = 1U;
    const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
        AppRuntime::kForegroundOwner;
    const bool hardwareReady = boardCc1101Spectrum.begin(
        owned, &cc1101SpectrumReport) &&
        boardCc1101Spectrum.lockReceive(plan.frequencyKHz);
    const bool started = hardwareReady &&
        subGhzRawCapture.begin(plan, startedUs);
    if (!started) {
        boardCc1101Spectrum.end();
        if (subGhzRawCapture.stats().state ==
            SubGhzRawCaptureState::Waiting) {
            subGhzRawCapture.fail(-1, startedUs);
        }
    }
    rfCcBandSelection = band;
    rfSpectrumKind = RfSpectrumKind::Cc1101;
    rfSpectrumView = RfSpectrumView::SubGhzCaptureLive;
    nextSubGhzCaptureUiRefreshUs = startedUs;
    lastRuntimeEvent = started ? "subghz_raw_waiting"
                               : "subghz_raw_start_failed";
    return true;
}

bool stopSubGhzRawCapture(bool returnToModes) {
    const std::uint64_t nowUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    const auto state = subGhzRawCapture.stats().state;
    if (state == SubGhzRawCaptureState::Waiting ||
        state == SubGhzRawCaptureState::Capturing) {
        subGhzRawCapture.cancel(nowUs == 0U ? 1U : nowUs);
    }
    const bool cleanup = boardCc1101Spectrum.end();
    nextSubGhzCaptureUiRefreshUs = 0;
    rfSpectrumView = returnToModes ? RfSpectrumView::SubGhzMenu
                                   : RfSpectrumView::None;
    lastRuntimeEvent = cleanup ? "subghz_raw_stopped"
                               : "subghz_raw_cleanup_failed";
    return true;
}

