anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool loadSubGhzRawStoreTestFixture() {
    if (!hilSession.active() ||
        rfSpectrumView != RfSpectrumView::SubGhzCaptureLive ||
        resourceBroker.ownerOf(Resource::RadioSpi) !=
            AppRuntime::kForegroundOwner) {
        return false;
    }
    const bool receiverCleanup = boardCc1101Spectrum.end();
    subGhzRawCapture.reset();
    SubGhzRawCapturePlan plan;
    plan.frequencyKHz = 433920U;
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0U) startedUs = 1U;
    bool valid = receiverCleanup && subGhzRawCapture.begin(plan, startedUs);
    const auto ingest = [&](std::uint64_t offsetUs, std::int16_t rssiDbm) {
        return subGhzRawCapture.ingest({startedUs + offsetUs, rssiDbm});
    };
    if (valid) {
        ingest(100U, -100);
        ingest(200U, -100);
        ingest(1000U, -40);
        ingest(1100U, -40);
        ingest(2000U, -100);
        ingest(2100U, -100);
        ingest(3000U, -40);
        ingest(3100U, -40);
        ingest(4000U, -100);
        ingest(4100U, -100);
        subGhzRawCapture.service(startedUs + 25000U);
        valid = subGhzRawCapture.stats().state ==
                    SubGhzRawCaptureState::Complete &&
                subGhzRawCapture.pulseCount() == 3U;
    }
    subGhzCapturePersistState = CapturePersistState::Result;
    subGhzCapturePersistStatus = "volatile_test_fixture";
    subGhzCapturePersistGeneration = 0;
    nextSubGhzCaptureUiRefreshUs = 0;
    lastRuntimeEvent = valid ? "subghz_store_test_fixture_ready"
                             : "subghz_store_test_fixture_failed";
    if (valid) renderInteractiveScreen(true);
    return valid;
}

void emitSubGhzRawStoreTestFixture(Stream& reply) {
    const bool loaded = loadSubGhzRawStoreTestFixture();
    char line[640] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.subghz_store_fixture.v1\","
        "\"kind\":\"result\",\"status\":\"%s\","
        "\"software_fixture\":true,\"physical_signal\":false,"
        "\"rx_only_semantics\":true,\"frequency_khz\":433920,"
        "\"pulses\":%u,\"capture_state\":\"%s\","
        "\"receiver_cleanup_complete\":%s,"
        "\"application_tx_calls\":0,\"radio_tx_commands\":0,"
        "\"persist_state\":\"%s\",\"lease_mask\":%lu}",
        loaded ? "ready" : "rejected",
        static_cast<unsigned>(subGhzRawCapture.pulseCount()),
        leshy1::apps::capture::subGhzRawCaptureStateName(
            subGhzRawCapture.stats().state),
        cc1101SpectrumReport.cleanupComplete ? "true" : "false",
        capturePersistStateName(subGhzCapturePersistState),
        static_cast<unsigned long>(
            resourceBroker.ownedBy(AppRuntime::kForegroundOwner)));
    reply.println(line);
}

void serviceSubGhzRawCapture() {
    if (rfSpectrumView != RfSpectrumView::SubGhzCaptureLive) return;
    const auto state = subGhzRawCapture.stats().state;
    if (state != SubGhzRawCaptureState::Waiting &&
        state != SubGhzRawCaptureState::Capturing) {
        return;
    }
    std::int16_t rssiDbm = 0;
    std::uint64_t sampleUs = 0;
    if (!boardCc1101Spectrum.sampleRssi(&rssiDbm, &sampleUs)) {
        const std::uint64_t nowUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        subGhzRawCapture.fail(-2, nowUs == 0U ? 1U : nowUs);
        boardCc1101Spectrum.end();
        lastRuntimeEvent = "subghz_raw_runtime_fault";
        renderInteractiveScreen(true);
        return;
    }
    subGhzRawCapture.ingest({sampleUs, rssiDbm});
    subGhzRawCapture.service(sampleUs);
    const auto after = subGhzRawCapture.stats().state;
    const bool terminal = after != SubGhzRawCaptureState::Waiting &&
        after != SubGhzRawCaptureState::Capturing;
    if (terminal) {
        const bool cleanup = boardCc1101Spectrum.end();
        lastRuntimeEvent = !cleanup
            ? "subghz_raw_cleanup_failed"
            : after == SubGhzRawCaptureState::Complete
                  ? "subghz_raw_complete"
                  : after == SubGhzRawCaptureState::TimedOut
                        ? "subghz_raw_no_signal"
                        : after == SubGhzRawCaptureState::SignalTooLong
                              ? "subghz_raw_signal_too_long"
                              : "subghz_raw_terminal";
    }
    // Display transfers are deliberately suspended once the first edge starts
    // the capture.  A full TFT refresh is long enough to create false pulse
    // widths; measurement integrity takes precedence until the terminal gap.
    if (terminal ||
        (after == SubGhzRawCaptureState::Waiting &&
         sampleUs >= nextSubGhzCaptureUiRefreshUs)) {
        nextSubGhzCaptureUiRefreshUs = sampleUs + 200000ULL;
        renderInteractiveScreen(true);
    }
}

bool activeSpectrumRunning() {
    if (rfSpectrumView != RfSpectrumView::Live) return false;
    return rfSpectrumKind == RfSpectrumKind::Cc1101
        ? cc1101SpectrumController.state() ==
              Cc1101SpectrumViewState::Running
        : nrf24SpectrumController.state() ==
              Nrf24SpectrumViewState::Running;
}

bool activeReceiveSampling() {
    const auto rawState = subGhzRawCapture.stats().state;
    const auto irState = infraredCapture.stats().state;
    return activeSpectrumRunning() ||
        (rfSpectrumView == RfSpectrumView::Nrf24Finder &&
         nrf24SpectrumController.state() ==
             Nrf24SpectrumViewState::Running) ||
        (rfSpectrumView == RfSpectrumView::CcFinder &&
         (cc1101SignalFinder.state() ==
              Cc1101SignalFinderState::Calibrating ||
          cc1101SignalFinder.state() ==
              Cc1101SignalFinderState::Searching)) ||
        (rfSpectrumView == RfSpectrumView::SubGhzCaptureLive &&
         (rawState == SubGhzRawCaptureState::Waiting ||
          rawState == SubGhzRawCaptureState::Capturing)) ||
        (uiController.page() == 4 && captureView == CaptureView::Infrared &&
         (irState == InfraredCaptureState::Waiting ||
          irState == InfraredCaptureState::Capturing));
}

std::uint32_t activeSpectrumSweeps() {
    return rfSpectrumKind == RfSpectrumKind::Cc1101
        ? cc1101SpectrumController.sweeps()
        : nrf24SpectrumController.sweeps();
}

