anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
                      static_cast<unsigned>(
                          productSurveyRuntime.runtimeSourceFailureInjectedMask),
                      static_cast<unsigned>(
                          productSurveyRuntimeUnavailableInjectionMask()),
                      productSurveyRuntime.storeOpenAttempted ? "true" : "false",
                      static_cast<unsigned long long>(
                          productSurveyRuntime.storeBytesWritten),
                      productSurveyScanActive() ? "true" : "false",
                      productSurveyRuntime.cancelRequestedDuringScan
                          ? "true" : "false",
                      static_cast<unsigned long>(
                          productSurveyRuntime.scanCycles),
                      static_cast<unsigned long>(
                          productSurveyRuntime.wifiScanCycles),
                      static_cast<unsigned long>(
                          productSurveyRuntime.bleScanCycles),
                      static_cast<unsigned long long>(
                          productSurveyRuntime.startActionUs),
                      static_cast<unsigned long long>(
                          productSurveyRuntime.stopActionUs),
                      wifiProductViewName(wifiProductView),
                      static_cast<unsigned>(wifiProductSelection),
                      bleProductViewName(bleProductView),
                      static_cast<unsigned>(bleDeviceSelection),
                      static_cast<unsigned>(bleDeviceCatalog.size()),
                      bleDeviceCatalog.strongestFirst() ? "true" : "false",
                      static_cast<unsigned long>(bleDeviceCatalog.revision()),
                      static_cast<unsigned>(wifiNetworkSelection),
                      static_cast<unsigned>(wifiNetworkVisibleSize()),
                      wifiNetworkNavigationOrder.locked() ? "true" : "false",
                      static_cast<unsigned long>(
                          wifiNetworkNavigationOrder.orderHash(
                              wifiNetworkCatalog)),
                      static_cast<unsigned long>(
                          wifiNetworkNavigationOrder.identityHash(
                              wifiNetworkCatalog, wifiNetworkSelection)),
                      static_cast<unsigned>(wifiNetworkCatalog.size()),
                      wifiNetworkCatalog.strongestFirst() ? "true" : "false",
                      static_cast<unsigned long>(
                          wifiNetworkCatalog.revision()),
                      static_cast<unsigned>(wifiDeviceSelection),
                      static_cast<unsigned>(wifiDeviceVisibleSize()),
                      wifiDeviceNavigationOrder.locked() ? "true" : "false",
                      static_cast<unsigned long>(
                          wifiDeviceNavigationOrder.orderHash(
                              wifiDeviceCatalog)),
                      static_cast<unsigned>(wifiDeviceCatalog.size()),
                      wifiDeviceCatalog.strongestFirst() ? "true" : "false",
                      static_cast<unsigned long>(wifiDeviceCatalog.revision()),
                      wifiOuiDatabase.available() ? "true" : "false",
                      static_cast<unsigned>(wifiOuiDatabase.records()),
                      wifiDeviceDetail.locallyAdministered ? "true" : "false",
                      wifiDeviceDetail.ssidLength != 0U ? "true" : "false",
                      (wifiDeviceDetail.wpsDeviceNameLength != 0U ||
                       wifiDeviceDetail.wpsManufacturerLength != 0U ||
                       wifiDeviceDetail.wpsModelLength != 0U)
                          ? "true" : "false",
                      leshy1::apps::wifi::wifiDeviceGenerationName(
                          wifiDeviceDetail.generation),
                      static_cast<unsigned long long>(
                          wifiDeviceDetail.monotonicUs),
                      static_cast<int>(wifiDeviceDetail.rssiDbm),
                      wifiDeviceStats.active ? "true" : "false",
                      wifiFrameCapture.deviceChannelLocked() ? "true" : "false",
                      wifiDeviceStats.cleanupComplete ? "true" : "false",
                      wifiFrameCapture.nvsDisabled() ? "true" : "false",
                      wifiFrameCapture.volatileStorageOnly() ? "true" : "false",
                      static_cast<unsigned long>(wifiDeviceStats.framesReported),
                      static_cast<unsigned long>(wifiDeviceStats.clientsAccepted),
                      static_cast<unsigned long>(wifiDeviceStats.clientsDropped),
                      static_cast<unsigned long>(wifiDeviceStats.channelHops),
                      static_cast<unsigned>(wifiFrameCapture.currentChannel()),
                      wifiChannelStats.active ? "true" : "false",
                      wifiChannelStats.cleanupComplete ? "true" : "false",
                      static_cast<unsigned long>(
                          wifiChannelStats.framesReported),
                      static_cast<unsigned long>(
                          wifiChannelStats.invalidFrames),
                      static_cast<unsigned long>(wifiChannelStats.channelHops),
                      static_cast<unsigned>(wifiFrameCapture.currentChannel()),
                      static_cast<unsigned long>(wifiChannelSnapshot.revision),
                      static_cast<unsigned long>(
                          wifiChannelSnapshot.completedDwells),
                      static_cast<unsigned long>(
                          wifiChannelSnapshot.completedSweeps),
                      static_cast<unsigned>(wifiChannelSnapshot.measuredMask),
                      static_cast<unsigned>(
                          wifiFrameCapture.bestPrimaryChannel()),
                      selectedLibrary != nullptr && selectedLibrary->simulated
                          ? "true" : "false",
                      libraryController.view() == LibraryView::ExportReady
                          ? "export_ready"
                          : (libraryController.view() == LibraryView::SessionDetail
                                 ? "detail"
                                 : "list"),
                      static_cast<unsigned>(libraryController.size()),
                      static_cast<unsigned long>(selectedLibrary == nullptr
                                                     ? 0
                                                     : selectedLibrary->generation),
                      selectedLibrary != nullptr && selectedLibrary->persistent
                          ? "true" : "false",
                      leshy1::apps::self_test::selfTestViewName(
                          selfTestController.view()),
                      selfTestController.view() == SelfTestView::VisualCheck
                          ? leshy1::apps::self_test::selfTestVisualStateName(
                                selfTestController.visualState())
                          : "none",
                      leshy1::apps::self_test::selfTestModeName(
                          visibleSelfTestMode),
                      leshy1::apps::self_test::selfTestResultStatusName(
                          selfTestReport.status),
                      static_cast<unsigned>(selfTestReport.checkCount),
                      static_cast<unsigned>(selfTestReport.passed),
                      static_cast<unsigned>(selfTestReport.failed),
                      static_cast<unsigned>(selfTestReport.blocked),
                      static_cast<unsigned>(selfTestReport.notApplicable),
                      selfTestReport.readOnly ? "true" : "false",
                      fullGuidedRfStepName(fullGuidedRfState.step),
                      static_cast<unsigned>(fullGuidedRfState.cc1101Bins),
                      fullGuidedArtifactStepName(
                          fullGuidedArtifactState.step),
                      fullGuidedArtifactState.recoveryComplete
                          ? "true" : "false",
                      fullGuidedArtifactState.libraryComplete
                          ? "true" : "false",
                      fullGuidedArtifactState.captureComplete
                          ? "true" : "false",
                      static_cast<unsigned>(
                          fullGuidedArtifactState.pcapFrames));
        if (detailLength < 0 ||
            static_cast<std::size_t>(detailLength) >= detailCapacity) {
            std::snprintf(
                line, sizeof(line),
                "{\"schema\":\"leshy.ui.v1\",\"kind\":\"error\","
                "\"error\":\"state_overflow\"}");
        }
    }
    reply.println(line);
}

void emitWifiFrameCaptureState(Stream& reply) {
    const auto stats = wifiFrameCapture.stats();
    const auto& plan = wifiFrameCapture.capture().plan();
    const std::size_t pcapBytes =
        leshy1::apps::capture::radiotapPcapSize(wifiFrameCapture.capture());
    char line[1024] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.wifi_frame.v1\",\"kind\":\"state\","
        "\"state\":\"%s\",\"passive_only\":true,\"rx_only\":true,"
        "\"application_connect_calls\":0,\"application_raw_tx_calls\":0,"
        "\"physical_no_tx_verified\":false,\"storage_written\":%s,"
        "\"volatile_ram\":true,\"immutable_after_stop\":true,"
        "\"persist_state\":\"%s\",\"persist_status\":\"%s\","
        "\"persist_generation\":%lu,"
        "\"heap_free_before_mount\":%lu,"
        "\"heap_largest_before_mount\":%lu,"
        "\"filesystem_mount_error\":%d,"
        "\"channel_plan\":%u,\"current_channel\":%u,"
        "\"duration_ms\":%lu,\"channel_dwell_ms\":%u,"
        "\"snap_length\":%u,\"maximum_frames\":%u,"
        "\"started_us\":%llu,\"ended_us\":%llu,"
        "\"frames_reported\":%lu,\"frames_accepted\":%lu,"
        "\"frames_dropped_capacity\":%lu,"
        "\"frames_dropped_invalid\":%lu,\"payload_bytes\":%lu,"
        "\"driver_error\":%ld,\"pcap_available\":%s,"
        "\"pcap_bytes\":%u,\"pcap_linktype\":127,"
        "\"pcap_timebase\":\"monotonic_us\","
        "\"cleanup_complete\":%s,\"lease_mask\":%lu}",
        leshy1::apps::capture::wifiFrameCaptureStateName(stats.state),
        capturePersistState == CapturePersistState::Saved ? "true" : "false",
        capturePersistStateName(capturePersistState), capturePersistStatus,
        static_cast<unsigned long>(capturePersistGeneration),
        static_cast<unsigned long>(capturePersistHeapFreeBeforeMount),
        static_cast<unsigned long>(capturePersistHeapLargestBeforeMount),
        capturePersistFilesystemMountError,
        static_cast<unsigned>(plan.channel),
        static_cast<unsigned>(wifiFrameCapture.currentChannel()),
        static_cast<unsigned long>(plan.durationMs),
        static_cast<unsigned>(plan.channelDwellMs),
        static_cast<unsigned>(plan.snapLength),
        static_cast<unsigned>(plan.maximumFrames),
        static_cast<unsigned long long>(stats.startedUs),
        static_cast<unsigned long long>(stats.endedUs),
        static_cast<unsigned long>(stats.framesReported),
        static_cast<unsigned long>(stats.framesAccepted),
        static_cast<unsigned long>(stats.framesDroppedCapacity),
        static_cast<unsigned long>(stats.framesDroppedInvalid),
        static_cast<unsigned long>(stats.payloadBytes),
        static_cast<long>(stats.driverError),
        pcapBytes == 0U ? "false" : "true",
        static_cast<unsigned>(pcapBytes),
        wifiFrameCapture.cleanupComplete() ? "true" : "false",
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

struct StreamPcapSink final {
    Stream* stream = nullptr;
};

