anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool closeWifiCaptureProduct() {
    const auto state = wifiFrameCapture.stats().state;
    bool cleanup = true;
    if (state == WifiFrameCaptureState::Running) {
        cleanup = stopWifiFrameCapture();
    }
    wifiFrameCapture.reset();
    capturePersistState = CapturePersistState::Result;
    capturePersistStatus = "volatile";
    capturePersistGeneration = 0;
    capturePersistHeapFreeBeforeMount = 0;
    capturePersistHeapLargestBeforeMount = 0;
    capturePersistFilesystemMountError = 0;
    wifiCaptureRenderedFrames = UINT32_MAX;
    wifiCaptureRenderedDrops = UINT32_MAX;
    wifiCaptureRenderedChannel = 0xffU;
    nextCaptureUiRefreshUs = 0;
    wifiProductView = WifiProductView::Menu;
    wifiProductSelection = 3;
    lastRuntimeEvent = cleanup ? "wifi_menu" : "wifi_capture_cleanup_failed";
    return true;
}

bool selectionCanRepaintInPlace(UiAction action) {
    if (action != UiAction::Up && action != UiAction::Down) return false;
    if (uiController.isRoot()) return true;
    if (uiController.page() == 2) {
        if (bleProductView == BleProductView::Devices) return true;
        if (wifiProductView == WifiProductView::Menu) return true;
        if (wifiProductView == WifiProductView::Networks &&
            surveyWorkflow.state() == SurveyWorkflowState::Running) {
            return true;
        }
        if (wifiProductView == WifiProductView::Devices) return true;
        if (rfSpectrumView == RfSpectrumView::Live) return false;
        if (rfSpectrumView == RfSpectrumView::SourceMenu ||
            rfSpectrumView == RfSpectrumView::Nrf24Menu ||
            rfSpectrumView == RfSpectrumView::SubGhzMenu ||
            rfSpectrumView == RfSpectrumView::CcBandMenu ||
            rfSpectrumView == RfSpectrumView::SubGhzCaptureBandMenu) return true;
        return surveyWorkflow.state() == SurveyWorkflowState::Setup ||
               (surveyWorkflow.state() == SurveyWorkflowState::Running &&
                (surveyController.view() == SurveyView::List ||
                 surveyController.view() == SurveyView::Filter));
    }
    if (uiController.page() == 3) {
        return libraryController.view() == LibraryView::SessionList;
    }
    if (uiController.page() == 4) {
        return captureView == CaptureView::SourceMenu;
    }
    if (uiController.page() == 5) return true;
    if (uiController.page() == kDevicePage) return true;
    return uiController.page() == 6 &&
           selfTestController.view() == SelfTestView::ModeMenu;
}

bool applyUiAction(UiAction action, bool render = true) {
    const bool incrementalCandidate = selectionCanRepaintInPlace(action);
    lastUiActionUsedIncrementalRender = false;
    const auto finish = [&](bool changed) {
        lastUiActionUsedIncrementalRender = changed && incrementalCandidate;
        if (changed && render) {
            renderInteractiveScreen(!lastUiActionUsedIncrementalRender);
        }
        return changed;
    };
    if (safetySupervisor.latched()) {
        bool changed = false;
        if (action == UiAction::Select || action == UiAction::Right) {
            if (safetySupervisor.clearPending()) {
                clearSafetyStopAndRestart();
            }
            changed = safetySupervisor.requestClear();
        } else if ((action == UiAction::Back || action == UiAction::Left) &&
                   safetySupervisor.clearPending()) {
            changed = safetySupervisor.cancelClear();
        }
        if (action != UiAction::Unknown) {
            uiController.recordHandledAction(action);
        }
        return finish(changed);
    }
    const AppMenuItem* selected = appCatalog.get(uiController.selection());
    const bool wasRoot = uiController.isRoot();
    if (!wasRoot && uiController.page() == 2) {
        bool handled = false;
        bool changed = false;
        if (bleProductView == BleProductView::DeviceDetail) {
            handled = true;
            if (action == UiAction::Back || action == UiAction::Left) {
                bleProductView = BleProductView::Devices;
                lastRuntimeEvent = "ble_devices";
                changed = true;
            }
        } else if (bleProductView == BleProductView::Devices) {
            handled = true;
            if (action == UiAction::Up || action == UiAction::Down ||
                action == UiAction::Select || action == UiAction::Right) {
                bleDeviceNavigationOrder.lock(bleDeviceCatalog);
            }
            if (action == UiAction::Up && bleDeviceSelection > 0U) {
                --bleDeviceSelection;
                changed = true;
            } else if (action == UiAction::Down &&
                       bleDeviceSelection + 1U < bleDeviceVisibleSize()) {
                ++bleDeviceSelection;
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                const Observation* device = bleDeviceAt(bleDeviceSelection);
                if (device != nullptr) {
                    bleDeviceDetail = *device;
                    const std::size_t catalogIndex =
                        bleDeviceCatalog.indexOfIdentity(*device);
                    const BleDeviceSignalStats* signal =
                        bleDeviceCatalog.signalAt(catalogIndex);
                    bleDeviceDetailSignal = signal == nullptr
                        ? BleDeviceSignalStats{} : *signal;
                    bleDeviceRenderedDetail = {};
                    bleProductView = BleProductView::DeviceDetail;
                    lastRuntimeEvent = "ble_device_detail";
                    changed = true;
                }
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                const auto control = productSurveyControl();
                if (control == ProductSurveyWorkerControl::Starting ||
                    control == ProductSurveyWorkerControl::Running) {
                    changed = requestProductSurveyWorkerStop(true);
                } else {
                    bleProductView = BleProductView::None;
                    surveyPipeline.resetToSetup();
                    changed = uiController.apply(
                        action,
                        static_cast<std::uint8_t>(appCatalog.size()),
                        true, 2);
                    if (changed) appRuntime.stop();
                    lastRuntimeEvent = "ble_home";
                }
            }
        } else if (wifiProductView == WifiProductView::Menu) {
            if (action == UiAction::Up && wifiProductSelection > 0) {
                handled = true;
                --wifiProductSelection;
                changed = true;
            } else if (action == UiAction::Down &&
                       wifiProductSelection + 1U < kWifiProductTaskCount) {
                handled = true;
                ++wifiProductSelection;
                changed = true;
            } else if ((action == UiAction::Select ||
                        action == UiAction::Right) &&
                       wifiProductTaskReady(wifiProductSelection)) {
                handled = true;
                if (wifiProductSelection == 0) {
                    changed = startWifiNetworksProduct();
                } else if (wifiProductSelection == 1) {
                    changed = startWifiDevicesProduct();
                } else if (wifiProductSelection == 2) {
                    changed = startWifiChannelsProduct();
                } else if (wifiProductSelection == 3) {
                    changed = openWifiCaptureProduct();
                }
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                handled = true;
                lastRuntimeEvent = "wifi_task_not_ready";
            } else if (action == UiAction::Back || action == UiAction::Left) {
                handled = true;
                wifiProductView = WifiProductView::None;
                changed = uiController.apply(
                    action, static_cast<std::uint8_t>(appCatalog.size()),
                    true, 2);
                if (changed) appRuntime.stop();
                lastRuntimeEvent = "wifi_home";
            }
        } else if (rfSpectrumView == RfSpectrumView::SourceMenu) {
            handled = true;
            if (action == UiAction::Up && rfSpectrumSelection != 0) {
                rfSpectrumSelection = 0;
                changed = true;
            } else if (action == UiAction::Down && rfSpectrumSelection != 1) {
                rfSpectrumSelection = 1;
                changed = true;
            } else if ((action == UiAction::Select ||
                        action == UiAction::Right) &&
                       rfSpectrumSelection == 0) {
                changed = startNrf24Spectrum();
            } else if ((action == UiAction::Select ||
                        action == UiAction::Right) &&
                       rfSpectrumSelection == 1) {
                rfCcBandSelection =
                    leshy1::drivers::radio::Cc1101SpectrumBand::Band433;
                rfSpectrumView = RfSpectrumView::CcBandMenu;
                lastRuntimeEvent = "cc1101_spectrum_band_menu";
                changed = true;
            } else if (action == UiAction::Back || action == UiAction::Left) {
                rfSpectrumView = RfSpectrumView::None;
                lastRuntimeEvent = "survey_spectrum_plan";
                changed = true;
            }
        } else if (rfSpectrumView == RfSpectrumView::Nrf24Menu) {
            handled = true;
            if (action == UiAction::Up && nrf24ModeSelection != 0U) {
                nrf24ModeSelection = 0U;
                changed = true;
            } else if (action == UiAction::Down &&
                       nrf24ModeSelection != 1U) {
                nrf24ModeSelection = 1U;
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                changed = nrf24ModeSelection == 0U
                    ? startNrf24Spectrum() : startNrf24Finder();
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                rfSpectrumView = RfSpectrumView::None;
                changed = uiController.apply(
                    action, static_cast<std::uint8_t>(appCatalog.size()),
                    true, 2);
                if (changed) appRuntime.stop();
                lastRuntimeEvent = "nrf24_home";
            }
        } else if (rfSpectrumView == RfSpectrumView::Nrf24Finder) {
            handled = true;
            if (action == UiAction::Back || action == UiAction::Left) {
                changed = stopNrf24Spectrum(false);
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                std::uint64_t nowUs =
                    static_cast<std::uint64_t>(esp_timer_get_time());
                if (nowUs == 0U) nowUs = 1U;
                changed = nrf24SignalFinder.restart(nowUs);
                if (changed) {
                    nrf24FinderRenderedRevision = UINT32_MAX;
                    nrf24FinderRenderedState = Nrf24SignalFinderState::Idle;
                    nrf24FinderRenderedChannel = 0xffU;
                    nrf24FinderRenderedFound = false;
                    nrf24FinderRenderedHeights.fill(0);
                    lastRuntimeEvent = "nrf24_finder_calibrating";
                }
            }
        } else if (rfSpectrumView == RfSpectrumView::SubGhzMenu) {
            handled = true;
            if (action == UiAction::Up && subGhzModeSelection != 0U) {
                --subGhzModeSelection;
                changed = true;
            } else if (action == UiAction::Down &&
                       subGhzModeSelection != 2U) {
                ++subGhzModeSelection;
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                rfCcBandSelection =
                    leshy1::drivers::radio::Cc1101SpectrumBand::Band433;
                if (subGhzModeSelection == 0U) {
                    rfSpectrumView = RfSpectrumView::CcBandMenu;
                    lastRuntimeEvent = "cc1101_spectrum_band_menu";
                    changed = true;
                } else if (subGhzModeSelection == 1U) {
                    changed = startCc1101Finder();
                } else {
                    rfSpectrumView = RfSpectrumView::SubGhzCaptureBandMenu;
                    lastRuntimeEvent = "subghz_raw_band_menu";
                    changed = true;
                }
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                rfSpectrumView = RfSpectrumView::None;
                changed = uiController.apply(
                    action, static_cast<std::uint8_t>(appCatalog.size()),
                    true, 2);
                if (changed) appRuntime.stop();
                lastRuntimeEvent = "subghz_home";
            }
        } else if (rfSpectrumView == RfSpectrumView::CcFinder) {
            handled = true;
            if (action == UiAction::Back || action == UiAction::Left) {
                changed = stopCc1101Finder();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                std::uint64_t nowUs =
                    static_cast<std::uint64_t>(esp_timer_get_time());
                if (nowUs == 0U) nowUs = 1U;
                changed = cc1101SignalFinder.restart(nowUs);
                if (changed) {
                    ccFinderRenderedRevision = UINT32_MAX;
                    ccFinderRenderedState = Cc1101SignalFinderState::Idle;
                    ccFinderRenderedFrequencyKHz = UINT32_MAX;
                    ccFinderRenderedFound = false;
                    ccFinderRenderedHeights.fill(0);
                    lastRuntimeEvent = "cc1101_finder_calibrating";
                }
            }
        } else if (rfSpectrumView ==
                   RfSpectrumView::SubGhzCaptureBandMenu) {
            handled = true;
            std::uint8_t selection = ccBandSelectionIndex();
            if (action == UiAction::Up && selection != 0) {
                --selection;
                rfCcBandSelection = ccBandFromIndex(selection);
                changed = true;
            } else if (action == UiAction::Down && selection != 3) {
                ++selection;
                rfCcBandSelection = ccBandFromIndex(selection);
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                changed = startSubGhzRawCapture(rfCcBandSelection);
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                rfSpectrumView = RfSpectrumView::SubGhzMenu;
                lastRuntimeEvent = "subghz_modes";
                changed = true;
            }
        } else if (rfSpectrumView == RfSpectrumView::SubGhzCaptureLive) {
            handled = true;
            if (subGhzRawCapture.stats().state ==
                    SubGhzRawCaptureState::Complete &&
                subGhzCapturePersistState == CapturePersistState::Result &&
                (action == UiAction::Select || action == UiAction::Right)) {
                changed = requestSubGhzRawCapturePersist();
            } else if (subGhzCapturePersistState ==
                           CapturePersistState::Saving) {
                changed = false;
            } else if (subGhzRawCapture.stats().state !=
                           SubGhzRawCaptureState::Waiting &&
                       subGhzRawCapture.stats().state !=
                           SubGhzRawCaptureState::Capturing &&
                       (action == UiAction::Select ||
                        action == UiAction::Right)) {
                changed = startSubGhzRawCapture(rfCcBandSelection);
            } else if (action == UiAction::Back || action == UiAction::Left) {
                changed = stopSubGhzRawCapture(true);
                subGhzRawCapture.reset();
                subGhzCapturePersistState = CapturePersistState::Result;
                subGhzCapturePersistStatus = "volatile";
                subGhzCapturePersistGeneration = 0;
            }
        } else if (rfSpectrumView == RfSpectrumView::CcBandMenu) {
            handled = true;
            std::uint8_t selection = ccBandSelectionIndex();
            if (action == UiAction::Up && selection != 0) {
                --selection;
                rfCcBandSelection = ccBandFromIndex(selection);
                changed = true;
            } else if (action == UiAction::Down && selection != 3) {
                ++selection;
                rfCcBandSelection = ccBandFromIndex(selection);
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                changed = startCc1101Spectrum(rfCcBandSelection);
            } else if (action == UiAction::Back || action == UiAction::Left) {
                const bool direct = std::strcmp(appRuntime.activeApp(),
                                                "subghz") == 0;
                if (direct) {
                    rfSpectrumView = RfSpectrumView::SubGhzMenu;
                    lastRuntimeEvent = "subghz_modes";
                    changed = true;
                } else {
                    rfSpectrumView = RfSpectrumView::SourceMenu;
                    lastRuntimeEvent = "spectrum_source_menu";
                    changed = true;
                }
            }
        } else if (rfSpectrumView == RfSpectrumView::Live) {
            handled = true;
            if (action == UiAction::Back || action == UiAction::Left) {
                const bool directNrf =
                    rfSpectrumKind == RfSpectrumKind::Nrf24 &&
                    std::strcmp(appRuntime.activeApp(), "spectrum24") == 0;
                changed = stopCurrentSpectrum(!directNrf);
            } else if (action == UiAction::Up || action == UiAction::Down) {
                const bool fault = rfSpectrumKind == RfSpectrumKind::Cc1101
                    ? cc1101SpectrumController.state() ==
                          Cc1101SpectrumViewState::Fault
                    : nrf24SpectrumController.state() ==
                          Nrf24SpectrumViewState::Fault;
                changed = !fault &&
                    (action == UiAction::Up
                         ? spectrumViewport.previousMode()
                         : spectrumViewport.nextMode());
                if (changed) {
                    if (spectrumViewport.mode() ==
                        SpectrumDisplayMode::Waterfall) {
                        const std::size_t bins = activeSpectrumBins();
                        spectrumViewport.reset(bins);
                        spectrumViewport.setMode(
                            SpectrumDisplayMode::Waterfall);
                        resetSpectrumWaterfallTiming();
                        armSpectrumWaterfallForCurrentReceiver();
                    }
                    nextSpectrumUiRefreshUs = 0;
                    lastRuntimeEvent = spectrumViewport.mode() ==
                        SpectrumDisplayMode::Waterfall
                            ? "spectrum_waterfall_view"
                            : "spectrum_bar_view";
                }
            } else if (rfSpectrumKind == RfSpectrumKind::Cc1101) {
                if ((action == UiAction::Select ||
                     action == UiAction::Right) &&
                    cc1101SpectrumController.togglePause()) {
                    changed = true;
                    if (cc1101SpectrumController.state() ==
                        Cc1101SpectrumViewState::Paused) {
                        if (!boardCc1101Spectrum.idle()) {
                            boardCc1101Spectrum.end();
                            cc1101SpectrumController.fail();
                            lastRuntimeEvent =
                                "cc1101_spectrum_pause_failed";
                        } else {
                            lastRuntimeEvent = "cc1101_spectrum_paused";
                        }
                    } else {
                        lastRuntimeEvent = "cc1101_spectrum_running";
                    }
                }
            } else if ((action == UiAction::Select ||
                        action == UiAction::Right) &&
                       nrf24SpectrumController.toggleMetric()) {
                const SpectrumDisplayMode displayMode =
                    spectrumViewport.mode();
                changed = spectrumViewport.reset(
                    Nrf24SpectrumController::kChannelCount);
                if (changed && displayMode ==
                        SpectrumDisplayMode::Waterfall) {
                    changed = spectrumViewport.nextMode();
                }
                resetSpectrumWaterfallTiming();
                armSpectrumWaterfallForCurrentReceiver();
                nextSpectrumUiRefreshUs = 0;
                lastRuntimeEvent = nrf24SpectrumController.metric() ==
                    Nrf24SpectrumMetric::Traffic
                        ? "nrf24_spectrum_traffic"
                        : "nrf24_spectrum_signal";
            }
        } else if (wifiProductView == WifiProductView::Networks &&
                   surveyWorkflow.state() != SurveyWorkflowState::Running &&
                   productSurveyControl() == ProductSurveyWorkerControl::Idle &&
                   (action == UiAction::Back || action == UiAction::Left)) {
            handled = true;
            closeProductSurveyBackend();
            surveyPipeline.resetToSetup();
            wifiProductView = WifiProductView::Menu;
            wifiProductSelection = 0;
            lastRuntimeEvent = "wifi_menu";
            changed = true;
        } else if (wifiProductView == WifiProductView::NetworkDetail) {
            handled = true;
            if (action == UiAction::Back || action == UiAction::Left) {
                wifiProductView = WifiProductView::Networks;
                lastRuntimeEvent = "wifi_networks";
                changed = true;
            }
        } else if (wifiProductView == WifiProductView::DeviceDetail) {
            handled = true;
            if (action == UiAction::Back || action == UiAction::Left) {
                std::uint64_t nowUs =
                    static_cast<std::uint64_t>(esp_timer_get_time());
                if (nowUs == 0U) nowUs = 1U;
                wifiFrameCapture.unlockDeviceChannel(nowUs);
                wifiProductView = WifiProductView::Devices;
                lastRuntimeEvent = "wifi_devices";
                changed = true;
            }
        } else if (wifiProductView == WifiProductView::Devices) {
            handled = true;
            if (action == UiAction::Up || action == UiAction::Down ||
                action == UiAction::Select || action == UiAction::Right) {
                wifiDeviceNavigationOrder.lock(wifiDeviceCatalog);
            }
            if (action == UiAction::Up && wifiDeviceSelection > 0U) {
                --wifiDeviceSelection;
                changed = true;
            } else if (action == UiAction::Down &&
                       wifiDeviceSelection + 1U < wifiDeviceVisibleSize()) {
                ++wifiDeviceSelection;
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                const WifiDeviceRecord* device =
                    wifiDeviceAt(wifiDeviceSelection);
                if (device != nullptr) {
                    wifiDeviceDetail = *device;
                    std::uint64_t nowUs =
                        static_cast<std::uint64_t>(esp_timer_get_time());
