anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
                    if (nowUs == 0U) nowUs = 1U;
                    const bool locked = wifiFrameCapture.lockDeviceChannel(
                        wifiDeviceDetail.channel, nowUs);
                    wifiProductView = WifiProductView::DeviceDetail;
                    nextWifiDeviceUiRefreshUs = nowUs;
                    lastRuntimeEvent = locked
                        ? "wifi_device_detail_live"
                        : "wifi_device_detail_live_unavailable";
                    changed = true;
                }
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                changed = stopWifiDevicesProduct();
            }
        } else if (wifiProductView == WifiProductView::Channels) {
            handled = true;
            if (action == UiAction::Back || action == UiAction::Left) {
                changed = stopWifiChannelsProduct();
            }
        } else if (wifiProductView == WifiProductView::Capture) {
            handled = true;
            const auto state = wifiFrameCapture.stats().state;
            if (state == WifiFrameCaptureState::Idle &&
                (action == UiAction::Select || action == UiAction::Right)) {
                changed = startWifiFrameCapture();
            } else if (state == WifiFrameCaptureState::Running &&
                       (action == UiAction::Select ||
                        action == UiAction::Right)) {
                changed = stopWifiFrameCapture();
            } else if (state == WifiFrameCaptureState::Complete &&
                       capturePersistState == CapturePersistState::Result &&
                       (action == UiAction::Select ||
                        action == UiAction::Right)) {
                capturePersistState = CapturePersistState::Confirm;
                capturePersistStatus = "awaiting_confirmation";
                lastRuntimeEvent = "capture_store_confirm";
                changed = true;
            } else if (state == WifiFrameCaptureState::Complete &&
                       capturePersistState == CapturePersistState::Confirm &&
                       (action == UiAction::Select ||
                        action == UiAction::Right)) {
                changed = requestWifiFrameCapturePersist();
            } else if (state == WifiFrameCaptureState::Complete &&
                       capturePersistState == CapturePersistState::Confirm &&
                       (action == UiAction::Back ||
                        action == UiAction::Left)) {
                capturePersistState = CapturePersistState::Result;
                capturePersistStatus = "volatile";
                lastRuntimeEvent = "capture_store_cancelled";
                changed = true;
            } else if (capturePersistState == CapturePersistState::Saving) {
                changed = false;
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                changed = closeWifiCaptureProduct();
            }
        } else if (wifiProductView == WifiProductView::Networks &&
                   surveyWorkflow.state() == SurveyWorkflowState::Running) {
            handled = true;
            if (action == UiAction::Up || action == UiAction::Down ||
                action == UiAction::Select || action == UiAction::Right) {
                wifiNetworkNavigationOrder.lock(wifiNetworkCatalog);
            }
            if (action == UiAction::Up && wifiNetworkSelection > 0) {
                --wifiNetworkSelection;
                changed = true;
            } else if (action == UiAction::Down &&
                       wifiNetworkSelection + 1U <
                           wifiNetworkVisibleSize()) {
                ++wifiNetworkSelection;
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                const Observation* observation = wifiNetworkAt(
                    wifiNetworkSelection);
                if (observation != nullptr) {
                    wifiNetworkDetail = *observation;
                    const std::size_t catalogIndex =
                        wifiNetworkCatalog.indexOfIdentity(*observation);
                    const WifiNetworkSignalStats* signal =
                        wifiNetworkCatalog.signalAt(catalogIndex);
                    wifiNetworkDetailSignal = signal == nullptr
                        ? WifiNetworkSignalStats{
                            1U, observation->rssiDbm,
                            observation->rssiDbm, 0}
                        : *signal;
                    wifiProductView = WifiProductView::NetworkDetail;
                    lastRuntimeEvent = "wifi_network_detail";
                    changed = true;
                }
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                changed = requestProductSurveyWorkerStop(true);
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
            productSurveySourceUnavailableVisible() &&
            (action == UiAction::Select || action == UiAction::Right ||
             action == UiAction::Up || action == UiAction::Down)) {
            handled = true;
            lastRuntimeEvent = "source_unavailable_waiting_back";
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
                   surveySourceController.view() ==
                       SurveySetupView::Sources) {
            if (action == UiAction::Up) {
                handled = true;
                changed = surveySourceController.previous();
            } else if (action == UiAction::Down) {
                handled = true;
                changed = surveySourceController.next();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                handled = true;
                const SurveySetupActivation activation =
                    surveySourceController.activate();
                changed = activation ==
                    SurveySetupActivation::SourceChanged;
                lastRuntimeEvent = leshy1::apps::survey::
                    surveySetupActivationName(activation);
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                handled = true;
                changed = surveySourceController.back();
                if (changed) lastRuntimeEvent = "survey_source_plan";
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
                   (action == UiAction::Up || action == UiAction::Down)) {
            handled = true;
            changed = action == UiAction::Up
                ? surveySourceController.previous()
                : surveySourceController.next();
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
                   (action == UiAction::Select ||
                    action == UiAction::Right)) {
            handled = true;
            const SurveySetupActivation activation =
                surveySourceController.activate();
            lastRuntimeEvent = leshy1::apps::survey::
                surveySetupActivationName(activation);
            if (activation == SurveySetupActivation::OpenedSources) {
                changed = true;
            } else if (activation ==
                       SurveySetupActivation::OpenedSpectrum) {
                const bool available = BoardProfile::kRfShieldDeclared &&
                    !BoardProfile::kGpsDeclared &&
                    !BoardProfile::kPn532Declared;
                if (available) {
                    rfSpectrumView = RfSpectrumView::SourceMenu;
                    rfSpectrumSelection = 0;
                    changed = true;
                }
            } else if (activation ==
                       SurveySetupActivation::StartRequested) {
                if (productSurveyRuntime.selected) {
                    if (productSurveyControl() ==
                        ProductSurveyWorkerControl::Idle) {
                        changed = startProductSurvey();
                    }
                } else {
                    std::uint64_t startedUs =
                        static_cast<std::uint64_t>(esp_timer_get_time());
                    if (startedUs == 0) startedUs = 1;
                    const SurveyPipelineStatus started = surveyPipeline.start(
                        "product-wifi-preview", startedUs);
                    changed = started == SurveyPipelineStatus::Started &&
                              publishGoldenObservations(surveyPipeline);
                    lastRuntimeEvent =
                        leshy1::apps::survey::surveyPipelineStatusName(
                            changed ? surveyPipeline.lastStatus() : started);
                }
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
                   (action == UiAction::Back || action == UiAction::Left)) {
            if (productSurveyRuntime.selected &&
                productSurveyControl() != ProductSurveyWorkerControl::Idle) {
                handled = true;
                changed = requestProductSurveyWorkerStop(true);
            } else {
                surveyPipeline.cancel();
                if (productSurveyRuntime.selected) {
                    const bool cleanup = closeProductSurveyBackend();
                    productSurveyRuntime.status = cleanup ? "cancelled"
                                                           : "cleanup_failed";
                }
                lastRuntimeEvent =
                    leshy1::apps::survey::surveyPipelineStatusName(
                        surveyPipeline.lastStatus());
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Running &&
                   surveyController.view() == SurveyView::Filter) {
            handled = true;
            if (action == UiAction::Up) {
                changed = surveyController.previous();
            } else if (action == UiAction::Down) {
                changed = surveyController.next();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                changed = surveyController.activateFilter();
                if (changed) lastRuntimeEvent = "survey_filter_applied";
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                changed = surveyController.back();
                if (changed) lastRuntimeEvent = "survey_filter_cancelled";
            } else {
                handled = false;
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Running &&
                   surveyController.view() == SurveyView::Detail) {
            if (action == UiAction::Back || action == UiAction::Left) {
                handled = true;
                changed = surveyController.back();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                handled = true;
                if (productSurveyRuntime.selected) {
                    changed =
                        productSurveyControl() ==
                                ProductSurveyWorkerControl::Paused
                            ? commitPausedProductSurvey()
                            : requestProductSurveyWorkerStop(false);
                } else {
                    const SurveyPipelineStatus status =
                        surveyPipeline.stopAndCommit(
                            static_cast<std::uint64_t>(esp_timer_get_time()));
                    changed = status == SurveyPipelineStatus::Committed;
                    lastRuntimeEvent =
                        leshy1::apps::survey::surveyPipelineStatusName(status);
                }
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Running &&
                   surveyController.view() == SurveyView::List) {
            if (action == UiAction::Up) {
                handled = true;
                changed = surveyController.previous();
                if (changed && surveyController.filterFocused() &&
                    productSurveyRuntime.selected &&
                    productSurveyControl() ==
                        ProductSurveyWorkerControl::Running) {
                    changed = requestProductSurveyWorkerPause() || changed;
                }
            } else if (action == UiAction::Down) {
                handled = true;
                changed = surveyController.next();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                handled = true;
                changed = surveyController.openSelected();
            } else if ((action == UiAction::Back || action == UiAction::Left) &&
                       surveyWorkflow.state() == SurveyWorkflowState::Running) {
                if (productSurveyRuntime.selected) {
                    handled = true;
                    if (productSurveyControl() ==
                        ProductSurveyWorkerControl::Paused) {
                        releaseProductSurveyAfterTerminal("cancelled", true);
                        changed = true;
                    } else {
                        changed = requestProductSurveyWorkerStop(true);
                    }
                } else {
                    surveyPipeline.cancel();
                    lastRuntimeEvent = "survey_cancelled";
                }
            }
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == 3) {
        bool handled = false;
        bool changed = false;
        if (libraryController.view() == LibraryView::ExportReady &&
            (action == UiAction::Back || action == UiAction::Left)) {
            handled = true;
            changed = libraryController.back();
        } else if (libraryController.view() == LibraryView::SessionDetail &&
            (action == UiAction::Back || action == UiAction::Left)) {
            handled = true;
            changed = libraryController.back();
        } else if (libraryController.view() == LibraryView::SessionDetail &&
                   (action == UiAction::Select ||
                    action == UiAction::Right)) {
            handled = true;
            changed = libraryController.requestExport();
        } else if (libraryController.view() == LibraryView::SessionList) {
            if (action == UiAction::Up) {
                handled = true;
                changed = libraryController.previous();
            } else if (action == UiAction::Down) {
                handled = true;
                changed = libraryController.next();
            } else if (action == UiAction::Select || action == UiAction::Right) {
                handled = true;
                changed = libraryController.openSelected();
            }
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == 4) {
        if (captureView == CaptureView::SourceMenu) {
            bool handled = false;
            bool changed = false;
            if (action == UiAction::Up && captureSourceSelection != 0) {
                captureSourceSelection = 0;
                handled = changed = true;
            } else if (action == UiAction::Down &&
                       captureSourceSelection != 1) {
                captureSourceSelection = 1;
                handled = changed = true;
            } else if ((action == UiAction::Select ||
                        action == UiAction::Right) &&
                       (captureSourceSelection == 0 ||
                        BoardProfile::kIrDeclared)) {
                captureView = captureSourceSelection == 0
                    ? CaptureView::Wifi : CaptureView::Infrared;
                lastRuntimeEvent = captureSourceSelection == 0
                    ? "capture_wifi_setup" : "capture_infrared_setup";
                handled = changed = true;
            }
            if (handled) {
                uiController.recordHandledAction(action);
                return finish(changed);
            }
        } else if (captureView == CaptureView::Infrared) {
            const auto state = infraredCapture.stats().state;
            if (state == InfraredCaptureState::Idle &&
                (action == UiAction::Select || action == UiAction::Right)) {
                uiController.recordHandledAction(action);
                return finish(startInfraredCapture());
            }
            if (state == InfraredCaptureState::Complete &&
                infraredCapturePersistState == CapturePersistState::Result &&
                (action == UiAction::Select || action == UiAction::Right)) {
                uiController.recordHandledAction(action);
                return finish(requestInfraredRawCapturePersist());
            }
            if (infraredCapturePersistState == CapturePersistState::Saving) {
                uiController.recordHandledAction(action);
                return finish(false);
            }
            if (state == InfraredCaptureState::Complete &&
                infraredCapturePersistState != CapturePersistState::Result &&
                (action == UiAction::Select || action == UiAction::Right)) {
                uiController.recordHandledAction(action);
                return finish(startInfraredCapture());
            }
            if (state != InfraredCaptureState::Waiting &&
                state != InfraredCaptureState::Capturing &&
                state != InfraredCaptureState::Complete &&
                (action == UiAction::Select || action == UiAction::Right)) {
                uiController.recordHandledAction(action);
                return finish(startInfraredCapture());
            }
            if (action == UiAction::Back || action == UiAction::Left) {
                if (state == InfraredCaptureState::Waiting ||
                    state == InfraredCaptureState::Capturing) {
                    stopInfraredCapture();
                }
                infraredCapture.reset();
                infraredCapturePersistState = CapturePersistState::Result;
                infraredCapturePersistStatus = "volatile";
                infraredCapturePersistGeneration = 0;
                captureView = CaptureView::SourceMenu;
                lastRuntimeEvent = "capture_source_menu";
                uiController.recordHandledAction(action);
                return finish(true);
            }
        } else {
        const auto state = wifiFrameCapture.stats().state;
        if (state == WifiFrameCaptureState::Idle &&
            (action == UiAction::Select || action == UiAction::Right)) {
            uiController.recordHandledAction(action);
            return finish(startWifiFrameCapture());
        }
        if (state == WifiFrameCaptureState::Running &&
            (action == UiAction::Select || action == UiAction::Right)) {
            uiController.recordHandledAction(action);
            return finish(stopWifiFrameCapture());
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Result &&
            (action == UiAction::Select || action == UiAction::Right)) {
            capturePersistState = CapturePersistState::Confirm;
            capturePersistStatus = "awaiting_confirmation";
            lastRuntimeEvent = "capture_store_confirm";
            uiController.recordHandledAction(action);
            return finish(true);
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Confirm &&
            (action == UiAction::Select || action == UiAction::Right)) {
            uiController.recordHandledAction(action);
            return finish(requestWifiFrameCapturePersist());
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Confirm &&
            (action == UiAction::Back || action == UiAction::Left)) {
            capturePersistState = CapturePersistState::Result;
            capturePersistStatus = "volatile";
            lastRuntimeEvent = "capture_store_cancelled";
            uiController.recordHandledAction(action);
            return finish(true);
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Saving) {
            uiController.recordHandledAction(action);
            return finish(false);
        }
        if (action == UiAction::Back || action == UiAction::Left) {
            if (state == WifiFrameCaptureState::Running) {
                stopWifiFrameCapture();
            }
            wifiFrameCapture.reset();
            capturePersistState = CapturePersistState::Result;
            capturePersistStatus = "volatile";
            capturePersistGeneration = 0;
            nextCaptureUiRefreshUs = 0;
            captureView = CaptureView::SourceMenu;
            lastRuntimeEvent = "capture_source_menu";
            uiController.recordHandledAction(action);
            return finish(true);
        }
        }
    }
    if (!wasRoot && uiController.page() == kDevicePage) {
        bool handled = false;
        bool changed = false;
        if (action == UiAction::Up && deviceSelection > 0) {
            handled = true;
            --deviceSelection;
            changed = true;
        } else if (action == UiAction::Down &&
                   deviceSelection + 1U < kDeviceItemCount) {
            handled = true;
            ++deviceSelection;
            changed = true;
        } else if (action == UiAction::Select || action == UiAction::Right) {
            handled = true;
            constexpr std::uint8_t pages[kDeviceItemCount] = {
                kPowerPage, 5, 6, 1, kAboutPage,
            };
            changed = uiController.openChild(pages[deviceSelection]);
            if (changed && deviceSelection == 1) languageController.enter();
            lastRuntimeEvent = changed ? "device_item_opened"
                                       : "device_item_rejected";
        }
        if (handled) {
            if (action == UiAction::Up || action == UiAction::Down) {
                uiController.recordHandledAction(action);
            }
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == kPowerPage &&
        (action == UiAction::Select || action == UiAction::Right)) {
        const bool changed = performBoundedLightSleep(1000000ULL);
        lastRuntimeEvent = changed ? "power_sleep_resumed"
                                   : "power_sleep_rejected";
        uiController.recordHandledAction(action);
        return finish(changed);
    }
    if (!wasRoot && uiController.page() == 5) {
        bool handled = false;
        bool changed = false;
        if (action == UiAction::Up) {
            handled = true;
            changed = languageController.previous();
        } else if (action == UiAction::Down) {
            handled = true;
            changed = languageController.next();
        } else if (action == UiAction::Select || action == UiAction::Right) {
            handled = true;
            const UiLanguage requested = languageController.selected();
            const bool persisted = saveUiLanguage(requested);
            changed = persisted && languageController.apply();
            lastRuntimeEvent = persisted ? "language_persisted"
                                         : "language_persist_failed";
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == 6) {
