anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
        bool handled = false;
        bool changed = false;
        if (selfTestController.view() == SelfTestView::ModeMenu &&
            action == UiAction::Up) {
            handled = true;
            changed = selfTestController.previousMode();
        } else if (selfTestController.view() == SelfTestView::ModeMenu &&
                   action == UiAction::Down) {
            handled = true;
            changed = selfTestController.nextMode();
        } else if (action == UiAction::Select || action == UiAction::Right) {
            handled = true;
            const std::uint64_t startedUs =
                static_cast<std::uint64_t>(esp_timer_get_time());
            const bool completesFullPlan =
                selfTestController.view() == SelfTestView::VisualCheck &&
                selfTestController.visualState() + 1U >=
                    SelfTestController::kVisualStateCount;
            if (completesFullPlan) runShieldReceiverSelfTestProbe();
            changed = selfTestController.activate(snapshotSelfTestFacts(),
                                                   startedUs);
            if (changed &&
                selfTestController.view() == SelfTestView::ActiveChecks) {
                fullGuidedRfState = {};
                fullGuidedArtifactState = {};
                fullGuidedNrf24Report = {};
                fullGuidedCc1101Report = {};
                fullGuidedRfStartAfterUs = startedUs + 500000ULL;
                lastRuntimeEvent = "self_test_active_rf_pending";
            }
            if (selfTestController.runAwaitingFinish() &&
                selfTestController.view() == SelfTestView::Result) {
                selfTestController.finishRun(
                    static_cast<std::uint64_t>(esp_timer_get_time()));
                lastRuntimeEvent = leshy1::apps::self_test::
                    selfTestResultStatusName(selfTestController.report().status);
            } else if (selfTestController.view() == SelfTestView::VisualCheck) {
                lastRuntimeEvent = "self_test_visual_check";
            } else if (selfTestController.view() ==
                       SelfTestView::ActiveChecks) {
                lastRuntimeEvent = "self_test_active_rf_pending";
            } else if (changed) {
                lastRuntimeEvent = "self_test_preflight";
            }
        } else if (action == UiAction::Back || action == UiAction::Left) {
            bool cleanupReady = true;
            if (selfTestController.view() == SelfTestView::ActiveChecks) {
                cleanupReady = cancelFullGuidedRfChecks();
            }
            changed = cleanupReady && selfTestController.back();
            handled = changed;
            if (changed) {
                lastRuntimeEvent = "self_test_modes";
            } else if (!cleanupReady) {
                handled = true;
                lastRuntimeEvent = "self_test_cancel_cleanup_failed";
            }
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    const bool wantsLaunch = wasRoot && (action == UiAction::Select || action == UiAction::Right);
    bool openable = selected != nullptr && selected->enabled;
    LaunchStatus launchStatus = LaunchStatus::InvalidDescriptor;
    if (wantsLaunch) {
        launchStatus = selected == nullptr
                           ? LaunchStatus::InvalidDescriptor
                           : appRuntime.launch(selected->id, selected->enabled, selected->resources);
        lastRuntimeEvent = leshy1::kernel::runtime::launchStatusName(launchStatus);
        openable = launchStatus == LaunchStatus::Started;
        if (openable && selected != nullptr &&
            std::strcmp(selected->id, "language") == 0) {
            languageController.enter();
        }
        if (openable && selected != nullptr &&
            std::strcmp(selected->id, "device") == 0) {
            deviceSelection = 0;
        }
        if (openable && selected != nullptr &&
            std::strcmp(selected->id, "capture") == 0) {
            captureView = CaptureView::SourceMenu;
            captureSourceSelection = 0;
            wifiFrameCapture.reset();
            capturePersistState = CapturePersistState::Result;
            capturePersistStatus = "volatile";
            capturePersistGeneration = 0;
            infraredCapture.reset();
            infraredReceiverReport = {};
            infraredCapturePersistState = CapturePersistState::Result;
            infraredCapturePersistStatus = "volatile";
            infraredCapturePersistGeneration = 0;
            nextCaptureUiRefreshUs = 0;
        }
        const bool surveyApp = selected != nullptr &&
            (std::strcmp(selected->id, "wifi") == 0 ||
             std::strcmp(selected->id, "ble") == 0);
        const bool spectrumApp = selected != nullptr &&
            (std::strcmp(selected->id, "spectrum24") == 0 ||
             std::strcmp(selected->id, "subghz") == 0);
        if (openable && selected != nullptr && (surveyApp || spectrumApp)) {
            if (rfSpectrumView != RfSpectrumView::None ||
                boardNrf24Spectrum.active() ||
                boardCc1101Spectrum.active()) {
                stopCurrentSpectrum(false);
            } else {
                nrf24SpectrumController.reset();
                nrf24SignalFinder.reset();
                nrf24SpectrumReport = {};
                cc1101SignalFinder.reset();
                cc1101SpectrumController.reset();
                cc1101SpectrumReport = {};
            }
            rfSpectrumKind = RfSpectrumKind::Nrf24;
            rfSpectrumSelection = 0;
            nrf24ModeSelection = 0;
            subGhzModeSelection = 0;
            rfCcBandSelection =
                leshy1::drivers::radio::Cc1101SpectrumBand::Band433;
            nextSpectrumUiRefreshUs = 0;
            if (surveyApp) {
                const bool wifiApp = std::strcmp(selected->id, "wifi") == 0;
                if (wifiApp) {
                    wifiFrameCapture.reset();
                    wifiDeviceCatalog.reset();
                    wifiDeviceNavigationOrder.reset();
                    wifiDeviceSelection = 0;
                    wifiDeviceDetail = {};
                    nextWifiDeviceUiRefreshUs = 0;
                }
                wifiProductView = wifiApp ? WifiProductView::Menu
                                          : WifiProductView::None;
                wifiProductSelection = 0;
                if (!wifiApp) {
                    bleProductView = BleProductView::None;
                    startBleDevicesProduct();
                } else {
                    bleProductView = BleProductView::None;
                }
            } else if (std::strcmp(selected->id, "spectrum24") == 0) {
                wifiProductView = WifiProductView::None;
                rfSpectrumView = RfSpectrumView::Nrf24Menu;
                lastRuntimeEvent = "nrf24_modes";
            } else {
                wifiProductView = WifiProductView::None;
                rfSpectrumKind = RfSpectrumKind::Cc1101;
                rfSpectrumView = RfSpectrumView::SubGhzMenu;
                subGhzRawCapture.reset();
                subGhzCapturePersistState = CapturePersistState::Result;
                subGhzCapturePersistStatus = "volatile";
                subGhzCapturePersistGeneration = 0;
                lastRuntimeEvent = "subghz_modes";
            }
        }
    }
    const bool changed = uiController.apply(
        action, static_cast<std::uint8_t>(appCatalog.size()), openable,
        selected == nullptr ? UiController::kRootPage : selected->page);
    if (wantsLaunch && launchStatus == LaunchStatus::Started && !changed) {
        appRuntime.stop();
        lastRuntimeEvent = "launch_rolled_back";
    } else if (!wasRoot && uiController.isRoot() && changed) {
        appRuntime.stop();
        lastRuntimeEvent = "stopped";
    }
    return finish(changed);
}

struct TouchDispatchTarget final {
    TouchTarget target{};
    std::uint8_t current = 0;
};

TouchDispatchTarget touchDispatchTarget(TouchPoint point) {
    if (uiController.isRoot()) {
        const std::uint8_t first = homeFirstVisible(uiController.selection());
        return {
            leshy1::ui::hitTouchTarget(
                TouchTargetLayout::HomeRows, point, first,
                static_cast<std::uint8_t>(appCatalog.size())),
            uiController.selection(),
        };
    }
    if (uiController.page() == 2) {
        if (bleProductView == BleProductView::Devices) {
            const std::size_t first =
                bleDeviceFirstVisible(bleDeviceSelection);
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::HomeRows, point,
                        static_cast<std::uint8_t>(first),
                        static_cast<std::uint8_t>(bleDeviceCatalog.size())),
                    static_cast<std::uint8_t>(bleDeviceSelection)};
        }
        if (wifiProductView == WifiProductView::Menu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::HomeRows, point, 0,
                        kWifiProductTaskCount),
                    wifiProductSelection};
        }
        if (wifiProductView == WifiProductView::Networks &&
            surveyWorkflow.state() == SurveyWorkflowState::Running) {
            const std::size_t first =
                wifiNetworkFirstVisible(wifiNetworkSelection);
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::HomeRows, point,
                        static_cast<std::uint8_t>(first),
                        static_cast<std::uint8_t>(wifiNetworkVisibleSize())),
                    static_cast<std::uint8_t>(wifiNetworkSelection)};
        }
        if (wifiProductView == WifiProductView::Devices) {
            const std::size_t first =
                wifiDeviceFirstVisible(wifiDeviceSelection);
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::HomeRows, point,
                        static_cast<std::uint8_t>(first),
                        static_cast<std::uint8_t>(wifiDeviceVisibleSize())),
                    static_cast<std::uint8_t>(wifiDeviceSelection)};
        }
        if (rfSpectrumView == RfSpectrumView::SourceMenu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::TwoChoices, point),
                    rfSpectrumSelection};
        }
        if (rfSpectrumView == RfSpectrumView::Nrf24Menu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::TwoChoices, point),
                    nrf24ModeSelection};
        }
        if (rfSpectrumView == RfSpectrumView::SubGhzMenu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::ThreeChoices, point, 0, 3),
                    subGhzModeSelection};
        }
        if (rfSpectrumView == RfSpectrumView::CcBandMenu ||
            rfSpectrumView == RfSpectrumView::SubGhzCaptureBandMenu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::HomeRows, point, 0, 4),
                    ccBandSelectionIndex()};
        }
        if (rfSpectrumView == RfSpectrumView::None &&
            surveyWorkflow.state() == SurveyWorkflowState::Setup &&
            !productSurveySourceUnavailableVisible()) {
            const bool sources = surveySourceController.view() ==
                                 SurveySetupView::Sources;
            return {leshy1::ui::hitTouchTarget(
                        sources ? TouchTargetLayout::TwoChoices
                                : TouchTargetLayout::ThreeChoices,
                        point, 0,
                        sources
                            ? static_cast<std::uint8_t>(
                                  SurveySourceController::kSourceCount)
                            : surveySourceController.planItemCount()),
                    surveySourceController.selection()};
        }
        if (rfSpectrumView == RfSpectrumView::None &&
            surveyWorkflow.state() == SurveyWorkflowState::Running &&
            surveyController.view() == SurveyView::Filter) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::ThreeChoices, point),
                    static_cast<std::uint8_t>(surveyController.draftFilter())};
        }
    }
    if (uiController.page() == 4 &&
        captureView == CaptureView::SourceMenu) {
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::TwoChoices, point),
                captureSourceSelection};
    }
    if (uiController.page() == 5) {
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::TwoChoices, point),
                languageController.selection()};
    }
    if (uiController.page() == kDevicePage) {
        const std::uint8_t first = deviceFirstVisible(deviceSelection);
        return {
            leshy1::ui::hitTouchTarget(
                TouchTargetLayout::HomeRows, point, first, kDeviceItemCount),
            deviceSelection,
        };
    }
    if (uiController.page() == 6 &&
        selfTestController.view() == SelfTestView::ModeMenu) {
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::TwoChoices, point),
                selfTestController.selection()};
    }
    return {};
}

bool dispatchTouchPoint(TouchPoint point, bool synthetic = false) {
    lastTouchPoint = point;
    lastTouchChanged = false;
    if (synthetic) ++syntheticTouchPresses;
    const TouchDispatchTarget dispatch = touchDispatchTarget(point);
    if (!dispatch.target.hit) {
        ++touchMissedPresses;
        return false;
    }

    ++touchHandledPresses;
    std::uint8_t current = dispatch.current;
    bool changed = false;
    while (current > dispatch.target.index) {
        if (!applyUiAction(UiAction::Up, false)) break;
        --current;
        changed = true;
    }
    while (current < dispatch.target.index) {
        if (!applyUiAction(UiAction::Down, false)) break;
        ++current;
        changed = true;
    }
    if (current == dispatch.target.index) {
        changed = applyUiAction(UiAction::Select, false) || changed;
    }
    lastTouchChanged = changed;
    if (changed) renderInteractiveScreen(true);
    return changed;
}

