anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    if (sector0Read && !leshy1::storage::formatSdSector0Json(
                           sector0Inspection, sector0Summary,
                           sizeof(sector0Summary))) {
        std::strcpy(sector0Summary, "{}");
        status = "format_failed";
    }
    if (bootRead && !leshy1::storage::formatSdFilesystemBootJson(
                        bootInspection, bootSummary, sizeof(bootSummary))) {
        std::strcpy(bootSummary, "{}");
        status = "format_failed";
    }
    if (fsInfoRead && !leshy1::storage::formatSdFat32FsInfoJson(
                          fsInfoInspection, fsInfoSummary,
                          sizeof(fsInfoSummary))) {
        std::strcpy(fsInfoSummary, "{}");
        status = "format_failed";
    }
    for (std::size_t index = 0; index < identity.identity.cid.size(); ++index) {
        std::snprintf(cidHex + index * 2, sizeof(cidHex) - index * 2, "%02X",
                      static_cast<unsigned>(identity.identity.cid[index]));
    }
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.storage.sd.fsinfo.v1\",\"kind\":\"result\","
        "\"status\":\"%s\",\"identity_status\":\"%s\","
        "\"sector0_permit\":\"%s\",\"boot_permit\":\"%s\","
        "\"fsinfo_permit\":\"%s\",\"wire_status\":\"%s\","
        "\"explicitly_selected\":true,\"read_only\":true,"
        "\"blocks_requested\":3,\"blocks_read\":%u,"
        "\"sector0_lba\":0,\"boot_lba\":%lu,\"fsinfo_lba\":%lu,"
        "\"resource_acquired\":%s,\"owned_during\":%lu,\"owned_after\":%lu,"
        "\"spi_hz\":%lu,\"bytes_clocked\":%lu,"
        "\"identity_commands_completed\":%u,\"cid_hex\":\"%s\","
        "\"capacity_bytes\":%llu,\"sector0_wire_crc16\":%u,"
        "\"boot_wire_crc16\":%u,\"fsinfo_wire_crc16\":%u,"
        "\"gpio21_stable_high\":%s,\"cleanup_complete\":%s,"
        "\"mount_attempted\":false,\"filesystem_api_touched\":false,"
        "\"technical_metadata_only\":true,\"names_read\":false,"
        "\"fsinfo_buffer_zeroed\":%s,\"raw_sectors_retained\":false,"
        "\"file_data_read\":false,\"write_commands\":false,"
        "\"format_allowed\":false,\"nrf_ce_high_events\":0,"
        "\"radio_tx_commands\":0,\"sector0\":%s,\"boot\":%s,"
        "\"fsinfo\":%s}",
        status, leshy1::storage::sdTransportRunStatusName(identity.status),
        leshy1::storage::sdSectorReadStatusName(sector0Permit),
        leshy1::storage::sdSectorReadStatusName(bootPermit),
        leshy1::storage::sdSectorReadStatusName(fsInfoPermit),
        leshy1::storage::sdWireStatusName(transport.lastWireStatus()),
        static_cast<unsigned>(transport.dataBlockReads()),
        static_cast<unsigned long>(sector0Inspection.firstPartitionLba),
        static_cast<unsigned long>(fsInfoLba),
        resourcesAcquired ? "true" : "false",
        static_cast<unsigned long>(ownedDuring),
        static_cast<unsigned long>(ownedAfter),
        static_cast<unsigned long>(BoardProfile::kSdIdentificationSpiHz),
        static_cast<unsigned long>(transport.bytesClocked()),
        static_cast<unsigned>(identity.commandsCompleted), cidHex,
        static_cast<unsigned long long>(identity.identity.capacityBytes),
        static_cast<unsigned>(sector0WireCrc16),
        static_cast<unsigned>(bootWireCrc16),
        static_cast<unsigned>(fsInfoWireCrc16),
        transport.gpio21StableHigh() ? "true" : "false",
        transport.cleanupComplete() ? "true" : "false",
        fsInfoBufferZeroed ? "true" : "false",
        sector0Summary, bootSummary, fsInfoSummary);
    reply.println(line);
}

void emitPhysicalSdFatReserved(Stream& reply) {
    auto& line = sdPhysicalEvidence.line;
    auto& sector0Summary = sdPhysicalEvidence.summaryA;
    auto& bootSummary = sdPhysicalEvidence.summaryB;
    auto& fatSummary = sdPhysicalEvidence.summaryC;
    auto& cidHex = sdPhysicalEvidence.cidHex;
    auto& sector0 = sdPhysicalEvidence.sectorA;
    auto& bootSector = sdPhysicalEvidence.sectorB;
    auto& fatSector = sdPhysicalEvidence.sectorC;
    cidHex[0] = '\0';
    std::strcpy(sector0Summary, "{}");
    std::strcpy(bootSummary, "{}");
    std::strcpy(fatSummary, "{}");
    sector0.fill(0);
    bootSector.fill(0);
    fatSector.fill(0);

    const bool idleUi = uiController.isRoot() && !appRuntime.running();
    const bool resourcesAcquired = idleUi && resourceBroker.acquire(
        kSdIdentificationOwner, leshy1::storage::kSdIdentificationResources);
    const std::uint32_t ownedDuring =
        resourceBroker.ownedBy(kSdIdentificationOwner);
    BoardSdSpiTransport transport;
    const bool adapterBegun = resourcesAcquired && transport.begin();
    leshy1::storage::SdTransportRunResult identity;
    leshy1::storage::SdSectorReadStatus sector0Permit =
        leshy1::storage::SdSectorReadStatus::ExplicitTargetRequired;
    leshy1::storage::SdSectorReadStatus bootPermit =
        leshy1::storage::SdSectorReadStatus::ExplicitTargetRequired;
    leshy1::storage::SdSectorReadStatus fsInfoPermit =
        leshy1::storage::SdSectorReadStatus::ExplicitTargetRequired;
    leshy1::storage::SdSectorReadStatus fatPermit =
        leshy1::storage::SdSectorReadStatus::ExplicitTargetRequired;
    leshy1::storage::SdSector0Inspection sector0Inspection;
    leshy1::storage::SdFilesystemBootInspection bootInspection;
    leshy1::storage::SdFat32FsInfoInspection fsInfoInspection;
    leshy1::storage::SdFat32ReservedInspection fatInspection;
    leshy1::storage::SdFat32FsInfoCrossCheck crossCheck;
    bool sector0Read = false;
    bool bootRead = false;
    bool fsInfoRead = false;
    bool fatRead = false;
    bool fsInfoBufferZeroed = false;
    bool fatBufferZeroed = false;
    std::uint32_t fsInfoLba = 0;
    std::uint32_t firstFatLba = 0;
    std::uint16_t sector0WireCrc16 = 0;
    std::uint16_t bootWireCrc16 = 0;
    std::uint16_t fsInfoWireCrc16 = 0;
    std::uint16_t fatWireCrc16 = 0;
    const char* status = "resource_unavailable";

    if (adapterBegun) {
        leshy1::storage::SdTransportRunPolicy identityPolicy;
        identityPolicy.allowPhysical = true;
        identityPolicy.explicitlySelected = true;
        identityPolicy.identificationOnly = true;
        identityPolicy.ownedResources = ownedDuring;
        identity = leshy1::storage::runSdIdentificationStateMachine(
            leshy1::storage::defaultSdIdentificationPlan(), transport,
            identityPolicy);
        if (identity.status == leshy1::storage::SdTransportRunStatus::Valid) {
            leshy1::storage::SdSectorReadRequest request;
            request.explicitlySelected = true;
            request.readOnly = true;
            request.highCapacity = identity.identity.highCapacity;
            request.capacityBytes = identity.identity.capacityBytes;
            request.lba = 0;
            request.blockCount = 1;
            request.ownedResources = ownedDuring;
            sector0Permit = leshy1::storage::authorizeSdSector0Read(request);
            if (sector0Permit == leshy1::storage::SdSectorReadStatus::Permitted) {
                sector0Read = transport.readSingleBlock(
                    0, &sector0, &sector0WireCrc16);
            }
            if (sector0Read) {
                sector0Inspection = leshy1::storage::inspectSdSector0(
                    sector0, identity.identity.capacityBytes);
                request.lba = sector0Inspection.firstPartitionLba;
                bootPermit = leshy1::storage::authorizeSdPartitionBootRead(
                    sector0Inspection, request);
                if (bootPermit == leshy1::storage::SdSectorReadStatus::Permitted) {
                    bootRead = transport.readSingleBlock(
                        request.lba, &bootSector, &bootWireCrc16);
                }
                if (bootRead) {
                    bootInspection = leshy1::storage::inspectSdFilesystemBoot(
                        bootSector, sector0Inspection.firstPartitionSectors);
                    const bool targetsValid =
                        leshy1::storage::calculateSdFat32FsInfoLba(
                            sector0Inspection, bootInspection, &fsInfoLba) &&
                        leshy1::storage::calculateSdFat32FirstFatLba(
                            sector0Inspection, bootInspection, &firstFatLba) &&
                        bootInspection.rootCluster == 2;
                    if (targetsValid) {
                        request.lba = fsInfoLba;
                        fsInfoPermit = leshy1::storage::authorizeSdFat32FsInfoRead(
                            sector0Inspection, bootInspection, request);
                        if (fsInfoPermit ==
                            leshy1::storage::SdSectorReadStatus::Permitted) {
                            fsInfoRead = transport.readSingleBlock(
                                request.lba, &fatSector, &fsInfoWireCrc16);
                        }
                        if (fsInfoRead) {
                            fsInfoInspection =
                                leshy1::storage::inspectSdFat32FsInfo(
                                    fatSector, bootInspection);
                            fatSector.fill(0);
                            fsInfoBufferZeroed = true;
                            request.lba = firstFatLba;
                            fatPermit = leshy1::storage::
                                authorizeSdFat32FirstFatSectorRead(
                                    sector0Inspection, bootInspection, request);
                            if (fatPermit ==
                                leshy1::storage::SdSectorReadStatus::Permitted) {
                                fatRead = transport.readSingleBlock(
                                    request.lba, &fatSector, &fatWireCrc16);
                            }
                            if (fatRead) {
                                fatInspection = leshy1::storage::
                                    inspectSdFat32ReservedAndRootEntries(
                                        fatSector, bootInspection);
                                crossCheck = leshy1::storage::
                                    crossCheckSdFat32FsInfoWithReservedEntries(
                                        fsInfoInspection, fatInspection,
                                        bootInspection);
                                fatSector.fill(0);
                                fatBufferZeroed = true;
                                if (!fatInspection.structureValid) {
                                    status = "fat_structure_invalid";
                                } else if (!crossCheck.compatible) {
                                    status = "fsinfo_cross_check_failed";
                                } else if (!fatInspection.cleanShutdown ||
                                           !fatInspection.noHardError) {
                                    status = "fat_health_warning";
                                } else {
                                    status = "valid";
                                }
                            } else {
                                status = "fat_read_failed";
                            }
                        } else {
                            status = "fsinfo_read_failed";
                        }
                    } else {
                        status = bootInspection.rootCluster == 2
                            ? "technical_lba_invalid" : "root_cluster_not_2";
                    }
                } else {
                    status = "boot_read_failed";
                }
            } else {
                status = "sector0_read_failed";
            }
        } else {
            status = "identity_failed";
        }
        transport.end();
    } else if (!idleUi) {
        status = "ui_not_idle";
    } else if (resourcesAcquired) {
        status = "adapter_begin_failed";
    }
    fatSector.fill(0);
    if (fsInfoRead) fsInfoBufferZeroed = true;
    if (fatRead) fatBufferZeroed = true;
    resourceBroker.releaseAll(kSdIdentificationOwner);
    const std::uint32_t ownedAfter =
        resourceBroker.ownedBy(kSdIdentificationOwner);

    if (sector0Read && !leshy1::storage::formatSdSector0Json(
                           sector0Inspection, sector0Summary,
                           sizeof(sector0Summary))) {
        std::strcpy(sector0Summary, "{}");
        status = "format_failed";
    }
    if (bootRead && !leshy1::storage::formatSdFilesystemBootJson(
                        bootInspection, bootSummary, sizeof(bootSummary))) {
        std::strcpy(bootSummary, "{}");
        status = "format_failed";
    }
    if (fatRead && !leshy1::storage::formatSdFat32ReservedInspectionJson(
                       fatInspection, fatSummary, sizeof(fatSummary))) {
        std::strcpy(fatSummary, "{}");
        status = "format_failed";
    }
    for (std::size_t index = 0; index < identity.identity.cid.size(); ++index) {
        std::snprintf(cidHex + index * 2, sizeof(cidHex) - index * 2, "%02X",
                      static_cast<unsigned>(identity.identity.cid[index]));
    }
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.storage.sd.fat_reserved.v1\",\"kind\":\"result\","
        "\"status\":\"%s\",\"identity_status\":\"%s\","
        "\"sector0_permit\":\"%s\",\"boot_permit\":\"%s\","
        "\"fsinfo_permit\":\"%s\",\"fat_permit\":\"%s\","
        "\"wire_status\":\"%s\",\"explicitly_selected\":true,"
        "\"read_only\":true,\"blocks_requested\":4,\"blocks_read\":%u,"
        "\"sector0_lba\":0,\"boot_lba\":%lu,\"fsinfo_lba\":%lu,"
        "\"first_fat_lba\":%lu,\"fat_entries_inspected\":3,"
        "\"resource_acquired\":%s,\"owned_during\":%lu,\"owned_after\":%lu,"
        "\"spi_hz\":%lu,\"bytes_clocked\":%lu,"
        "\"identity_commands_completed\":%u,\"cid_hex\":\"%s\","
        "\"capacity_bytes\":%llu,\"sector0_wire_crc16\":%u,"
        "\"boot_wire_crc16\":%u,\"fsinfo_wire_crc16\":%u,"
        "\"fat_wire_crc16\":%u,\"fsinfo_signatures_valid\":%s,"
        "\"fsinfo_hints_valid\":%s,\"fsinfo_data_clusters\":%lu,"
        "\"fsinfo_free_count_known\":%s,\"fsinfo_free_clusters\":%lu,"
        "\"fsinfo_next_free_known\":%s,\"fsinfo_next_free_cluster\":%lu,"
        "\"cross_check_available\":%s,\"free_hint_compatible\":%s,"
        "\"next_free_hint_compatible\":%s,\"cross_check_compatible\":%s,"
        "\"gpio21_stable_high\":%s,\"cleanup_complete\":%s,"
        "\"mount_attempted\":false,\"filesystem_api_touched\":false,"
        "\"technical_metadata_only\":true,\"names_read\":false,"
        "\"fsinfo_buffer_zeroed\":%s,\"fat_buffer_zeroed\":%s,"
        "\"raw_sectors_retained\":false,\"fat_chain_followed\":false,"
        "\"file_data_read\":false,\"write_commands\":false,"
        "\"format_allowed\":false,\"nrf_ce_high_events\":0,"
        "\"radio_tx_commands\":0,\"sector0\":%s,\"boot\":%s,\"fat\":%s}",
        status, leshy1::storage::sdTransportRunStatusName(identity.status),
        leshy1::storage::sdSectorReadStatusName(sector0Permit),
        leshy1::storage::sdSectorReadStatusName(bootPermit),
        leshy1::storage::sdSectorReadStatusName(fsInfoPermit),
        leshy1::storage::sdSectorReadStatusName(fatPermit),
        leshy1::storage::sdWireStatusName(transport.lastWireStatus()),
        static_cast<unsigned>(transport.dataBlockReads()),
        static_cast<unsigned long>(sector0Inspection.firstPartitionLba),
        static_cast<unsigned long>(fsInfoLba),
        static_cast<unsigned long>(firstFatLba),
        resourcesAcquired ? "true" : "false",
        static_cast<unsigned long>(ownedDuring),
        static_cast<unsigned long>(ownedAfter),
        static_cast<unsigned long>(BoardProfile::kSdIdentificationSpiHz),
        static_cast<unsigned long>(transport.bytesClocked()),
        static_cast<unsigned>(identity.commandsCompleted), cidHex,
        static_cast<unsigned long long>(identity.identity.capacityBytes),
        static_cast<unsigned>(sector0WireCrc16),
        static_cast<unsigned>(bootWireCrc16),
        static_cast<unsigned>(fsInfoWireCrc16),
        static_cast<unsigned>(fatWireCrc16),
        fsInfoInspection.signaturesValid ? "true" : "false",
        fsInfoInspection.hintsValid ? "true" : "false",
        static_cast<unsigned long>(fsInfoInspection.dataClusters),
        fsInfoInspection.freeCountKnown ? "true" : "false",
        static_cast<unsigned long>(fsInfoInspection.freeClusters),
        fsInfoInspection.nextFreeKnown ? "true" : "false",
        static_cast<unsigned long>(fsInfoInspection.nextFreeCluster),
        crossCheck.available ? "true" : "false",
        crossCheck.freeHintCompatible ? "true" : "false",
        crossCheck.nextFreeHintCompatible ? "true" : "false",
        crossCheck.compatible ? "true" : "false",
        transport.gpio21StableHigh() ? "true" : "false",
        transport.cleanupComplete() ? "true" : "false",
        fsInfoBufferZeroed ? "true" : "false",
        fatBufferZeroed ? "true" : "false",
        sector0Summary, bootSummary, fatSummary);
    reply.println(line);
}

void emitPhysicalSdRootMetadata(Stream& reply) {
    auto& line = sdPhysicalEvidence.line;
    auto& sector0Summary = sdPhysicalEvidence.summaryA;
    auto& bootSummary = sdPhysicalEvidence.summaryB;
    auto& directorySummary = sdPhysicalEvidence.summaryC;
    auto& cidHex = sdPhysicalEvidence.cidHex;
    auto& sector0 = sdPhysicalEvidence.sectorA;
    auto& bootSector = sdPhysicalEvidence.sectorB;
    auto& directorySector = sdPhysicalEvidence.sectorC;
    cidHex[0] = '\0';
    std::strcpy(sector0Summary, "{}");
    std::strcpy(bootSummary, "{}");
    std::strcpy(directorySummary, "{}");
    sector0.fill(0);
    bootSector.fill(0);
    directorySector.fill(0);

    const bool idleUi = uiController.isRoot() && !appRuntime.running();
    const bool resourcesAcquired = idleUi && resourceBroker.acquire(
        kSdIdentificationOwner, leshy1::storage::kSdIdentificationResources);
    const std::uint32_t ownedDuring =
        resourceBroker.ownedBy(kSdIdentificationOwner);
    BoardSdSpiTransport transport;
    const bool adapterBegun = resourcesAcquired && transport.begin();
    leshy1::storage::SdTransportRunResult identity;
    leshy1::storage::SdSectorReadStatus sector0Permit =
        leshy1::storage::SdSectorReadStatus::ExplicitTargetRequired;
    leshy1::storage::SdSectorReadStatus bootPermit =
        leshy1::storage::SdSectorReadStatus::ExplicitTargetRequired;
    leshy1::storage::SdSectorReadStatus directoryPermit =
        leshy1::storage::SdSectorReadStatus::ExplicitTargetRequired;
    leshy1::storage::SdSector0Inspection sector0Inspection;
    leshy1::storage::SdFilesystemBootInspection bootInspection;
    leshy1::storage::SdFat32DirectoryAggregate directoryAggregate;
    bool sector0Read = false;
    bool bootRead = false;
    bool directoryRead = false;
    bool directoryBufferZeroed = false;
    std::uint32_t rootDirectoryLba = 0;
    std::uint16_t sector0WireCrc16 = 0;
    std::uint16_t bootWireCrc16 = 0;
    std::uint16_t directoryWireCrc16 = 0;
    const char* status = "resource_unavailable";

    if (adapterBegun) {
        leshy1::storage::SdTransportRunPolicy identityPolicy;
        identityPolicy.allowPhysical = true;
        identityPolicy.explicitlySelected = true;
        identityPolicy.identificationOnly = true;
        identityPolicy.ownedResources = ownedDuring;
        identity = leshy1::storage::runSdIdentificationStateMachine(
            leshy1::storage::defaultSdIdentificationPlan(), transport,
            identityPolicy);
        if (identity.status == leshy1::storage::SdTransportRunStatus::Valid) {
            leshy1::storage::SdSectorReadRequest request;
            request.explicitlySelected = true;
            request.readOnly = true;
            request.highCapacity = identity.identity.highCapacity;
            request.capacityBytes = identity.identity.capacityBytes;
            request.lba = 0;
            request.blockCount = 1;
            request.ownedResources = ownedDuring;
            sector0Permit = leshy1::storage::authorizeSdSector0Read(request);
            if (sector0Permit == leshy1::storage::SdSectorReadStatus::Permitted) {
                sector0Read = transport.readSingleBlock(
                    0, &sector0, &sector0WireCrc16);
            }
            if (sector0Read) {
                sector0Inspection = leshy1::storage::inspectSdSector0(
                    sector0, identity.identity.capacityBytes);
                request.lba = sector0Inspection.firstPartitionLba;
                bootPermit = leshy1::storage::authorizeSdPartitionBootRead(
                    sector0Inspection, request);
                if (bootPermit == leshy1::storage::SdSectorReadStatus::Permitted) {
                    bootRead = transport.readSingleBlock(
                        request.lba, &bootSector, &bootWireCrc16);
                }
                if (bootRead) {
                    bootInspection = leshy1::storage::inspectSdFilesystemBoot(
                        bootSector, sector0Inspection.firstPartitionSectors);
                    if (leshy1::storage::calculateSdFat32RootDirectoryLba(
                            sector0Inspection, bootInspection,
                            &rootDirectoryLba)) {
                        status = "valid";
                        for (std::uint8_t sectorOffset = 0;
                             sectorOffset < bootInspection.sectorsPerCluster;
                             ++sectorOffset) {
                            request.lba = rootDirectoryLba + sectorOffset;
                            directoryPermit = leshy1::storage::
                                authorizeSdFat32RootDirectorySectorRead(
                                    sector0Inspection, bootInspection,
                                    sectorOffset, request);
                            if (directoryPermit !=
                                leshy1::storage::SdSectorReadStatus::Permitted) {
                                status = "directory_permit_rejected";
                                break;
                            }
                            directoryRead = transport.readSingleBlock(
                                request.lba, &directorySector,
                                &directoryWireCrc16);
                            if (!directoryRead ||
                                !leshy1::storage::appendSdFat32DirectoryMetadata(
                                    directorySector, &directoryAggregate)) {
                                status = "directory_read_failed";
                                directorySector.fill(0);
                                directoryBufferZeroed = true;
                                break;
                            }
                            directorySector.fill(0);
                            directoryBufferZeroed = true;
                            if (directoryAggregate.endMarkerSeen) break;
                        }
                        if (std::strcmp(status, "valid") == 0 &&
                            !directoryAggregate.endMarkerSeen) {
                            status = "cluster_boundary_reached";
                        }
                    } else {
                        status = "root_lba_invalid";
                    }
                } else {
                    status = "boot_read_failed";
                }
            } else {
                status = "sector0_read_failed";
            }
        } else {
            status = "identity_failed";
        }
        transport.end();
    } else if (!idleUi) {
        status = "ui_not_idle";
    } else if (resourcesAcquired) {
        status = "adapter_begin_failed";
    }
    directorySector.fill(0);
    if (directoryRead) directoryBufferZeroed = true;
    resourceBroker.releaseAll(kSdIdentificationOwner);
    const std::uint32_t ownedAfter =
        resourceBroker.ownedBy(kSdIdentificationOwner);

