anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    ledcAttach(BoardProfile::kBacklightPin, 5000, 8);
    ledcWrite(BoardProfile::kBacklightPin, 255);
    display.init();
    display.setRotation(2);
    boardTouchInput.begin(display, millis());
    touchCalibrationRequiredAtBoot =
        boardTouchInput.calibrationSource() ==
        leshy1::platform::arduino::TouchCalibrationSource::DefaultProfile;
    touchCalibrationSucceededAtBoot = !touchCalibrationRequiredAtBoot;
    languageController.restore(loadUiLanguage());
    bootMetrics.displayReadyUs = static_cast<std::uint64_t>(esp_timer_get_time());
    feedRuntimeSafetyWatchdog();

    Wire.begin(BoardProfile::kI2cSdaPin, BoardProfile::kI2cSclPin, kI2cHz);
    bootMetrics.inputDetected =
        probeInputAtBoot(&lastInputRaw, &bootMetrics.inputProbeAttempts);
    powerManagerAddressAck =
        probeI2cAddressAck(BoardProfile::kPowerManagerAddress);
    bootMetrics.inputProbeTransientRetries =
        bootMetrics.inputProbeAttempts == 0
            ? 0
            : static_cast<std::uint8_t>(bootMetrics.inputProbeAttempts - 1U);
    bootMetrics.inputRaw = lastInputRaw;
    physicalButtonInput.reset(lastInputRaw, millis());
    physicalInputEvents = xQueueCreate(kPhysicalInputQueueCapacity,
                                       sizeof(PhysicalInputEvent));
    if (physicalInputEvents != nullptr) {
        physicalInputTaskStarted =
            xTaskCreatePinnedToCore(pollPhysicalInput, "leshy-input", 4096,
                                    nullptr, 2, &physicalInputTaskHandle, 0) == pdPASS;
    }
    bootMetrics.inputDetected =
        bootMetrics.inputDetected && physicalInputTaskStarted;
    bootMetrics.inputReadyUs = static_cast<std::uint64_t>(esp_timer_get_time());
    feedRuntimeSafetyWatchdog();
    if (!safetySupervisor.latched()) {
        surveyDemoReady = prepareSurveyDemo();
        libraryDemoReady = prepareLibraryDemo();
        recoverProductCatalogAtBoot();
        storageDiscovery = boardStorageAdapter.discoverReadOnly();
        storageDiscoveryReady =
            leshy1::storage::validateMediaDiscovery(storageDiscovery) ==
            leshy1::storage::MediaDiscoveryValidation::Valid;
        productSurveyWorkerReady = initializeProductSurveyWorker();
        captureStoreEvents = xQueueCreate(1, sizeof(CaptureStoreEvent));
        subGhzCaptureStoreEvents = xQueueCreate(1, sizeof(CaptureStoreEvent));
        infraredCaptureStoreEvents = xQueueCreate(1, sizeof(CaptureStoreEvent));
    } else {
        productBootRecovery.status = "safety_latched";
        productBootRecovery.cleanupComplete = true;
    }
    feedRuntimeSafetyWatchdog();
    if (!BoardSafeOutputs::buzzerHeldInactive() ||
        !BoardSafeOutputs::radioTransmitPathsHeldInactive()) {
        latchSafetyStopInTask(SafetyReason::OutputInvariant);
    }

    inventory.add({"board.profile",
                   flashMatches && psramMatches ? CapabilityState::Available
                                                : CapabilityState::Fault,
                   "runtime_flash_psram",
                   flashMatches && psramMatches ? "profile_match" : "profile_mismatch"});
    inventory.add({"display.tft", CapabilityState::Declared, "render_attempted",
                   "awaiting_visual_observation"});
    inventory.add({"output.buzzer.safe",
                   bootMetrics.buzzerInactive ? CapabilityState::Available
                                              : CapabilityState::Fault,
                   "gpio2_output_low_runtime_check",
                   bootMetrics.buzzerInactive ? "inactive_boot_invariant"
                                              : "unsafe_level_or_mode"});
    inventory.add({
        "safety.supervisor",
        safetySupervisor.latched() || runtimeSafetyWatchdogReady
            ? CapabilityState::Available : CapabilityState::Declared,
        "panic_task_wdt_plus_rtc_latch",
        safetySupervisor.latched() ? "latched_safe_mode"
                                   : "runtime_watchdog_armed"});
    inventory.add({"input.pcf8574",
                   bootMetrics.inputDetected ? CapabilityState::Detected
                                             : CapabilityState::Unknown,
                   "i2c_read_only_0x20",
                   bootMetrics.inputDetected ? "raw_byte_available" : "no_read_response"});
    inventory.add({
        "power.manager",
        powerManagerAddressAck ? CapabilityState::Detected
                               : CapabilityState::Unknown,
        "i2c_address_only_ack_0x75",
        powerManagerAddressAck ? "present_register_map_unidentified"
                               : "no_address_ack"});
    inventory.add({
        "power.voltage",
        CapabilityState::Unknown,
        "gpio2_reserved_output_low",
        "unavailable_buzzer_shared_adc_forbidden"});
    inventory.add({
        "power.safe_write",
        CapabilityState::Available,
        "atomic_store_plus_confirmed_low_voltage_gate",
        "atomic_only_without_trusted_voltage"});
    inventory.add({
        "power.sleep_resume",
        CapabilityState::Declared,
        "bounded_timer_light_sleep",
        "runtime_gate_available"});
    inventory.add({
        "input.touch",
        boardTouchInput.ready() ? CapabilityState::Available
                                : CapabilityState::Declared,
        leshy1::platform::arduino::touchCalibrationSourceName(
            boardTouchInput.calibrationSource()),
        boardTouchInput.calibrationSource() == TouchCalibrationSource::Leshy1
            ? "v1_calibration_loaded"
            : (boardTouchInput.calibrationSource() ==
                       TouchCalibrationSource::Legacy0x
                   ? "legacy_0x_calibration_loaded"
                   : "calibration_required")});
    inventory.add({"radio.wifi", CapabilityState::Declared, "esp32_s3_builtin",
                   "passive_contract_ready_driver_not_started"});
    inventory.add({
        "capture.wifi_passive",
        flashMatches && psramMatches ? CapabilityState::Available
                                     : CapabilityState::Fault,
        "explicit_promiscuous_rx_only_adapter",
        flashMatches && psramMatches ? "bounded_ram_capture_ready"
                                     : "board_profile_mismatch"});
    inventory.add({
        "capture.wifi_persistent",
        captureStoreEvents != nullptr && productBootRecovery.catalogAdmitted
            ? CapabilityState::Available : CapabilityState::Fault,
        "schema_v4_exact_media_background_commit",
        captureStoreEvents != nullptr && productBootRecovery.catalogAdmitted
            ? "privacy_confirmed_atomic_capture_ready"
            : "capture_worker_or_exact_media_unavailable"});
    inventory.add({
        "radio.ble",
        productSurveyWorkerReady && productBootRecovery.catalogAdmitted
            ? CapabilityState::Available : CapabilityState::Declared,
        "esp32_s3_builtin_receive_only",
        productSurveyWorkerReady && productBootRecovery.catalogAdmitted
            ? "passive_ble_worker_ready" : "product_worker_or_media_unavailable"});
    inventory.add({"survey.simulated",
                   surveyDemoReady ? CapabilityState::Available : CapabilityState::Fault,
                   "E-SURVEY-001_golden_trace",
                   surveyDemoReady ? "golden_data_rf_off" : "golden_data_invalid"});
    inventory.add({"library.simulated",
                   libraryDemoReady ? CapabilityState::Available : CapabilityState::Fault,
                   "E-STORAGE-005_ram_reopen",
                   libraryDemoReady ? "volatile_offline_fixture" : "ram_fixture_invalid"});
    if (productBootRecovery.catalogAdmitted) {
        inventory.add({"library.persistent_session", CapabilityState::Available,
                       "boot_readonly_product_catalog",
                       "validated_session_open"});
        inventory.add({
            "survey.persistent_passive",
            productSurveyWorkerReady ? CapabilityState::Available
                                     : CapabilityState::Fault,
            "boot_catalog_plus_bounded_worker",
            productSurveyWorkerReady
                ? "exact_media_and_cancellable_worker_ready"
                : "worker_initialization_failed"});
    }
    inventory.add({"storage.sd", CapabilityState::Unknown,
                   "E-STORAGE-006_gpio38_non_authoritative",
                   storageDiscoveryReady ? storageDiscovery.reason
                                         : "invalid_discovery_record"});
    inventory.add({"storage.atomicity", CapabilityState::Declared,
                   "E-STORAGE-001+guard_policy", "filesystem_backend_not_started"});
    inventory.add({"assembly.profile", CapabilityState::Available,
                   BoardProfile::kAssemblyProfileId,
                   "explicit_no_autodetect"});
    inventory.add({"assembly.gps", CapabilityState::NotApplicable,
                   BoardProfile::kAssemblyProfileId,
                   "not_fitted_by_explicit_profile"});
    inventory.add({"assembly.pn532", CapabilityState::NotApplicable,
                   BoardProfile::kAssemblyProfileId,
                   "not_fitted_by_explicit_profile"});
    inventory.add({
        "shield.ir",
        BoardProfile::kRfShieldDeclared && BoardProfile::kIrDeclared
            ? CapabilityState::Declared : CapabilityState::Unknown,
        "explicit_board_profile_rx_only_gpio21",
        BoardProfile::kRfShieldDeclared && BoardProfile::kIrDeclared
            ? "raw_capture_ready_awaiting_physical_signal"
            : "explicit_profile_required"});
    inventory.add({
        "capture.ir_passive",
        BoardProfile::kRfShieldDeclared && BoardProfile::kIrDeclared &&
                infraredCaptureStoreEvents != nullptr
            ? CapabilityState::Declared : CapabilityState::Unknown,
        "bounded_polling_raw_nec_schema_v6",
        BoardProfile::kRfShieldDeclared && BoardProfile::kIrDeclared &&
                infraredCaptureStoreEvents != nullptr
            ? "rx_only_runtime_ready_awaiting_physical_signal"
            : "profile_or_worker_unavailable"});
    inventory.add({"shield.receivers",
                   BoardProfile::kRfShieldDeclared ? CapabilityState::Declared
                                                   : CapabilityState::Unknown,
                   "board_profile_full_guided_identity_probe",
                   BoardProfile::kRfShieldDeclared
                       ? "nrf1_nrf2_cc1101_read_only_probe_available"
                       : "rf_shield_not_declared"});

